{
  "name": "android_2.2_dell",
  "date": "2014-08-26",
  "description": "This STIG contains technical security controls required for the use of the Android 2.2 (Dell version) mobile operating system in the DoD environment when managed by the Good Mobility Suite.",
  "title": "Android 2.2 (Dell) Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-18627",
      "title": "The VPN client on wireless clients (PDAs, smartphones) used for remote access to DoD networks will be FIPS 140-2 validated.  This check is not applicable if the installed VPN client is not used for remote access to DoD networks.  ",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.  FIPS validation provides a level of assurance that the encryption of the device has been securely implemented.",
      "severity": "medium"
    },
    {
      "id": "V-18856",
      "title": "Removable memory cards (e.g., MicroSD) must have data stored on the card encrypted with a FIPS 140-2 validated cryptographic module.   ",
      "description": "Memory card used to transfer files between PCs and PDAs is a migration path for the spread of malware on DoD computers and handheld devices.  These risks are mitigated by the requirements listed in this check.",
      "severity": "medium"
    },
    {
      "id": "V-19897",
      "title": "All wireless PDA clients used for remote access to DoD networks must enable AES encryption for the VPN. \n",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-19898",
      "title": "All wireless PDA clients used for remote access to DoD networks must have a VPN supporting CAC authentication. ",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-19899",
      "title": "All wireless PDA and smartphone client VPNs must have split tunneling disabled. \n\n",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-24981",
      "title": "Smartphone devices must have required operating system software versions installed.",
      "description": "Required security features are not available in earlier OS versions. In addition, there are known vulnerabilities in earlier versions.",
      "severity": "medium"
    },
    {
      "id": "V-24982",
      "title": "Smart Card Readers (SCRs) used with smartphone must have required software version installed.",
      "description": "Required security features are not available in earlier software versions. In addition, there may be known vulnerabilities in earlier versions.",
      "severity": "low"
    },
    {
      "id": "V-24983",
      "title": "S/MIME must be installed on smartphones so users can sign/encrypt email.",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.  Without S/MIME users will not be able to read encrypted email and will not be able to encrypt email with sensitive information.",
      "severity": "medium"
    },
    {
      "id": "V-24984",
      "title": "If smartphone email auto signatures are used, the signature message must not disclose the email originated from a smartphone (e.g., “Sent From My Wireless Handheld”). ",
      "description": "The disclaimer message may give information which may key an attacker in on the device. ",
      "severity": "low"
    },
    {
      "id": "V-24985",
      "title": "All Internet browsing on a DoD mobile operating system (OS) device will go through a DoD Internet proxy.  ",
      "description": "A DoD Internet proxy provides additional security over the carrier's browser.  When using the DoD Internet proxy for a mobile device Internet connections, enclave Internet security controls will filter and monitor mobile device Internet connections.",
      "severity": "low"
    },
    {
      "id": "V-24986",
      "title": "All non-core applications on the mobile OS device must be approved by the DAA or Command IT Configuration Control Board.  ",
      "description": "Non-approved applications can contain malware.  Approved applications should be reviewed and tested by the approving authority to ensure they do not contain malware, spyware, or have unexpected features (e.g., send private information to a web site, track user actions, connect to a non-DoD management server).",
      "severity": "high"
    },
    {
      "id": "V-25003",
      "title": "A compliance rule must be set up in the server defining required mobile OS software versions.",
      "description": "Unapproved OS versions do not support required security features. The security baseline of the Android system could be compromised if required security features are not available.",
      "severity": "medium"
    },
    {
      "id": "V-25007",
      "title": "Smartphones must be configured to require a password/passcode for device unlock.",
      "description": "Sensitive DoD data could be compromised if a device unlock password/passcode is not set up on a DoD smartphones.",
      "severity": "high"
    },
    {
      "id": "V-25009",
      "title": "Maximum password/passcode age must be set.",
      "description": "Sensitive DoD data could be compromised if a strong device unlock passcode is not set up on a DoD smartphone and the passcode is not changed periodically.",
      "severity": "low"
    },
    {
      "id": "V-25010",
      "title": " The smartphone inactivity timeout must be set.",
      "description": "Sensitive DoD data could be compromised if the smartphone does not automatically lock after 15 minutes of inactivity.",
      "severity": "medium"
    },
    {
      "id": "V-25011",
      "title": "Password/passcode maximum failed attempts must be set to required value.",
      "description": "A hacker with unlimited attempts can determine the password of a smartphone within a few minutes using password hacking tools, which could lead to unauthorized access to the smartphone and exposure to sensitive DoD data.",
      "severity": "medium"
    },
    {
      "id": "V-25012",
      "title": "Access to public application stores must be disabled.",
      "description": "Strong configuration management of all applications installed on DoD device is required to ensure the security baseline of the system is maintained.  Otherwise, sensitive DoD data could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-25013",
      "title": "Users must not be allowed to download applications on smartphones without SA control.",
      "description": "Strong configuration management of all applications installed on DoD device is required to ensure the security baseline of the system is maintained.  Otherwise, sensitive DoD data could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-25014",
      "title": "Use of the smartphone camera must be approved and documented in site physical security policy.",
      "description": "This is an operational security issue.   Sensitive DoD data could be compromised if cameras are allowed in areas not authorized by the site physical security plan.",
      "severity": "low"
    },
    {
      "id": "V-25016",
      "title": "Device minimum password/passcode length must be set. ",
      "description": "Sensitive DoD data could be compromised if a device unlock password/passcode is not set to required length on a DoD smartphones.  ",
      "severity": "medium"
    },
    {
      "id": "V-25017",
      "title": "The smartphone Auto-Lock must be set.",
      "description": "Sensitive DoD data could be compromised if the smartphone does not automatically lock after a set period of inactivity.",
      "severity": "medium"
    },
    {
      "id": "V-25018",
      "title": "The smartphone passcode history setting must be set.",
      "description": "The password/passcode would be more susceptible to compromise if the user can select frequently used passwords/passcodes.",
      "severity": "low"
    },
    {
      "id": "V-25019",
      "title": "The smartphone Bluetooth radio must be disabled if not authorized for use.",
      "description": "The Bluetooth radio can be used by a hacker to connect to the smartphone without the knowledge of the user. Sensitive DoD data could be exposed and the hacker could use the device to attack the enclave.",
      "severity": "medium"
    },
    {
      "id": "V-25020",
      "title": "The smartphone device Wi-Fi radio must be disabled as the default setting and is enabled only when Wi-Fi connectivity is required. \n",
      "description": "The Wi-Fi radio can be used by a hacker to connect to the smartphone without the knowledge of the user. Sensitive DoD data could be exposed and the hacker could use the device to attack the enclave.",
      "severity": "low"
    },
    {
      "id": "V-25022",
      "title": "All smartphones must display the required banner during device unlock/ logon.  ",
      "description": "DoD CIO memo requires all PDAs, BlackBerrys, and smartphones to have a consent banner displayed during logon/device unlock to ensure users understand their responsibilities to safeguard DoD data. ",
      "severity": "medium"
    },
    {
      "id": "V-25051",
      "title": "Location services must be turned off on the smartphone during device provisioning.",
      "description": "Smartphone location services allow applications to gather information about the location of the handheld device and possibly forward it to servers located on the Internet. This is an operational security issue for DoD smartphones devices.",
      "severity": "low"
    },
    {
      "id": "V-25842",
      "title": "The site must set up local operating procedures for initial provisioning and subsequent software and application updates using the  procedures published in the STIG Overview document. ",
      "description": "Strong configuration management of applications on a smartphone is a key malware control. Most smartphones must have individual commercial web portal (e.g., iTunes, Android Market, etc.) accounts and be connected to the commercial App Store to provision the smartphone. A DoD user can jailbreak a smartphone and bypass smartphone application and malware controls. To ensure strong configuration management of the security baseline of the smartphone, all software loading should be done by the SA.",
      "severity": "medium"
    },
    {
      "id": "V-26559",
      "title": "The Personal Hotspot feature of the mobile OS must be disabled if it does not meet DoD WLAN or Bluetooth security requirements and is not approved by the IAO. ",
      "description": "The Wi-Fi radio and Bluetooth radio can be used by a hacker to connect to the smartphone without the knowledge of the user. Sensitive DoD data could be exposed and the hacker could use the device to attack the enclave. This setting would allow the device Wi-Fi radio to automatically connect to a Wi-Fi network.  The Bluetooth and Wi-Fi connections do not support DoD wireless encryption and authentication requirements.",
      "severity": "low"
    },
    {
      "id": "V-27629",
      "title": "Full Device Administration must be implemented on the smartphone.",
      "description": "If this configuration is not set as required, the security policy from the server will not be implemented on the smartphone.  Sensitive DoD data could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-27630",
      "title": "Enable Full Device Lock must be set.",
      "description": "Sensitive DoD data could be exposed if this configuration is not set as required.",
      "severity": "medium"
    },
    {
      "id": "V-27631",
      "title": "Enable remote device password reset must be set.",
      "description": "Without this capability a user could be locked out of their smartphone for significant time periods, affecting the mission of the organization.",
      "severity": "low"
    },
    {
      "id": "V-27632",
      "title": "Enable remote SD card wipe must be configured.",
      "description": "Sensitive DoD data could be compromised if mobile OS device data could not be wiped when directed by the system administrator.",
      "severity": "medium"
    },
    {
      "id": "V-27633",
      "title": "Allow SD card encryption must be configured.",
      "description": "Sensitive DoD data could be compromised if a mobile OS device data is not encrypted.",
      "severity": "medium"
    },
    {
      "id": "V-27634",
      "title": "VPN must be configured as required.",
      "description": "Sensitive DoD data could be compromised if the Android VPN client is used.  The VPN client is not currently FIPS 140-2 validated and does not support CAC authentication. ",
      "severity": "medium"
    },
    {
      "id": "V-27635",
      "title": "Remote full device wipe must be enabled.",
      "description": "Sensitive DoD data could be compromised if mobile OS device data could not be wiped when directed by the system administrator.",
      "severity": "medium"
    },
    {
      "id": "V-28295",
      "title": "The smartphone removable memory card (e.g., MicroSD) must be bound to the PDA or smartphone so it may not be read by any other PED or computer. ",
      "description": "Memory cards used to transfer files between PCs and PDAs is a migration path for the spread of malware on DoD computers and handheld devices. These risks are mitigated by the requirements listed in this check.",
      "severity": "medium"
    },
    {
      "id": "V-28297",
      "title": "The smartphone password/passcode complexity (alphanumeric) must be set.",
      "description": "Sensitive DoD data could be compromised if a strong device unlock password/passcode is not set up on a DoD smartphone.  The complexity of the password is a key factor in the strength of the password.  Complex passwords are harder to guess or obtain via a brute force attack.",
      "severity": "medium"
    },
    {
      "id": "V-29524",
      "title": "All mobile operating system (OS) device Bluetooth radio profiles must be disabled except for the serial port, handset and headset profiles.",
      "description": "The Bluetooth radio can be used by a hacker to connect to the smartphone without the knowledge of the user. Sensitive DoD data could be exposed and the hacker could use the device to attack the enclave.  The serial port profile is used by the DoD approved Bluetooth smart card reader and the headset and handset profiles are used by the DoD approved Bluetooth headset.",
      "severity": "medium"
    },
    {
      "id": "V-29525",
      "title": "The pairing of Bluetooth devices to DoD mobile OS devices must be controlled so only approved devices can pair to the smartphone.  ",
      "description": "The Bluetooth radio can be used by a hacker to connect to the smartphone without the knowledge of the user. Sensitive DoD data could be exposed and the hacker could use the device to attack the enclave.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-29529",
      "title": "The smartphone USB port must be configured as required.",
      "description": "A smartphone can be jailbroken or rooted when connected to a PC with a jailbreak or rooting application installed on it.  When a smartphone is jailbroken/rooted, the user or malware has root access and can bypass all device security controls.  DoD sensitive data could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-29894",
      "title": "A security risk analysis must be performed on a mobile operating (OS) system application by the DAA or DAA authorized approval authority prior to the application being approved for use.",
      "description": "Non-approved applications can contain malware. Approved applications should be reviewed and tested by the approving authority to ensure they do not contain malware, spyware, or have unexpected features (e.g., send private information to a web site, track user actions, connect to a non-DoD management server).",
      "severity": "high"
    },
    {
      "id": "V-29949",
      "title": "A compliance rule must be set up in the server defining required mobile OS software build version.",
      "description": "Unapproved OS build versions do not support required security features. The security baseline of the Android system could be compromised if required security features are not available.",
      "severity": "medium"
    },
    {
      "id": "V-30193",
      "title": "The Bluetooth configuration application must be installed on the Android device.",
      "description": "The Bluetooth monitor application ensures the Bluetooth configuration of the Android device is in compliance with the DoD Bluetooth security standard.  If not installed, it may be possible for a hacker to spoof the Bluetooth pairing process with the Android device, connect to the Android device via a Bluetooth connection, and steal sensitive DoD information.",
      "severity": "medium"
    },
    {
      "id": "V-30248",
      "title": "Mobile OS devices (smartphones/tablets) must have a system integrity validation application installed or have validation scanning, using a PC based tool, completed on the required schedule.",
      "description": "The purpose of this scan is to determine if there has been an unexplained change in the mobile OS file system that may indicate the device has been compromised by malware or by rooting the device.",
      "severity": "medium"
    },
    {
      "id": "V-30249",
      "title": "The results and mitigation actions from Mobile OS device integrity validation tool scans on site managed Mobile OS devices must be maintained by the site for at least 6 months (1 year recommended).",
      "description": "Scan results must be maintained so that auditors can verify mitigation actions have been completed, so that a scan can be compared to a previous scan, and to determine if there is any security vulnerability trends for site managed mobile OS devices.",
      "severity": "medium"
    },
    {
      "id": "V-30250",
      "title": "Mitigation actions identified by Mobile OS device integrity tool scans on site managed Mobile OS devices must be implemented.",
      "description": "If mitigation actions identified by the Mobile OS device integrity tool are not implemented, DoD data and the enclave could be at risk of being compromised.",
      "severity": "medium"
    },
    {
      "id": "V-30566",
      "title": "Mobile OS devices (smartphones / tablets) must have a device integrity validation tool baseline scan on file. ",
      "description": "The purpose of this scan is to determine if there has been an unexplained change in the mobile OS file system indicating the device has been compromised by malware or by rooting the device. A baseline scan provides a known good condition to compare with subsequent scans. A new baseline scan should be completed after the installation or removal of an application.",
      "severity": "medium"
    },
    {
      "id": "V-30567",
      "title": "Mobile OS devices (smartphones/tablets) device integrity validation scan interval must be 6 hours or less.",
      "description": "The purpose of this scan is to determine if there has been an unexplained change in the mobile OS file system that may indicate the device has been compromised by malware or by rooting the device.",
      "severity": "medium"
    },
    {
      "id": "V-30568",
      "title": "Mobile OS device integrity tool scans must be reviewed daily by the system administrator or IAO (or continuously by a server).",
      "description": "If mitigation actions identified by the Mobile OS device integrity tool are not implemented, DoD data and the enclave could be at risk of being compromised.",
      "severity": "medium"
    },
    {
      "id": "V-53957",
      "title": "Android 2.2 Dell mobile operating systems that are no longer supported by the vendor for security updates must not be installed on a system.",
      "description": "Android 2.2 Dell mobile operating systems that are no longer supported by the vendor for security updates are not evaluated or updated for vulnerabilities, leaving them open to potential attack.  Organizations must transition to a supported mobile operating system to ensure continued support.",
      "severity": "high"
    }
  ]
}