{
  "name": "blackberry_playbook_os_nea_mode",
  "date": "2014-08-25",
  "description": "This document describes required technical IA controls for the Playbook when used in the Non-Enterprise Activated (NEA mode).  NEA mode is when the device is not connected to the DoD network and does not process sensitive DoD data or email.",
  "title": "BlackBerry Playbook OS (NEA mode) Security Technical Implementation Guide (STIG)",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-24986",
      "title": "All non-core applications on mobile devices must be approved by the DAA or Command IT Configuration Control Board.  ",
      "description": "Non-approved applications can contain malware. Approved applications should be reviewed and tested by the approving authority to ensure they do not contain malware, spyware, or have unexpected features (e.g., send private information to a web site, track user actions, connect to a non-DoD management server). The DAA or Command IT Configuration Control Board (CCB) is responsible for setting up procedures to review, test, and approve smartphone applications. It is expected the process will be similar to what is used to approve and manage applications on command PCs.",
      "severity": "low"
    },
    {
      "id": "V-25007",
      "title": "Smartphones must be configured to require a password/passcode for device unlock.",
      "description": "Sensitive DoD data could be compromised if a device unlock password/passcode is not set up on DoD smartphones.",
      "severity": "low"
    },
    {
      "id": "V-25010",
      "title": " The smartphone inactivity timeout must be set.",
      "description": "Sensitive DoD data could be compromised if the smartphone does not automatically lock after the required period of inactivity.",
      "severity": "low"
    },
    {
      "id": "V-25016",
      "title": "The device minimum password/passcode length must be set. ",
      "description": "Sensitive DoD data could be compromised if a device unlock password/passcode is not set to required length on DoD smartphones.  ",
      "severity": "low"
    },
    {
      "id": "V-30412",
      "title": "The installation of user owned applications on the mobile device must be based on the Command’s Mobile Device Personal Use Policy.",
      "description": "The risk of installing personally owned or freeware apps on a DoD mobile device should be evaluated by the DAA against mission need and how the device is intended to be used.  There is a risk that personally owned or freeware apps could introduce malware on the device, which could impact the performance of the device and corrupt non-sensitive data stored on the device.",
      "severity": "low"
    },
    {
      "id": "V-30417",
      "title": "The use of the mobile device to view and/or download personal email must be based on the Command’s Mobile Device Personal Use Policy.",
      "description": "The risk of viewing and downloading personal email on a non-DoD-network connected mobile device that does not contain sensitive or classified DoD data/information should be evaluated by the DAA against mission need and how the device is intended to be used.  There is a risk that personal email could introduce malware on the device, which could impact the performance of the device and corrupt non-sensitive data stored on the device.",
      "severity": "low"
    },
    {
      "id": "V-30418",
      "title": "Download of user owned data (music files, picture files, etc.) on mobile devices must be based on the Command’s Mobile Device Personal Use Policy.",
      "description": "The risk of installing user owned data (music files, picture files, etc.) on a non-DoD-network connected mobile device that does not contain sensitive or classified DoD data/information should be evaluated by the DAA against mission need and how the device is intended to be used.  There is a risk that user owned data (music files, picture files, etc.) could introduce malware on the device, which could impact the performance of the device and corrupt non-sensitive data stored on the device.",
      "severity": "low"
    },
    {
      "id": "V-30419",
      "title": "Connecting mobile devices to user social media web accounts (Facebook, Twitter, etc.) must be based on the Command’s Mobile Device Personal Use Policy.",
      "description": "The risk of connecting to user social media web accounts on a non-DoD-network connected mobile device that does not contain sensitive or classified DoD data/information should be evaluated by the DAA against mission need and how the device is intended to be used.  There is a risk that connecting to user social media web accounts could introduce malware on the device, which could impact the performance of the device and corrupt non-sensitive data stored on the device.",
      "severity": "low"
    },
    {
      "id": "V-53891",
      "title": "BlackBerry PlayBook OS versions no longer supported by the manufacturer or vendor must not be installed on a device.",
      "description": "Unsupported versions of the operating system do not contain new security-related features and security patches that address known vulnerabilities. Software or hardware no longer supported by the manufacturer or vendor are not maintained or updated for current vulnerabilities leaving them open to potential attack.",
      "severity": "high"
    }
  ]
}