{
  "name": "blackberry_enterprise_server,_part_3",
  "date": "2012-10-01",
  "description": "BlackBerry Enterprise Server STIG, Part 3 in XCCDF format.\nPart 1:  BES architecture and training requirements.\nPart 2:  BES configuration requirements.\nPart 3:  BES IT Policy configuration requirements.\n",
  "title": "BlackBerry Enterprise Server, Part 3 Security Technical Implementation Guide",
  "version": "2",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-11876",
      "title": "IT Policy rule “Maximum Security Timeout” (Device-Only policy group) must be set as required.",
      "description": "Handheld may not lock after the specified period of inactivity and DoD data could be exposed.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-12164",
      "title": "Data-at-Rest encryption (Content Protection) must be enabled on BlackBerry devices. IT Policy rule “Content Protection Strength” (Security policy group) must be set as required.\n",
      "description": "DoD 8500 policy requires data-at-rest protection be enabled on all IT devices containing sensitive data in case the device is lost or stolen.  This protection normally involves password or pin protected access.",
      "severity": "medium"
    },
    {
      "id": "V-14198",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Bluetooth” (Bluetooth policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user.  DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-14478",
      "title": "Wireless email device users must not install or remove applications and/or software on their handheld device unless under the direction and supervision of an authorized system administrator.  IT Policy rule “Show Application Loader” (Desktop-Only policy group) must be is set as required. ",
      "description": "The wireless email server can be configured to prevent users from installing or removing applications.  These configuration settings must be set at the enterprise level to prevent users from downloading, using desktop software, unauthorized software, or harmful code.",
      "severity": "medium"
    },
    {
      "id": "V-16058",
      "title": "IT Policy rule Disable Wi-Fi must be set as required. ",
      "description": "Improperly configured WLAN systems can expose the BlackBerry device and DoD network to attack.",
      "severity": "low"
    },
    {
      "id": "V-19234",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. Either CAC or Password authentication is required. IT Policy rule “Minimum Password Length” (Device Only policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "high"
    },
    {
      "id": "V-19235",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “User Can Disable Passwords” (Device Only policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "high"
    },
    {
      "id": "V-19236",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Maximum Password Age” (Device Only policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "low"
    },
    {
      "id": "V-19238",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Set Password Timeout” (Password policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "medium"
    },
    {
      "id": "V-19239",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Set Maximum Password Attempts” (Password policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "high"
    },
    {
      "id": "V-19240",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Suppress Password Echo” (Password policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "low"
    },
    {
      "id": "V-19241",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Maximum Password History” (Password policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "low"
    },
    {
      "id": "V-19242",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule “Forbidden Passwords” (Password policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "low"
    },
    {
      "id": "V-19243",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. IT Policy rule Reset to Factory Defaults on Wipe (Security policy group) must be set as required. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to\nDoD data by unauthorized individuals.\n",
      "severity": "high"
    },
    {
      "id": "V-19244",
      "title": "All PDAs and smartphones must display the required banner during device unlock/logon. The IT Policy rule “Lock Owner Info” must be set as required.",
      "description": "DoD CIO memo requires all PDAs, BlackBerrys, and smartphones to have a consent banner\ndisplayed during logon/device unlock to ensure user understands their responsibilities to safeguard DoD data.\n",
      "severity": "medium"
    },
    {
      "id": "V-19245",
      "title": "All PDAs and smartphones must display the required banner during device unlock/ logon. The IT Policy rule “Set Owner Info” must be set as required.",
      "description": "DoD CIO memo requires all PDAs, BlackBerrys, and smartphones to have a consent banner\ndisplayed during logon/device unlock to ensure users understand their responsibilities to safeguard DoD data.\n",
      "severity": "medium"
    },
    {
      "id": "V-19257",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Pairing” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-19258",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Headset Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-19259",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Handsfree Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19260",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Serial Port Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-19261",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Discoverable Mode” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19263",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Address Book Transfer” (Bluetooth Only policy group) will be set as required. \n",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user.  DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19264",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Desktop Connectivity” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19265",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Wireless Bypass” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user.  DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19266",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Require Password for Enabling Bluetooth Support” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user.  DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19267",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Require Password for Discoverable Mode” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19268",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Require Encryption” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19269",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable File Transfer” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19270",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Require LED Connection Indicator” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19271",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Dial-Up Networking” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-19272",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Force CHAP Authentication Bluetooth Link” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19273",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Advanced Audio Distribution Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19274",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Audio/Video Remote Control Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19276",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Limit Discoverable Time” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19278",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable SIM Access Profile” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19282",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other message required by DoD policy. IT Policy rule “Disable Revoked Certificate Use” (Security policy group) must be set as required. \n\n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19283",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Disable Key Store Low Security” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19284",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Certificate Status Cache Timeout” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19285",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Disable Invalid Certificate Use” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.",
      "severity": "low"
    },
    {
      "id": "V-19286",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Disable Weak Certificate Use” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19287",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Certificate Status Maximum Expiry Time” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.",
      "severity": "low"
    },
    {
      "id": "V-19288",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Disable Unverified CRLs” (Security policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19289",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Minimum Strong RSA Key Length” (S/MIME Application policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19290",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Minimum Strong DH Key Length” (S/MIME Application policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19291",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Minimum Strong ECC Key Length” (S/MIME Application policy group) must be to “163”.",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19292",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Allowed Content Ciphers” (S/MIME Application policy group) must be set as required.",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19293",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Minimum Strong DSA Key Length” (S/MIME Application policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19294",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “Entrust Messaging Server (EMS) Email Address” (S/MIME Application policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19295",
      "title": "Site BlackBerry devices must be provisioned so users can digitally sign and encrypt e-mail notifications or any other email required by DoD policy. IT Policy rule “S/MIME Allowed Encryption Types” (S/MIME Application policy group) must be set as required. \n",
      "description": "S/MIME provides the capability for users to send and receive S/MIME email messages from wireless email devices. S/MIME and digital signatures provide assurance the message is authentic and is required by DoD policy.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19304",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public Yahoo! Messenger Services” (Service Exclusivity policy group) must be set as required. ",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "low"
    },
    {
      "id": "V-19305",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public AIM Services” (Service Exclusivity policy group) must be set as required. ",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "low"
    },
    {
      "id": "V-19306",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public ICQ Services” (Service Exclusivity policy group) must be set as required. ",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "medium"
    },
    {
      "id": "V-19307",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public IM Services” (Service Exclusivity policy group) must be set as required. ",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "medium"
    },
    {
      "id": "V-19308",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public Google Talk Services” (Service Exclusivity policy group) must be set as required. ",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "low"
    },
    {
      "id": "V-19309",
      "title": "Security requirements for Instant Messaging (IM) must be followed. IT Policy rule “Allow Public WLM Services” (Service Exclusivity policy group) must be set as required. \n",
      "description": "Non-DoD instant messaging servers can be located anywhere in the world and can expose the DoD BlackBerry system and enclave to malware and attack. ",
      "severity": "low"
    },
    {
      "id": "V-19315",
      "title": "IT Policy rule “Maximum Bluetooth Range (BlackBerry Smart Card Reader policy group) must be set as required.",
      "description": "Insecure Bluetooth SCR could make the BlackBerry vulnerable to compromise via a Bluetooth attack.",
      "severity": "low"
    },
    {
      "id": "V-19317",
      "title": "IT Policy rule “Maximum PC Disconnect Timeout (BlackBerry Smart Card Reader policy group) must be set as required.",
      "description": "Insecure Bluetooth configuration on the PC could make it vulnerable to compromise via a Bluetooth attack.",
      "severity": "low"
    },
    {
      "id": "V-19318",
      "title": "IT Policy rule “Maximum Number of PC Pairings (BlackBerry Smart Card Reader policy group) must be set as required.",
      "description": "Insecure Bluetooth configuration on the PC could make it vulnerable to compromise via a Bluetooth attack.",
      "severity": "medium"
    },
    {
      "id": "V-19337",
      "title": "All Internet browsers must be disabled and removed from the BlackBerry\ndevice except for the BlackBerry internet browser.   IT Policy rule “Allow IBS Browser” (Browser policy group) is set as required.\n",
      "description": "The BlackBerry Browser forces all Internet browsing to go through the site Internet gateway, which provides additional security over the carrier's browser.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19339",
      "title": "All Internet browsers must be disabled and removed from the BlackBerry\ndevice except for the BlackBerry internet browser.  IT Policy rule “Allow Hotspot Browser” (Browser policy group) is set as required.\n",
      "description": "The BlackBerry Browser forces all Internet browsing to go through the site Internet gateway, which provides additional security over the carrier's browser.",
      "severity": "low"
    },
    {
      "id": "V-19343",
      "title": "All Internet browsers must be disabled from the BlackBerry device except for the BlackBerry Internet browser.   IT Policy rule “Allow Other Browser Services” (Services Exclusivity policy group) is set as required.\n\n",
      "description": "Requiring the use of the BlackBerry browser forces all Internet browsing to go through the enclave web proxy.  Therefore, all Internet use will be filtered and protected by enclave malware protection services.  Otherwise, BlackBerry Internet browsing would make the BlackBerry handheld and the enclave more vulnerable to malware that could be downloaded from the Internet.",
      "severity": "low"
    },
    {
      "id": "V-19718",
      "title": "IT Policy rule “Force Load Count” (Desktop-Only policy group) must be set as required. \n",
      "description": "Required software update may not be installed, resulting in un-patched system.",
      "severity": "low"
    },
    {
      "id": "V-19719",
      "title": "IT Policy rule “Force Load Message” (Desktop-Only policy group) must be set as required.",
      "description": "Required software update may not be installed, resulting in un-patched system.",
      "severity": "low"
    },
    {
      "id": "V-19721",
      "title": "IT Policy rule “Set Owner Name” (Common policy group) must be set as required.",
      "description": "If not set correctly, BlackBerry may be identified as a DoD BlackBerry when found after being lost or stolen.  This is an operational security issue.",
      "severity": "low"
    },
    {
      "id": "V-19723",
      "title": "IT Policy rule “Keystore Password Maximum Timeout” (Security policy group) must be set as required.",
      "description": "Encryption keys and certificates stored in the keystore may be exposed to compromise if the keystore is not locked after a set period of inactivity.",
      "severity": "low"
    },
    {
      "id": "V-19724",
      "title": "IT Policy rule “Allow Split-Pipe connections” (Security policy group) must be set as required. \t\n",
      "description": "BlackBerry  could be at risk if an application is able to open an internal and external connection on the BlackBerry at the same time.  The BlackBerry could be exposed to Malware.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19726",
      "title": "IT Policy rule “Minimal Signing Key Store Security Level” (Security policy group) must be set as required. \t\n",
      "description": "If not set correctly, the keystore, when encryption keys and digital certificates are stored, may not be encrypted with a strong encryption key.",
      "severity": "low"
    },
    {
      "id": "V-19727",
      "title": "IT Policy rule “Minimal Encryption Key Store Security Level” (Security policy group) must be set as required. \n",
      "description": "If not set correctly, the keystore, when encryption keys and digital certificates are stored, may not be encrypted with a strong encryption key.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19728",
      "title": "IT Policy rule “Force Content Protection of Master Keys” (Security policy group) must be set as required. \n",
      "description": "Master keys (used for data encryption) will be stored on the BlackBerry in un-encrypted form and could be compromised. \n\n",
      "severity": "medium"
    },
    {
      "id": "V-19729",
      "title": "IT Policy rule “Force LED Blinking When Microphone Is On” (Security policy group) must be set as required. \n",
      "description": "User not aware that sensitive conversations are being recorded and/or transmitted.",
      "severity": "low"
    },
    {
      "id": "V-19731",
      "title": "IT Policy rule “Password Required for Application Download” (Security policy group) must be set as required. \n",
      "description": "Malware or unauthorized applications could be downloaded inadvertently by user if control not set.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19733",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Public Photo Sharing Applications” (Security group policy) must be set as required.",
      "description": "Public photo sharing web sites are known to be malware infested.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19734",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Security Transcoder Cod File Hashes” (Security policy group) must be set as required. \n",
      "description": "Third party applications can act as transcoders and use the transcoder API and can impact the security posture of the BlackBerry.  A transcoder is used to translate specific types of content into a format for transmission to a BlackBerry and can cause changes to normally secure connections between the BlackBerry and web sites.  See http://blog.masabi.com/2009/01/how-do-transcoders-affect-https.html for more details.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19735",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Public Social Networking Applications” (Security policy group) must be set as required. \n",
      "description": "Public Social Networking Applications and sites are known to be infested with malware.",
      "severity": "low"
    },
    {
      "id": "V-19736",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “TLS Restrict FIPS Ciphers” (TLS policy group) must be set as required. \n",
      "description": "Only DoD FIPS encryption ciphers (e.g., AES) are authorized.  Otherwise, the encrypted data in web connections may be susceptible to being analyzed by a hacker. \n\n",
      "severity": "low"
    },
    {
      "id": "V-19737",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “WTLS Restrict FIPS Ciphers” (WTLS policy group) must be set as required. \n",
      "description": "Only DoD FIPS encryption ciphers (e.g., AES) are authorized.  Otherwise the encrypted data in web connections may be susceptible being analyzed by a hacker. ",
      "severity": "low"
    },
    {
      "id": "V-19738",
      "title": "BES IT Policy rule must be configured as required. IT Policy rule “Allow Application Download Services” (Browser policy group) must be set as required. ",
      "description": "Disables and removes icons placed on the BlackBerry by carriers (e.g., Verizon Wireless, AT&T, etc.) that are used to connect to carriers’ web sites where applications are sold.  Unapproved applications can cause security issues to the DoD BlackBerry system.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19739",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Verify BlackBerry MDS Integration Service Certificate” (BlackBerry MDS Integration Service policy group) must be set as required.",
      "description": "Un-authenticated connection will be made between the BlackBerry and the BES MDS Integration Service, which could degrade security in the enclave.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19740",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Activation With Public BlackBerry MDS Integration Service” (BlackBerry MDS Integration Service policy group) must be set as required. \n",
      "description": "User can connect to public BlackBerry MDS Integration Services to access public content, web, and application servers.  These servers are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "medium"
    },
    {
      "id": "V-19745",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Application Center” (Application Center policy group) must be set as required. \n",
      "description": "Application Center is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry.  Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19746",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Carrier Directory” (Application Center policy group) must be set as required. ",
      "description": "Disables the carrier’s application center directory on a BlackBerry device.  Application Center is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry.  Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19747",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Desktop Allow Device Switch” (Desktop policy group) must be set as required.",
      "description": "Stops a user from changing BlackBerry devices without the approval of the BlackBerry Administrator.  BlackBerry security software (S/MIME, etc.)  may not be installed correctly and other required provisioning steps may not be completed.  BlackBerry device and system could be vulnerable to attack by hackers or malware.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-19753",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disallow File Transfer Types” (Instant Messaging policy group) must be set as required. \n",
      "description": "Insecure file types are transferred to BlackBerry via IM, increasing the risk of malware being downloaded on the BlackBerry and being transferred to the DoD enclave.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19754",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable BlackBerry Unite! Applications” (BlackBerry Unite! policy group) must be set as required. \n",
      "description": "BlackBerry Unite! is a public data sharing service where groups of BlackBerry users can share photos, calendar information, and other data.  This service allows other users to see sensitive DoD data stored on a DoD BlackBerry.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19755",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable Download Manager” (BlackBerry Unite! policy group) must be set as required. \n",
      "description": "BlackBerry Unite! is a public data sharing service where groups of BlackBerry users can share photos, calendar information, and other data.  This service allows other users to see sensitive DoD data stored on a DoD BlackBerry.\n\n",
      "severity": "low"
    },
    {
      "id": "V-19767",
      "title": "BlackBerrys with removable memory cards (e.g., MicroSD) must be compliant with requirements. IT Policy rule \"External File System Encryption Level\" (Security policy group) must be set as required. ",
      "description": "Malware could be downloaded from the memory card to the PC if not compliant. ",
      "severity": "medium"
    },
    {
      "id": "V-19775",
      "title": "BES IT Policy rule must be configured as required.  IT Policy rule “Disable User Initiated Activation With Public BlackBerry MDS Integration Service” (BlackBerry MDS Integration Service policy group) must be set as required.",
      "description": "Users can connect to public BlackBerry MDS Integration Services to access public content, web,\nand application servers. These servers are not DoD approved and may contain malware that\ncould be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "medium"
    },
    {
      "id": "V-22047",
      "title": "IT Policy rule “Allow BlackBerry Desktop Software Statistics” (Desktop policy group) must be set as required.",
      "description": "This rule could allow software statistics on DoD BlackBerry devices to be automatically sent to the BlackBerry vendor, Research In Motion, which may expose OPSEC information.",
      "severity": "low"
    },
    {
      "id": "V-22048",
      "title": "IT Policy rule “Allow Discovery by User” (MDS Integration Service policy group) must be set as required.",
      "description": "This rule allows a user to search for and install BlackBerry MDS Runtime Applications on a BlackBerry device.  This could lead to the installation of unapproved applications and possible malware.",
      "severity": "medium"
    },
    {
      "id": "V-22049",
      "title": "IT Policy rule “Disable BlackBerry App World” (Security policy group) must be set as required.",
      "description": "This rule allows the user to download unapproved applications from the BlackBerry application store.  Some of these applications may have the capability to expose DoD sensitive information to unauthorized people or expose the BlackBerry to other attacks.",
      "severity": "medium"
    },
    {
      "id": "V-22050",
      "title": "IT Policy rule “Encryption on On-Board Device Memory Media Files” (Security policy group) must be set as required.\n\n",
      "description": "If a media card is inserted in the BlackBerry® device, this rule specifies whether the media files that are located in the media card are encrypted to the user password and the device-generated key.  If data is not encrypted, sensitive DoD data could be exposed to unauthorized people.",
      "severity": "medium"
    },
    {
      "id": "V-22051",
      "title": "IT Policy rule “Allow T-Mobile Mobile Backup Contact Sync” (Service Exclusivity policy group) must be set as required.",
      "description": "This rule specifies whether T-Mobile® Mobile Backup can run on a BlackBerry® device, which permits a BlackBerry device user to synchronize only the contacts that are included in the user's MyFaves plan with the T-Mobile Mobile Backup.  Use of this service may allow the storage of DoD sensitive data on a T-Mobile server and expose the data to non-DoD personnel. ",
      "severity": "low"
    },
    {
      "id": "V-22052",
      "title": "IT Policy rule “Allow User Feedback” (User Feedback policy group) must be set as required.",
      "description": "This rule specifies whether a user can provide feedback to Research In Motion via a system message.  This capability may provide RIM OPSEC information about a DoD BlackBerry system or device.",
      "severity": "low"
    },
    {
      "id": "V-22053",
      "title": "IT Policy rule “Disable organizer data access for social networking applications” (RIM Value-Added Applications policy group) must be set as required.",
      "description": "This rule specifies whether a BlackBerry® device must prevent social networking applications from accessing organizer data.  BlackBerry organizer  (calendar, notes, and contacts) may contain sensitive DoD information that could be exposed to the public if social networking applications had access to it.",
      "severity": "low"
    },
    {
      "id": "V-25873",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Disable Message Access Profile” (Bluetooth policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "low"
    },
    {
      "id": "V-25874",
      "title": "BES IT Policy rule must be configured as required. IT Policy rule “Disable App World” (BlackBerry App World policy group) must be set as required. ",
      "description": "BlackBerry App World is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry. Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "medium"
    },
    {
      "id": "V-25875",
      "title": "BES IT Policy rule is configured as required. IT Policy rule “Application Restriction Rule” (BlackBerry App World policy group) will be set as required. ",
      "description": "BlackBerry App World is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry. Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "low"
    },
    {
      "id": "V-25876",
      "title": "BES IT Policy rule must be configured as required. IT Policy rule “Category Restriction Rule” (BlackBerry App World policy group) must be set as required. ",
      "description": "BlackBerry App World is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry. Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.\n\n",
      "severity": "low"
    },
    {
      "id": "V-25877",
      "title": "BES IT Policy rule must be configured as required. IT Policy rule “Disable Application Purchasing” (BlackBerry App World policy group) must be set as required. ",
      "description": "BlackBerry App World is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry. Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "low"
    },
    {
      "id": "V-25878",
      "title": "BES IT Policy rule must be configured as required. IT Policy rule “Content Protection Usage” (Security policy group) must be set as required.",
      "description": "DoD 8500 policy requires data-at-rest protection be enabled on all IT devices containing sensitive data in case the device is lost or stolen. This protection normally involves password or pin protected access.",
      "severity": "medium"
    },
    {
      "id": "V-25879",
      "title": "BES IT Policy rule is configured as required. IT Policy rule “Disable Browsing Of Remote Shared Folders” (Security policy group) must be set as required.",
      "description": "When not configured properly, users can access data on the DoD network in shared folders without required CAC authentication to the network.  ",
      "severity": "medium"
    },
    {
      "id": "V-25880",
      "title": "BES IT Policy rule is configured as required. IT Policy rule “Disable Browsing Of Remote Shared Folders” (Security policy group) must be  set as required.",
      "description": "If not configured as specified, a user could download a non-DoD approved software update or application, which could adversely impact the security baseline of the BlackBerry system. ",
      "severity": "low"
    },
    {
      "id": "V-26507",
      "title": "BES Bluetooth controls must be compliant with requirements. IT Policy rule “Minimum Encryption Key Length” (Bluetooth Only policy group) must be set as required.",
      "description": "Bluetooth usage could provide an attack vector for a hacker to connect to a BlackBerry device without the knowledge of the user. DoD data would then be vulnerable.",
      "severity": "medium"
    },
    {
      "id": "V-30295",
      "title": "BES IT Policy rule is configured as required. IT Policy rule “Application Restriction List” (BlackBerry App World policy group) must be set as required. ",
      "description": "BlackBerry App World is the public BlackBerry application store where BlackBerry applications can be purchased and then downloaded on the BlackBerry. Most applications are not DoD approved and may contain malware that could be downloaded on a BlackBerry and transferred to the DoD enclave.",
      "severity": "medium"
    },
    {
      "id": "V-30767",
      "title": "BES IT Policy rule is configured as required. IT Policy rule “BlackBerry Playbook Log Submission” (Companion Devices policy group) must be set as required. ",
      "description": "Sensitive DoD information could be exposed if Playbook log information was sent to RIM.",
      "severity": "medium"
    },
    {
      "id": "V-3545",
      "title": "BlackBerry devices must be protected by authenticated login procedures to unlock the device. Either CAC or Password authentication is required. IT Policy rule “Password Required” (Device Only policy group) must be set to “Yes” or “True”. ",
      "description": "Authenticated device unlock is a key security control for the BlackBerry system to restrict access to DoD data by unauthorized individuals.",
      "severity": "high"
    }
  ]
}