{
  "name": "exchange_2010_mailbox_server",
  "date": "2017-07-05",
  "description": "The Microsoft Exchange Server 2010 STIGs cover four of the five roles available with Microsoft Exchange Server 2010. The Email Services Policy STIG must also be reviewed for each site hosting email services. Also, for the Client Access server, the IIS guidance must be reviewed prior to the OWA checks. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "Exchange 2010 Mailbox Server STIG",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-33573",
      "title": "Public Store storage quota must be limited.",
      "description": "This setting controls the maximum sizes of a Public Folder and the system’s response if these limits are exceeded. There are two available controls and the system response when the quota has been exceeded. \n\nThe first control sends an email warning to Folder Owners roles alerting them that the folder has exceeded its quota.  The second level prevents posting any additional items to the folder.  \n\nAs a practical matter, level 1 serves the purpose of prompting owners to manage their folders.  Level 2 impedes users in their ability to work, and is not required where folder use interruption is not acceptable.   Public Folder Storage Quota Limitations are not a substitute for overall disk space monitoring.",
      "severity": "low"
    },
    {
      "id": "V-33577",
      "title": "The Public Folder Stores must mount at startup.",
      "description": "Administrator responsibilities include the ability to react to unplanned maintenance tasks or emergency situations that may require Public Folder Store data manipulation.  Occasionally, there may be a need to start the server with 'unmounted' data stores,  if manual maintenance is being performed on them.  Failure to uncheck the 'do not mount on startup' condition will result in unavailability of Public Folder services.  \n\nCorrect configuration of this control will prevent unplanned outages due to being enabled.  On occasions when it is needed, care should be taken in process steps to clear the checkbox task completion, so that public folder stores are available to users  (unmounted public folder stores are not available to users).",
      "severity": "low"
    },
    {
      "id": "V-33580",
      "title": "Public Folder stores must be retained until backups are complete.",
      "description": "Backup and recovery procedures are an important part of overall system availability and integrity.   Complete backups reduce the chance of accidental deletion of important information, and make it possible to have complete recoveries.  \n  \nIt is not uncommon for users to receive and delete documents in the scope of a single backup cycle.   This setting ensures at least one backup has been run on the folder store before the message physically disappears.  By enabling this setting, all messages written to recipients who have accounts on this store will reside in backups even if they have been deleted by the user before the backup has run.\n",
      "severity": "medium"
    },
    {
      "id": "V-33582",
      "title": "Public Folder database must not be overwritten by a restore.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.  Unauthorized or accidental restoration of public folder data risks data loss or corruption.  \n\nThis setting controls whether the public folder store can be overwritten by a restore from backup, which will cause loss of all information added after the backup was created.  It should only be enabled during maintenance windows or following an outage (immediately before a restore is to be made), and cleared again immediately afterwards.  \n\nDuring production windows, this feature must be disabled.",
      "severity": "low"
    },
    {
      "id": "V-33591",
      "title": "Mail quota settings must not restrict receiving mail.",
      "description": "Mail quota settings control the maximum sizes of a user’s mailbox and the system’s response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   \n\nFailure to allow mail receipt may impede users from receiving mission critical data. ",
      "severity": "low"
    },
    {
      "id": "V-33593",
      "title": "Mail Store storage quota must limit send.",
      "description": "Mail quota settings control the maximum sizes of a user’s mailbox and the system’s response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   There are multiple controls, which supply graduated levels of opportunity to respond before risking email service loss.  \n\nThis control prohibits the user from sending an email when the mailbox limit reaches the prohibit send quota value.\n\nNote: Best practice for this setting is to prohibit the user from sending email when the mailbox reaches 90 percent of capacity.",
      "severity": "low"
    },
    {
      "id": "V-33595",
      "title": "Mail Store storage quota must issue a warning.",
      "description": "Mail quota settings control the maximum sizes of a user’s mailbox and the system’s response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   There are multiple controls, which supply graduated levels of opportunity to respond before risking data loss.  \n\nThis control sends the user a warning message that the mailbox is reaching its limit. The user at this point can still send and receive email.\n  \nNote: Best practice is to send this warning when the mailbox reaches 75 percent of capacity.",
      "severity": "low"
    },
    {
      "id": "V-33597",
      "title": "The Mailbox Stores must mount at startup.",
      "description": "Administrator responsibilities include the ability to react to unplanned maintenance tasks or emergency situations that may require Mailbox data manipulation.  Occasionally, there may be a need to start the server with 'unmounted' data stores,  if manual maintenance is being performed on them.  Failure to uncheck the 'do not mount on startup' condition will result in unavailability of mail services.  \n\nCorrect configuration of this control will prevent unplanned outages due to being enabled.  On occasions when it is needed, care should be taken in process steps to clear the check box upon task completion, so that mail stores are available to users (unmounted mailbox stores are not available to users).",
      "severity": "low"
    },
    {
      "id": "V-33600",
      "title": "Mailboxes must be retained until backups are complete.",
      "description": "Backup and recovery procedures are an important part of overall system availability and integrity.   Complete backups reduce the chance of accidental deletion of important information, and make it possible to have complete recoveries.  \n  \nIt is not uncommon for users to receive and delete messages in the scope of a single backup cycle.   This setting ensures at least one backup has been run on the mailbox store before the message physically disappears.  By enabling this setting, all messages written to recipients who have accounts on this store will reside in backups even if they have been deleted by the user before the backup has run.",
      "severity": "medium"
    },
    {
      "id": "V-33602",
      "title": "Mailbox database must not be overwritten by a restore.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.    Unauthorized or accidental restoration of mailbox data risks data loss or corruption.   \n\nThis setting controls whether the mailbox store can be overwritten by a backup, which will cause loss of all information added after the backup was created.  It should only be enabled during maintenance windows or following an outage (immediately before a restore is to be made), and cleared again immediately afterwards.  \n\nDuring production windows, this feature must be disabled.",
      "severity": "low"
    },
    {
      "id": "V-33604",
      "title": "Mailbox databases must reside on a dedicated partition.",
      "description": "In the same way that added security layers can provide a cumulative positive effect on security posture, multiple applications can provide a cumulative negative effect. A vulnerability and subsequent exploit to one application can lead to an exploit of other applications sharing the same security context. For example, an exploit to a web server process that leads to unauthorized administrative access to the host system can most likely lead to a compromise of all applications hosted by the same system.\n\nEmail services should be installed to a discrete set of directories, on a partition that does not host other applications.   Email services should never be installed on a Domain Controller / Directory Services server.",
      "severity": "medium"
    },
    {
      "id": "V-33605",
      "title": "Email forwarding must be restricted.",
      "description": "Auto-forwarded email accounts do not meet the requirement for digital signature and encryption of CUI and PII IAW DoDI 8520.2 (reference ee) and DoD Director for Administration and Management memorandum, 'Safeguarding Against and Responding to the Breach of Personally Identifiable Information.’\n\nUse of forwarding set by an administrator interferes with non-repudiation requirements that each end user be responsible for creation and destination of email data.",
      "severity": "medium"
    },
    {
      "id": "V-33606",
      "title": "Email Diagnostic log level must be set to low or lowest level.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability. Diagnostic logging, however, characteristically produces large volumes of data and requires care in managing the logs to prevent risk of disk capacity denial of service conditions. \nExchange diagnostic logging is broken up into 29 main “services”, each of which has anywhere from 2 to 26 “categories” of events to be monitored. Moreover, each category may be set to one of four levels of logging: Lowest, Low, Medium, and High, depending on how much detail one desires. The higher the level of detail, the more disk space required to store the audit material.\nDiagnostic logging is intended to help administrators debug problems with their systems, not as a general purpose auditing tool. Because the diagnostic logs collect a great deal of information, the log files may grow huge very quickly. Diagnostic log levels may be raised for limited periods of time when attempting to debug relevant pieces of Exchange functionality. Once debugging has finished, diagnostic log levels should be reduced again.\n",
      "severity": "medium"
    },
    {
      "id": "V-33608",
      "title": "The Send Fatal Errors to Microsoft must be disabled.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability.   This setting enables an automated log entry to be sent to Microsoft giving general details about the nature and location of the error.   Microsoft, in turn, uses this information to improve the robustness of their product.\n\nWhile this type of debugging information would not ordinarily contain sensitive information, it may alert eavesdroppers to the existence of problems in your Exchange organization. At the very least, it could alert them to (possibly) advantageous timing to mount an attack.  At worst, it may provide them with information as to which aspects of Exchange are causing problems and might be vulnerable (or at least sensitive) to attack.   \n\nAll system errors in Exchange will result in outbound traffic that may be identified by an eavesdropper.  For this reason, the 'Report Fatal Errors to Microsoft' feature must be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-33609",
      "title": "Administrator audit logging must be enabled.",
      "description": " Unauthorized or malicious data changes can compromise the integrity and usefulness of the data.  Automated attacks or malicious users with elevated privileges have the ability to affect change using the same mechanisms as email administrators.  \n\nAuditing changes to access mechanisms not only supports accountability and non-repudiation for those authorized to define the environment but also enables investigation of changes made by others who may not be authorized.   \n\nNote: This administrator auditing feature audits all exchange changes regardless of the users' assigned role or permissions. ",
      "severity": "medium"
    },
    {
      "id": "V-33611",
      "title": "Audit data must be protected against unauthorized access.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability.   Audit log content must always be considered sensitive, and in need of protection.  Audit data available for modification by a malicious user can be altered to conceal malicious activity.  Audit data might also provide a means for the malicious user to plan unauthorized activities that exploit weaknesses.\n  \nThe contents of audit logs are protected against unauthorized access, modification, or deletion. Only authorized auditors and the audit functions should be granted Read and Write access to audit log data.",
      "severity": "medium"
    },
    {
      "id": "V-33612",
      "title": "Circular Logging must be disabled.",
      "description": "Logging provides a history of events performed, and can also provide evidence of tampering or attack. Failure to create and preserve logs adds to the risk that suspicious events may go unnoticed, or the raise the potential that insufficient history will be available to investigate them. \n\nThis setting controls how log files are written. If circular logging is enabled, there is one log file stored with a default size of 1024 KB. Once the size limit has been reached, additional log entries overwrite the oldest log entries. If circular logging is disabled, once a log file reaches the size limit, a new log file is created. \n\nMailbox should not use circular logging. Logs should be written to a partition separate from the operating system, with log protection and backups being incorporated into the overall System Security plan. ",
      "severity": "low"
    },
    {
      "id": "V-33613",
      "title": "Exchange application directory must be protected from unauthorized access.",
      "description": "Default product installations may provide more generous access permissions than are necessary to run the application.  By examining and tailoring access permissions to more closely provide the least amount of privilege possible, attack vectors that align with user permissions are less likely to access more highly secured areas.",
      "severity": "medium"
    },
    {
      "id": "V-33614",
      "title": "Email Subject Line logging must be disabled.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability.  When “message tracking” is enabled, only the sender, recipients, time, and other delivery information are included by default.   Information such as the subject and message body is not included.  \n\nHowever, the absence of the message subject line can make it difficult to locate a specific message in the log unless one knows roughly what time the message was sent.  To simplify searches through these logs, Exchange offers the ability to include the message “subject line” in the log files and in the Message Tracking Center display.  This can make it significantly easier to locate a specific message.  \n\nThis feature creates larger log files and will contain information that may raise privacy and legal concerns - enterprise policy should be consulted before this feature is enabled. Also, since the log files may contain sensitive information in the form of the subject line, the log files will need to be protected, commensurate with the sensitivity level, as the content may be of interest to an attacker.  \n\nFor these reasons, it is recommended that subject logging not be enabled during regular production operations, but instead treat this feature as a diagnostic that can be used if needed. The tradeoff of this is that finding the correct message in the message tracking logs will become more difficult since the administrator will need to search using only the time the message was sent and the message’s sender.  This control will have no effect unless Message Tracking is enabled. That said, the setting should be disabled in case message tracking is perchance enabled at a future time.",
      "severity": "medium"
    },
    {
      "id": "V-33615",
      "title": "Message Tracking Logging must be enabled.",
      "description": "A message tracking log provides a detailed log of all message activity as messages are transferred to and from a computer running Exchange.\n\nIf events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-33616",
      "title": "Exchange must not send Customer Experience reports to Microsoft.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability. This setting enables an automated entry to be sent to Microsoft giving general details about how the product is used.  Microsoft, in turn, uses this information to improve the robustness of their product.\n\nWhile this type of information does not ordinarily contain sensitive information, it may alert eavesdroppers to the existence of the environment and its configurations.  It could alert them to (possibly) advantageous timing or weaknesses toward which to mount an attack. \n",
      "severity": "medium"
    },
    {
      "id": "V-33617",
      "title": "Audit record parameters must be set.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts.   This item declares the fields that must be available in the audit log file in order to adequately research events that are logged. \nAudit records should include the following fields to supply useful event accounting: \nObject modified, Cmdlet name, Cmdlet parameters, Modified parameters, Caller, Succeeded, and Originating server.",
      "severity": "low"
    },
    {
      "id": "V-33618",
      "title": "Audit data must be on separate partitions.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability.   Audit log content must always be considered sensitive, and in need of protection.   \n\nSuccessful exploit of an application server vulnerability may well be logged by monitoring or audit processes when it occurs.  By writing log and audit data to a separate partition where separate security contexts protect them, it may offer the ability to protect this information from being modified or removed by the exploit mechanism.",
      "severity": "medium"
    },
    {
      "id": "V-33619",
      "title": "Queue monitoring must be configured with threshold and action.",
      "description": "Monitors are automated “process watchers” that respond to performance changes, and can be useful in detecting outages and alerting administrators where attention is needed. Exchange has built-in monitors that enable the administrator to generate alerts if thresholds are reached, better enabling them to react in a timely fashion. \n\nThe intent of this check is for system administrators to have awareness of performance changes on their network. \n\nNotification choices include email an alert to an email-enabled account, for example, an email Administrator, or invoke a script to take other action, for example, to add an Event to the Microsoft Application Event Log, where external monitors might detect it.\n\nData elements configured to be monitored should be specific to the organization’s network.\n.",
      "severity": "medium"
    },
    {
      "id": "V-33620",
      "title": "Email software must be monitored for change on INFOCON frequency schedule.",
      "description": "The INFOCON system provides a framework within which the Commander USSTRATCOM regional commanders, service chiefs, base/post/camp/station/vessel commanders, or agency directors can increase the measurable readiness of their networks to match operational priorities. The readiness strategy provides the ability to continuously maintain and sustain one’s own information systems and networks throughout their schedule of deployments, exercises, and operational readiness life cycle independent of network attacks or threats. The system provides a framework of prescribed actions and cycles necessary for reestablishing the confidence level and security of information systems for the commander and thereby supporting the entire Global Information Grid (GIG) (SD 527-1 Purpose).\n\nThe Exchange software files and directories are vulnerable to unauthorized changes if not adequately protected.  An unauthorized change could affect the integrity or availability of email services overall. For this reason, all application software installations must monitor for change against a software baseline that is preserved when installed, and updated periodically as patches or upgrades are installed. Automated and manual schedules for software change monitoring must be compliant with SD527-1 frequencies. \n\nNote: Policy Auditor 5.2 or later, File Integrity Monitor (FIM) module will meet the requirement for file integrity checking. The Asset module within HBSS does not meet this requirement.\n",
      "severity": "medium"
    },
    {
      "id": "V-33621",
      "title": "Exchange software baseline copy must exist.",
      "description": "Exchange software, as with other application software installed on a host system, must be included in a system baseline record and periodically reviewed;  otherwise unauthorized changes to the software may not be discovered. This effort is a vital step to securing the host and the applications, as it is the only method that may provide the ability to detect and recover from otherwise undetected changes, such as those that result from worm or bot intrusions. \n\nThe Exchange software and configuration baseline is created and maintained for comparison during scanning efforts. Operational procedures must include baseline updates as part of configuration management tasks that change the software and configuration. \n",
      "severity": "medium"
    },
    {
      "id": "V-33623",
      "title": "Services must be documented and unnecessary services must be removed or disabled.",
      "description": "Unneeded, but running,  services offer attackers an enhanced attack profile, and attackers are constantly watching to discover open ports with running services.  By analyzing and disabling unneeded services, the associated open ports become unresponsive to outside queries, and servers become more secure as a result.  \n \nExchange Server has role-based server deployment to enable protocol path control and logical separation of network traffic types.   \n\nFor example, a server implemented in the Client Access role (i.e., Outlook Web App [OWA]) is configured and tuned as a web server using web protocols.  A client access server exposes only web protocols (HTTP/HTTPS) enabling system administrators to optimize the protocol path and disable all services unnecessary for Exchange web services.    Similarly, servers created to host mailboxes are dedicated to that task, and must operate only the services needed for mailbox hosting.  (Exchange servers must also operate some Web services, but only to the degree that Exchange requires the IIS engine in order to function).   \n\nBecause POP3, and IMAP4 clients are not included in the standard desktop offering, they must be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-33625",
      "title": "Email application must not share a partition with another application.",
      "description": "In the same way that added security layers can provide a cumulative positive effect on security posture, multiple applications can provide a cumulative negative effect. A vulnerability and subsequent exploit to one application can lead to an exploit of other applications sharing the same security context. For example, an exploit to a web server process that leads to unauthorized administrative access to the host system can most likely lead to a compromise of all applications hosted by the same system.\n\nEmail services should be installed on a partition that does not host other applications. Email services should never be installed on a Domain Controller / Directory Services server. ",
      "severity": "medium"
    },
    {
      "id": "V-33626",
      "title": "Servers must use approved DoD certificates.",
      "description": "Server certificates are required for many security features in Exchange; without them the server cannot engage in many forms of secure communication. \nFailure to implement valid certificates makes it virtually impossible to secure Exchange's communications.",
      "severity": "medium"
    },
    {
      "id": "V-33628",
      "title": "Email servers must have Email aware virus protection. ",
      "description": "With the proliferation of trojans, viruses, and SPAM attaching themselves to email messages (or attachments), it is necessary to have capable email Aware Anti-Virus (AV) products to scan messages and identify any resident malware. Because email messages and their attachments are formatted to the MIME standard, a flat-file AV scanning engine is not suitable for scanning email message stores. \n\nEmail aware Anti-Virus engines must be Exchange 2010 compliant, or use VirusScan Application Program Interface (VSAPI) version 2.6 or higher, which is able to scan email MIME content safely. Competent email scanners will have the ability to scan mail stores, attachments (including zip or other archive files) and mail queues, and to issue warnings or alerts if malware is detected. As with other AV products, a necessary feature to include is the ability for automatic updates.",
      "severity": "high"
    },
    {
      "id": "V-33629",
      "title": "The current, approved service pack must be installed.\n",
      "description": "Failure to install the most current Exchange service pack leaves a system vulnerable to exploitation. Current service packs correct known security and system vulnerabilities. \n",
      "severity": "medium"
    },
    {
      "id": "V-33632",
      "title": "Local machine policy must require signed scripts. ",
      "description": "Scripts often provide a way for attackers to infiltrate a system, especially those downloaded from untrusted locations.   By setting machine policy to prevent unauthorized script executions, unanticipated system impacts can be avoided.  Failure to allow only signed remote scripts reduces the attack vector vulnerabilities from unsigned remote scripts. ",
      "severity": "medium"
    },
    {
      "id": "V-39160",
      "title": "Email forwarding SMTP domains must be restricted.",
      "description": "Auto-forwarded email accounts do not meet the requirement for digital signature and encryption of CUI and PII IAW DoDI 8520.2 (reference ee) and DoD Director for Administration and Management memorandum, 'Safeguarding Against and Responding to the Breach of Personally Identifiable Information.’\n\nUse of forwarding set by an administrator interferes with non-repudiation requirements that each end user be responsible for creation and destination of email data. ",
      "severity": "medium"
    }
  ]
}