{
  "name": "firewall_security_requirements_guide",
  "date": "2014-07-07",
  "description": "Firewall Security Requirements Guide (SRG) is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the NIST 800-53 and related documents. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.letterkenny.FSO.mbx.stig-customer-support-mailbox@mail.mil.",
  "title": "Firewall Security Requirements Guide",
  "version": "2",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "SRG-NET-000015-FW-000015",
      "title": "The firewall implementation must enforce approved authorizations for logical access to information and system resources in accordance with applicable access control policies.",
      "description": "If the firewall implementation is not configured to enforce approved authorizations for logical access to information and system resources in accordance with applicable access control policies, malicious or otherwise unauthorized access can occur.  \n\nA firewall is a network security tool, implemented either as software or in hardware, which controls the flow of incoming and outgoing network traffic by analyzing the data packets and determining whether they should be allowed through or not, based on an applied rule set.  This rule set or Access Control List (ACL) is an ordered list of rules that defines access control policies and allows or denies access to information system resources such as applications, services, or devices.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000017",
      "title": "The firewall implementation must enforce approved authorizations for controlling the flow of information within the network based on organization-defined information flow control policies.",
      "description": "If the firewall implementation is not configured to control the flow of information within the network based on organization-defined information flow control policies, malicious or otherwise unauthorized access can occur.  Controlling the flow of network traffic within a network is as important as controlling the flow of network traffic between networks and is part of the practice of defense-in-depth.\n\nA firewall is a network security tool, implemented either as software or in hardware, which controls the flow of incoming and outgoing network traffic by analyzing the data packets and determining whether they should be allowed through or not, based on an applied rule set.  This rule set or Access Control List (ACL) is an ordered list of rules that defines access control policies and allows or denies access to information system resources such as applications, services, or devices.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000168",
      "title": "The firewall implementation must implement NAT to ensure endpoint internal IPv4 addresses are not visible to external untrusted networks.",
      "description": "An attacker can learn more about a site’s private network once it has discovered the real IP addresses of the hosts within.  Network Address Translation (NAT) works well with the implementation of RFC 1918 addressing scheme; it also has the privacy benefit of hiding real internal addresses.  NAT limits the direct connectivity that is possible between internal network hosts and the outside and makes it more difficult for outside attackers to discover the enclave's internal network.\n\nThis requirement does not apply to SIPRNet and enclaves that are part of/connect to SIPRNet.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000205",
      "title": "The firewall implementation must block any packet with a source or destination of the IPv4 local host loopback address (127.0.0.0/8).",
      "description": "The IPv4 loopback address should never be used as the source or destination IP address of an inbound or outbound transmission.  Packets with a source IP or destination address of the 127.0.0.0/8 prefix are bogus and may be malicious. \n\nThe loopback address is used by an Inter-Processor Control (IPC) mechanism that enables the client and server portion of an application running on the same machine to communicate.  Any packet with a source or destination IP address of 127.0.0.0/8 must not appear outside of an enclave or be routed.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000206",
      "title": "The firewall implementation must protect server VLAN(s) using a deny-by-default security posture.",
      "description": "Without proper access control of traffic entering or leaving the server VLAN, potential threats, such as a denial of service, data corruption, or theft could occur, resulting in the inability to complete mission requirements by authorized users.  Protecting data sitting in a server VLAN is necessary and can be accomplished using access control lists on VLANs provisioned for servers.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000207",
      "title": "The firewall implementation must protect server VLAN(s) by controlling the flow of information originating from one server farm segment destined for another server farm segment.",
      "description": "The intent of this requirement is to protect servers on a VLAN from a server that has been compromised by an intruder.  If the server farm segments are not protected, a compromised server can be used as an attack source within the enclave.     \n\nProtecting a client’s data from other clients is necessary and can be accomplished using VLAN provisioning, layer 3 filtering and content filtering at the server farm entry point. Restricting protocol, source, and destination traffic via filters is an option; however, additional security practices, such as content filtering, are required.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000248",
      "title": "The firewall implementation must block any packet with a source or destination of the IPv6 local host loopback address (::1/128).",
      "description": "The IPv6 unicast address 0:0:0:0:0:0:0:1, also defined as ::1/128, is called the loopback address.  It should never be used as the source or destination IP address of an inbound or outbound transmission.    Packets with a source IP or destination address of ::1/128 are bogus and may be malicious.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000018-FW-000249",
      "title": "The firewall implementation must restrict the acceptance of any IP packets from the unspecified address (::/128).",
      "description": "The address 0:0:0:0:0:0:0:0, also defined ::/128, is called the unspecified address.   It must never be assigned to any node.   It indicates the absence of an address.   \nThe unspecified address must not be used as the destination address of IPv6 packets or in IPv6 Routing Headers.   A router must never forward an IPv6 packet with a source address of unspecified.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000018",
      "title": "The firewall implementation must enforce approved authorizations for controlling the flow of information between interconnected systems based on organization-defined information flow control policies.",
      "description": "Transferring information between information systems representing different security domains with different security policies introduces risk that such transfers violate one or more domain security policies.  Therefore, controlling the flow of network traffic between networks of different security domains employing differing security postures is necessary.  \n\nAn enclave is a computing environment under the control of a single authority with personnel and physical security measures.  The Enclave firewall rules should be based on applications being used within the internal Enclave; all non-required ports and services will be blocked by the most restrictive rules possible, and what is allowed through the firewall will be configured IAW DoD Instruction 8551.1.  Perimeter filtering rules can be applied to any internal firewall device or router and should be implemented to the fullest extent possible.  This is necessary in order to minimize internal threats and protect the enclave.\n\nThe enclave perimeter requirement for filtering will include USCYBERCOM and Ports, Protocols, and Services (PPS) Vulnerability Assessment (VA) filtering guidelines.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000191",
      "title": "The firewall implementation must suppress router advertisements on all external-facing IPv6-enabled interfaces.",
      "description": "IPv6 Neighbor Discovery relies, in part, on Router Advertisement, which can be abused by an attacker to cause either a Denial of Service or to redirect traffic to a rogue IPv6 router.  To mitigate this, links that have no hosts connected, such as the interface connecting to external gateways, will be configured to suppress router advertisements.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000192",
      "title": "The firewall implementation must drop all inbound IPv6 packets for which the layer 4 protocol and ports (undetermined transport) cannot be located.",
      "description": "IPv6 allows an unlimited number of extension headers to be applied to a packet.  Some devices are incapable of traversing the list of extension headers, with the result being that the network device can fail to identify the layer 4 header.  Since the firewall may not be able to locate and identify the layer 4 protocol and port values, it cannot properly filter those packets.  The security policy would be subverted if these packets were allowed to pass.\n\nThe firewall implementation must drop any packet for which it cannot identify the layer 4 protocol and ports.  If the firewall cannot traverse through extension headers at all, it must drop packets using any extension header.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000193",
      "title": "The firewall implementation must drop all inbound IPv6 packets with a Type 0 Routing header.",
      "description": "The IPv6 Type 0 Routing Header (extension header) is functionally equivalent to the IPv4 loose source routing header option, which is typically blocked for security reasons.  The Type 0 Routing Header is dangerous because it allows attackers to spoof source addresses and get traffic in response (rather than to the real owner of the address). Secondly, a packet with an allowed destination address could be sent through a firewall only to bounce to a different (disallowed) node once inside using the Routing Header functionality.  \n\nThe IPv6 Type 0 Routing Header has been deprecated by IETF RFC 5095 and should not be used; there may be existing implementations that still recognize this header.  If the firewall cannot distinguish the Type field of a routing header, it should be configured to drop all routing headers.  Note that at one time Mobile IP used the Type 0 routing header; it has been changed to now use the Type 2 Routing Header.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000194",
      "title": "The firewall implementation must drop all inbound IPv6 packets containing undefined header extensions/protocol values.",
      "description": "Undefined header extensions may cause equipment to behave erratically or even crash.  Various IPv6 extension headers have been standardized since the IPv6 standard was first published, and a process exists in which developers can register new extension headers with the Internet Engineering Task Force (IETF).  The phrase \"undefined IPv6 header extensions\" means that the Next Header type is not registered with IANA.  Since these header extensions are not recognized, intermediate equipment (such as firewalls, proxies, and load balancers) may not process them and even may be adversely affected by trying.  Therefore, the firewall implementation must drop all undefined extension headers/protocol values.\n\nThis requirement generally applies to the design of an information technology product, but it can also apply to the configuration of particular information system components that are, or use, such products. This can be verified by acceptance/validation processes in DoD or other government agencies.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000195",
      "title": "The firewall implementation must drop fragmented IPv6 packets when any fragment overlaps another.",
      "description": "Fragmented packets can be used to \"fool\" a firewall into allowing otherwise prohibited traffic.  A firewall must be able to properly enforce its filtering policy upon fragmented packets.  This requires that the firewall be able to find the complete set of header data, including extension headers and the upper layer protocol/port values. It also requires that the packet not be susceptible to fragment overlap attacks.  Fragment overlaps are a more serious problem in IPv6 than in IPv4 because the presence of extension headers can push the upper layer protocol/port information outward (toward packet boundaries) making it much harder to protect.  \n\nRFC 5722 has expressly forbidden overlapping fragments in IPv6.  When reassembling an IPv6 datagram, if one or more of its constituent fragments is determined to be an overlapping fragment, the entire datagram (and any constituent fragments, including those not yet received) must be silently discarded.  Alternately, the firewall implementation can drop at least one fragment of a fragmented packet; this is a bare minimum action to secure a packet, and is chosen to allow firewall vendors flexibility in achieving it.  Note that this latter option is not complaint with RFC 5722, so it is not the preferred option.\n\nThis requirement generally applies to the design of an information technology product, but it can also apply to the configuration of particular information system components that are, or use, such products. This can be verified by acceptance/validation processes in DoD or other government agencies.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000196",
      "title": "The firewall implementation must drop all inbound IPv6 packets containing more than one Fragmentation Header within an IP header chain.",
      "description": "Nested fragmentation in IPv6 should be dropped by the firewall since internal nodes that process the fragmentation may or may not be equipped to handle this unexpected case.  These nodes may crash or behave in some unpredictable manner.\n\nNested fragmentation is a new phenomenon with IPv6.  It is not possible in IPv4 because the fragmentation fields are part of the main header and are modified in the event of a secondary fragmentation event.  Nested fragmentation is an unnecessary and unwanted IPv6 condition that is not forbidden by the specifications.  It occurs when an IP header chain contains more than one Fragmentation Header, implying that a fragment has been fragmented.  In the specification, the phrase “IP header chain” rather than “packet” is used, because a tunneled packet has more than one IP header chain and each chain can have a Fragment Header (this case is not nested fragmentation).  \n\nThis requirement generally applies to the design of an information technology product, but it can also apply to the configuration of particular information system components that are, or use, such products. This can be verified by acceptance/validation processes in DoD or other government agencies.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000197",
      "title": "The firewall implementation must block IPv6 6to4 addresses at the enclave perimeter for inbound and outbound traffic.",
      "description": "Address spoofing is a major issue on tunnels to a 6to4 relay router.  For incoming traffic, the 6to4 router is unable to match the IPv4 address of the relay router with the IPv6 address of the source.  The address of the IPv6 host or relay router can easily be spoofed.\n\n“6to4” is a tunneling IPv6 transition mechanism [RFC 3056].  6to4 allows IPv6 packets to be transmitted over the IPv4 Internet without the need to configure tunnels, but it requires special relay servers to allow 6to4 networks to communicate with native IPv6 networks.  6to4 does not allow IPv4-only hosts to communicate with IPv6-only hosts — it only allows IPv6 hosts to communicate to IPv6 networks over an IPv4 network.  6to4 tunnels are automatically configured.  A 6to4 connection starts off as an IPv6 packet encapsulated in IPv4, i.e. the protocol field in the IPv4 packet is set to 41. The encapsulated IPv6 packet is decapsulated by a 6to4 relay. Return IPv6 traffic goes to a potentially different 6to4 relay which encapsulates it into an IPv4 packet destined for the original sender.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000198",
      "title": "The firewall implementation must block IPv6 Site Local Unicast addresses (FEC0::/10) at the enclave perimeter by the ingress and egress filters.",
      "description": "The use of site-local addresses has the potential to adversely affect network security through leaks, ambiguity, and potential misrouting, as documented in section 2 of RFC3879.  IPv6 Site Local Unicast addresses (FEC0::/10) must not be defined in the enclave.  Note that this consists of all addresses that begin with FEC, FED, FEE and FEF.\n\nAs currently defined, site-local addresses are ambiguous and can be present in multiple sites.  The address itself does not contain any indication of the site to which it belongs.  RFC3879 formally deprecates the IPv6 site-local Unicast prefix defined in RFC3513, i.e., 1111111011 binary or FEC0::/10.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000199",
      "title": "The firewall implementation must block IPv6 Jumbo Payload hop-by-hop header.",
      "description": "The IPv6 Jumbo Payload allows IP packets to be larger than 65,535 bytes.  This header should be dropped unless the system is specifically designed to use very large payloads since it can break implementations. \n\nThe Jumbo Payload option is carried in an IPv6 Hop-by-Hop Options header, immediately following the IPv6 header.  This feature is only useful on very specialized high performance systems (e.g. super computers).  Common-place link layer technologies do not support these payload sizes, and special link layer designs would be necessary.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000208",
      "title": "The firewall implementation must maintain a current configuration that enforces dynamic information flow control based on organization-defined policies.",
      "description": "If configuration changes are not being saved, the firewall implementation will revert to a possibly unsecure configuration when it reboots; therefore, it is imperative that the most recent configuration be saved to non-volatile memory.  Some devices save configurations to non-volatile memory when the configuration is committed while others require a separate step in order to save the active configuration to non-volatile memory.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000250",
      "title": "The firewall implementation must drop all inbound IPv6 packets with a Type 1 or Types 3 through 255 Routing Header.",
      "description": "The Type 1 Routing Header is defined by an abandoned specification called \"Nimrod Routing\".  Devices may not recognize the Type 1 Routing Header, so packets with this header must be dropped.  IETF standards explicitly require nodes to reject invalid or deprecated options.  In the case of Routing Headers, however, under certain conditions the specification allows a node to ignore the Routing Header and proceed to the next header in the packet [RFC 2460, section 4.4 paragraph 2].  This allows a spurious data channel of arbitrary size and must not be allowed. \n\nThe Types 3 through 255 Routing Header values in the routing type field are currently undefined and should also be dropped both inbound and outbound.  The Routing Header is identified by a Next Header value of 43 (0x2B). To drop all types, including Type 2 Mobile IPv6 (MIPv6), a filter can be defined to drop the Routing Header 43 (0x2B).  If MIPv6 is required, a permit statement will be required for Routing Header 43 (0x2B) Type 2, and then drop the remaining Routing Headers 43 (0x2B).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000251",
      "title": "The firewall implementation must be configured to drop all inbound and outbound IPv6 packets containing a Hop-by-Hop header with invalid option type values.",
      "description": "These options are intended to be for the Destination Options header only.  The optional and extensible natures of the IPv6 extension headers require higher scrutiny since many implementations do not always drop packets with headers that they cannot recognize and hence could cause a DoS on the target device.  In addition, the type, length, value (TLV) formatting provides the ability for headers to be very large.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000252",
      "title": "The firewall implementation must block IPv6 6bone address space on the ingress and egress filters (3FEE::/16).",
      "description": "The decommissioned 6bone allocation (3FFE::/16), RFC 3701 must be blocked.  It is no longer a trusted source.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000253",
      "title": "The firewall implementation must block IPv6 well-known multicast addresses on the ingress and egress inbound filters, (FF00::/8).",
      "description": "The following well-known multicast addresses are predefined and shall never be assigned to any multicast group.\nReserved Multicast Addresses:    \nFF00:0:0:0:0:0:0:0  FF08:0:0:0:0:0:0:0\nFF01:0:0:0:0:0:0:0  FF09:0:0:0:0:0:0:0\nFF02:0:0:0:0:0:0:0  FF0A:0:0:0:0:0:0:0\nFF03:0:0:0:0:0:0:0  FF0B:0:0:0:0:0:0:0\nFF04:0:0:0:0:0:0:0  FF0C:0:0:0:0:0:0:0\nFF05:0:0:0:0:0:0:0  FF0D:0:0:0:0:0:0:0\nFF06:0:0:0:0:0:0:0  FF0E:0:0:0:0:0:0:0\nFF07:0:0:0:0:0:0:0  FF0F:0:0:0:0:0:0:0",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000254",
      "title": "The firewall implementation must block IPv6 Unique Local Unicast addresses on the ingress and egress filters, (FC00::/7).  Note that this consists of all addresses that begin with FC or FD.",
      "description": "Packets originating outside the enclave with a source or destination address of the FC00::/7 prefix are bogus and may be malicious.  The IANA has assigned the FC00::/7 prefix to Unique Local Unicast addresses.   Unique Local Address (ULA) is the IPv6 counterpart of the IPv4 private address and is a routable address that is not intended to be on the Internet.   Site border routers and firewalls should be configured to block any packets with ULA source or destination addresses outside of the site.   This will ensure that packets with Local IPv6 destination addresses will not be forwarded outside of the site via a default route.\n\nDrop all inbound IPv6 packets with an address FC00::/7 as its source address.  Note that this includes any address beginning with FC or FD.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000255",
      "title": "The firewall implementation must protect against Inbound IP packets using RFC5735, RFC6598, and other network address space allocated by IANA but not assigned by the regional internet registries for ISP and other end-customer use by blocking, denying, or dropping them at the perimeter device.",
      "description": "A packet originating from outside the enclave should never have a source address in an unassigned range.  These are bogus source IP addresses and are often used in attacks.  This type of IP address spoofing occurs when someone outside the network uses an address that should not be routed or has not been officially assigned to an ISP for use by the regional internet registries to gain access to systems or devices on the internal network.  If the intruder is successful, they can intercept data, passwords, etc., and use information to perform destructive acts on or to the network.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000256",
      "title": "The firewall implementation must block, deny, or drop inbound IPv4 packets using a link-local address space (169.254.0.0/16) at the perimeter device.",
      "description": "This type of IPv4 address spoofing occurs when someone outside the network uses a link-local address to gain access to systems or devices on the internal network.  If the intruder is successful, they can intercept data, passwords, etc., and use that information to perform destructive acts on or to the network.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000019-FW-000257",
      "title": "The firewall implementation must block, deny, or drop inbound IP packets using an RFC 1918 address space (10.0.0.0/8, 172.16.0.0/12, and 192.168.0.0/16) at the perimeter device.",
      "description": "This type of IP address spoofing occurs when someone outside the network uses an RFC1918 address to gain access to systems or devices on the internal network.  If the intruder is successful, they can intercept data, passwords, etc., and use that information to perform destructive acts on or to the network.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000074-FW-000047",
      "title": "The firewall implementation must produce audit log records that contain sufficient information to establish what type of event occurred.",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment.  Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack. \n\nPlease note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.\n\nLog record content that may be necessary to satisfy this requirement includes, for example, source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked.  Alert and log records must include, at a minimum: reporting device name or IP address, date and time stamp of event, user ID (if available), alert code and/or description.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000075-FW-000048",
      "title": "The firewall implementation must produce log records containing sufficient information to establish when (date and time) the events occurred.",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment. Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall. Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack. \n\nPlease note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.\n\nLog records must have accurate time stamps since forensic analysis of security incidents and day-to-day monitoring are substantially more difficult if there are no timestamps on log entries.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000076-FW-000049",
      "title": "The firewall implementation must produce log records containing sufficient information to establish where the events occurred.",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment.  Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack. \n\nPlease note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.\n\nLog records must identify enclave and sub-enclave, node names, network element name, module, and sub-system as accurately as possible.  Log messages sent to log servers must use a loopback address or management interface address as the source address.  Using a loopback or management interface address as the source address simplifies management and security since it is easier to construct appropriate filters.  A loopback address is less likely to become unavailable since it is usually not dependent on a single physical interface.  Log information recorded by authentication and log servers will record the firewall implementation loopback or management interface address.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000077-FW-000050",
      "title": "The firewall implementation must produce log records containing sufficient information to establish the source of the event.",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment.  Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack. \n\nPlease note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.\n\nLog records must provide the originating IP address (loopback or management interface), process or facility, node or device name, and account (if available) as accurately as possible.  Additionally, for log messages generated as a result of an ACL/rule match, the firewall implementation must identify the specific ACL/rule entry that generated the log message.  Since log records for an ACL match include source and destination IP addresses of the traffic, this further identifies the source of the suspicious or unauthorized traffic.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000078-FW-000051",
      "title": "The firewall implementation must log records for any match of a firewall rule (traffic either allowed or denied).",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment.  Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack. \n\nPlease note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.\n\nInbound connection attempts, if denied, must be logged.  Inbound connection attempts, if permitted, should be logged.  This is important since it provides information concerning both successful and unsuccessful penetration attempts (providing greater threat intelligence) and allows firewall administrators to verify that rule sets/ACLs are properly configured.\n\nOutbound connections must be logged if they are not consistent with the policies of the system or enclave.  This includes attempts by users to access restricted sites, traffic that is not part of the system baseline (described in the Interface Design Document for the system), and other violations of policy or best practices.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000088-FW-000055",
      "title": "The firewall implementation must be configured to send an alert to designated personnel in the event of a logging failure.",
      "description": "If the firewall becomes unable to write events to either local storage or to a centralized server, this is a logging failure.  Configuring the network device or log server to provide alerts to the administrator in the event of a log failure ensures administrative staff is aware of critical alerts. \n\nThis can happen when the local storage is full and the device is not configured to overwrite the oldest record in the file with the newest (circular buffer) or when connectivity to the centralized log server is lost or when the log process is stopped or hung.\n\nThe firewall or components with an Access Control List must generate an alert which will notify system administrators and other designated personnel of the logging failure.  Since system administrators must take action immediately, these messages are assigned level 1 priority/severity.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000088-FW-000215",
      "title": "The firewall implementation must automatically generate an alert to notify the administrator when log storage reaches seventy-five percent or more of its maximum capacity.",
      "description": "Configuring the network device or log server to provide alerts to the administrator in the event of modification or audit log capacity being exceeded ensures administrative staff is aware of critical alerts. Without this type of notification setup, logged audits and events could potentially fill to capacity, causing subsequent records to not be recorded and dropped without any knowledge by the administrative staff. Other unintended consequences of filling the log storage to capacity may include a denial of service of the device itself without proper notification.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000089-FW-000056",
      "title": "In the event of a logging failure, the firewall implementation must overwrite the oldest log records.",
      "description": "It is critical that if the firewall implementation is at risk of failing to process logs, it takes action to mitigate the failure.  Responses to a logging failure depend upon the nature of the failure.   If the failure was caused by the lack of log storage capacity, the network element must continue generating audit records if possible (automatically restarting the audit service if necessary), overwriting the oldest audit records with the newest.  This is known as a circular buffer and is commonly used.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000098-FW-000059",
      "title": "The firewall implementation must protect audit log information from unauthorized read access.",
      "description": "Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack.  Therefore, log records must be protected from unauthorized access, including from legitimate administrators who do not have a need for this type of access.  Without this protection, a compromise or loss of log data needed for incident analysis or risk assessment could result.\n\nOnly individuals who have been designated by the Information Assurance Manager should be members of the group with access to the logs; this includes the System Administrators responsible for maintaining the network.  The directory and file permissions of the logs must be set to only allow those authorized individuals or groups to view the records.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000099-FW-000060",
      "title": "The firewall implementation must protect audit log information from unauthorized modification.",
      "description": "Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack.  Therefore, log records must be protected from unauthorized access, including from legitimate administrators who do not have a need for this type of access.  Without this protection, a compromise or loss of log data needed for incident analysis or risk assessment could result.\n\nAlteration of logs is a common tactic of malicious actors and malicious software such as Trojan Horses or Rootkits.  This is done to conceal unauthorized activity and evade detection.  The permissions for log directories and files must restrict write access to a very limited group of individuals or devices.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000100-FW-000061",
      "title": "The firewall implementation must protect audit logs from unauthorized deletion.",
      "description": "Associating event types with detected events in the logs provides a means of investigating an attack, recognizing resource utilization or capacity thresholds, or identifying an improperly configured firewall.  Without this capability, it would be difficult to establish, correlate, and investigate the events related to an outage or attack.  Therefore, log records must be protected from unauthorized access, including from legitimate administrators who do not have a need for this type of access.  Without this protection, a compromise or loss of log data needed for incident analysis or risk assessment could result.\n\nAlteration and deletion of logs is a common tactic of malicious actors and malicious software such as Trojan Horses or Rootkits.  This is done to conceal unauthorized activity and evade detection.  Individual log entries must not be deleted and log files and directories must only be deleted after being archived in accordance with log retention policies.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000101-FW-000219",
      "title": "The firewall implementation must protect audit tools from unauthorized access.",
      "description": "If an audit tool is compromised, the validity of any audits that are performed using that tool may also be compromised and may be invalid.  Basing decisions or attributions on an invalid audit may result in necessary actions not being taken.\n\nAn audit is the examination and verification of accounts and log records to identify security relevant information such as system or user accesses.  They can be very detailed and time-consuming; therefore, there are software tools that are used to manipulate log data to assist authorized personnel in performing audits.  Computer Assisted Audit Tools and Techniques (CAATT) use data extraction and analysis software to more efficiently analyze log records; this software can vary widely, and may be part of the firewall’s Graphical User Interface (GUI) and an add-on software module.  Examples of this type of tool are firewall analysis software or even spreadsheet programs.  Audit tools include, but are not limited to, vendor-provided and open source audit tools used to view and manipulate information system activity and records such as custom query and report generators. \n\nFirewalls or components with an Access Control List that provide tools to access or manipulate audit data will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user has in order to make access decisions regarding the access to audit tools.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000102-FW-000220",
      "title": "The firewall implementation must protect audit tools from unauthorized modification.",
      "description": "If an audit tool is compromised, the validity of any audits that are performed using that tool may also be compromised and may be invalid.  Basing decisions or attributions on an invalid audit may result in necessary actions not being taken.\n\nAn audit is the examination and verification of accounts and log records to identify security relevant information such as system or user accesses.  They can be very detailed and time-consuming; therefore, there are software tools that are used to manipulate log data to assist authorized personnel in performing audits.  Computer Assisted Audit Tools and Techniques (CAATT) use data extraction and analysis software to more efficiently analyze log records; this software can vary widely, and may be part of the firewall’s Graphical User Interface (GUI) and an add-on software module.  Examples of this type of tool are firewall analysis software or even spreadsheet programs.  Audit tools include, but are not limited to, vendor-provided and open source audit tools used to view and manipulate information system activity and records such as custom query and report generators. \n\nFirewalls or components with an Access Control List that provide tools to access or manipulate audit data will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user has in order to make access decisions regarding the access to audit tools.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000103-FW-000221",
      "title": "The firewall implementation must protect audit tools from unauthorized deletion.",
      "description": "If an audit tool is deleted, performing audits will take additional time and may lead to less thorough and/or less accurate results.  This may adversely impact the ability of responsible personnel to correctly and quickly respond to a security incident.\n\nAn audit is the examination and verification of accounts and log records to identify security relevant information such as system or user accesses.  They can be very detailed and time-consuming; therefore, there are software tools that are used to manipulate log data to assist authorized personnel in performing audits.  Computer Assisted Audit Tools and Techniques (CAATT) use data extraction and analysis software to more efficiently analyze log records; this software can vary widely, and may be part of the firewall’s Graphical User Interface (GUI) and an add-on software module.  Examples of this type of tool are firewall analysis software or even spreadsheet programs.  Audit tools include, but are not limited to, vendor-provided and open source audit tools used to view and manipulate information system activity and records such as custom query and report generators. \n\nFirewalls or components with an Access Control List that provide tools to access or manipulate audit data will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user has in order to make access decisions regarding the access to audit tools.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000113-FW-000065",
      "title": "The firewall implementation must generate a log record for any traffic to a port, protocol, or service that is denied.",
      "description": "It is essential for security personnel to know what is being done, what attempted to be done, where it was done, when it was done, and by whom in order to compile an accurate risk assessment. Logging the actions of specific events provides a means to investigate an attack, recognize resource utilization or capacity thresholds, or to simply identify an improperly configured firewall.  Auditing and logging are key components of any security architecture.  Please note the distinction between logging and auditing; they are not the same, but they are closely related; auditing is a part of logging.  Logging is recording data about events that take place in a system, while auditing is the use of log records to identify security relevant information such as system or user accesses.  In short, log records are audited to establish an accurate history.  Without logging, it would be impossible to establish an audit trail.  \n\nAll security violations and potential security violations must be logged.  Specific events are defined by other requirements in this guide; however, organizations must also define additional events for logging based on mission requirements.   \n\nFor the firewall or other device using an Access Control List, all matches against statements where the packet is either denied or dropped must be logged.  Note that some equipment manufacturers use severity level 6 (informational) when logging packets that are dropped by an access control list.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000131-FW-000074",
      "title": "The firewall implementation must not have unnecessary services and functions enabled.",
      "description": "Unnecessary services and functions increase the attack surface (sum of attack vectors) of a system.  These unnecessary capabilities or services are often overlooked and therefore may remain unsecured.  Firewalls and devices that implement ACLs can be capable of providing a wide variety of functions and services; not all of these capabilities are necessary.  It is detrimental for network elements to provide, or enable by default, functionality exceeding requirements or mission objectives.  Only those functions and services that are necessary to support operations must be enabled and those functions and services secured.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000131-FW-000223",
      "title": "The firewall implementation must not enable the service or feature that automatically contacts the vendor.",
      "description": "\"Call home\" services or features will routinely send data such as configuration and diagnostic information to the vendor for routine or emergency analysis and troubleshooting.  However, using this capability introduces the risk of transmission of sensitive data  to unauthorized persons.  The call home capability may not exist on a specific device and is rarely enabled by default.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000131-FW-000224",
      "title": "The firewall implementation's auxiliary port (if present) must be disabled unless it is connected to a secured modem providing encryption and authentication.",
      "description": "The use of POTS lines to modems connecting to network devices provides clear text of authentication traffic over commercial circuits that could be captured and used to compromise the network. Additional war dial attacks on the device could degrade the device and the production network.\n\nSecured modem devices must be able to authenticate users and must negotiate a key exchange before full encryption takes place. The modem will provide full encryption capability or stronger. The technician who manages these devices will be authenticated using a key fob and granted access to the appropriate maintenance port, thus the technician will gain access to the managed device (router, switch, etc.). The token provides a method of strong (two-factor) user authentication. The token works in conjunction with a server to generate one-time user passwords that will change values at second intervals. The user must know a personal identification number (PIN) and possess the token to be allowed access to the device.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000132-FW-000075",
      "title": "The firewall implementation must be configured to prohibit or restrict the use of functions, ports, protocols, and/or services, as defined in the PPSM CAL and vulnerability assessments.",
      "description": "The DoD continually assesses the ports, protocols, and services that can be used for network communications. Some ports, protocols or services have known exploits or security weaknesses. These ports, protocols, and services must be prohibited or restricted by the firewall implementation (enclave firewall and ACL in the perimeter router) in accordance with DoD policy.  Ingress and egress Access Control Lists restrict traffic destined to the enclave perimeter in accordance with the guidelines contained in DoD Instruction 8551.1 for all ports and protocols required for operational commitments.  \n\nAll ports and protocols allowed into the enclave must be registered in the PPSM database.  It is the responsibility of the enclave owner to have the applications the enclave uses registered in the PPSM database.  Vulnerability assessments must be reviewed and protocols must be approved by the IA staff before entering the enclave.  Systems Administrators will review the PPS Vulnerability Assessment of every port allowed into the enclave and apply all appropriate mitigations defined in the Vulnerability Assessment report.\n\nIf the perimeter is in a Deny-by-Default posture and what is allowed through the perimeter defenses is in accordance with DoD Instruction 8551.1, and if each permit rule is explicitly defined with explicit ports and protocols allowed, then all requirements related to PPS being blocked would be satisfied.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000192-FW-000234",
      "title": "The firewall implementation must be configured to restrict it from accepting outbound IP packets that contain an illegitimate address in the source address field via egress filter or by enabling Unicast Reverse Path Forwarding.",
      "description": "A compromised host in an enclave can be used by a malicious actor as a platform to launch cyber attacks on third parties.  This is a common practice in “botnets”, which are a collection of compromised computers using malware to attack (usually DDoS) other computers or networks.  DDoS attacks frequently leverage IP source address spoofing, in which packets with false source IP addresses send traffic to multiple hosts, who then send return traffic to the hosts with the IP addresses that were forged.  This can generate significant, even massive, amounts of traffic.  Therefore, protection measures to counteract IP source address spoofing must be taken. \n\nEnclaves must enforce egress filtering.  In egress filtering, packets leaving the enclave are discarded if the source IP address is not part of the IP address network(s), also known as prefixes, which are assigned to the enclave.  A more specific form of egress filtering is to allow only those hosts and protocols that have been identified and authorized to exit the enclave.  All traffic leaving the enclave, regardless of the destination, must be filtered by the premise router's egress filter to verify that the source IP address belongs to the enclave.  IP address networks are assigned by the DoD Network Information Center (NIC).  \n\nThe firewall or other device implementing an Access Control List must not accept any outbound IP packets that contain an illegitimate address in the source address field by enabling Unicast Reverse Path Forwarding (uRPF) strict mode or by implementing an egress ACL.  Unicast Reverse Path Forwarding (uRPF) provides an IP address spoof protection capability.  When uRPF is enabled in strict mode, the packet must be received on the interface that the device would use to forward the return packet.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000193-FW-000235",
      "title": "The firewall implementation must manage excess bandwidth to limit the effects of packet flooding types of Denial of Service (DoS) attacks.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  Packet flooding DDoS attacks are referred to as Volumetric Attacks and have the objective of overloading a network or circuit to deny or seriously degrade performance, which denies access to the services that normally traverse the network or circuit.  Volumetric Attacks have become relatively easy to launch using readily available tools such as Low Orbit Ion Cannon or by botnets.  \n\nMeasures to mitigate the effects of a successful Volumetric Attack must be taken to ensure that sufficient capacity is available for mission critical traffic.   Managing capacity may include, for example, establishing selected network usage priorities or quotas and enforcing them using rate limiting, Quality of Service (QoS), or other resource reservation control methods.  These measures may also mitigate the effects of sudden decreases in network capacity that are the result of accidental or intentional physical damage to telecommunications facilities (such as cable cuts or weather-related outages).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000199-FW-000238",
      "title": "The firewall implementation must prevent discovery of specific system components or devices composing the enclave protection devices.",
      "description": "If the devices protecting the enclave can be discovered, they can be probed and attacked.  These devices must be protected from discovery and reconnaissance by hostile actors or malware since information gained from a successful reconnaissance can be used to develop attacks against the system.\n\nThe boundary protection devices, along with the other components of the network, are assigned IP addresses that are on the management network, which is a separate subnet.  Safeguards must be implemented for containment of management and production traffic boundaries.  The subnet(s) that are assigned to these devices must be segregated from other IP address subnets, and traffic to and from the management network must be restricted.  This prevents these devices from being discovered and attacked.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000202-FW-000118",
      "title": "The firewall implementation must deny network communications traffic by default and allow network communications traffic by exception (i.e., deny all, permit by exception).",
      "description": "Failing to identify and prohibit unauthorized traffic leaves the enclave vulnerable to attack.  The initial defense for the internal network is for protection measures to block any traffic at the perimeter that is attempting to make a connection (or otherwise establish a traffic flow) to a host in the internal network.  However, threats can be introduced into the enclave through non-network means, such as compromised computer media, and compromised hosts then attempt to use the internal network to attack both other internal hosts and external networks.  Therefore, all expected traffic must be identified by application, endpoints, protocol, and port and rulesets/ACLs used to only allow the authorized traffic. \n\nThis requirement applies to network traffic originating either from inside or outside the enclave.  The firewall or other device implementing an Access Control List must only allow traffic through that is explicitly permitted.  Only those connections (or traffic flows) which are essential and approved must be allowed.  All other inbound and outbound traffic must be denied by default.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000205-FW-000121",
      "title": "The firewall implementation must apply ingress filters entering the network to the external interface in the inbound direction.",
      "description": "Filters are used to separate data traffic into that which it will route (permitted packets) and that which it will not route (denied packets). Secure configuration of routers makes use of filters for restricting access to services on the router itself as well as for filtering traffic passing through the router. It should be noted that some operating systems default filters are applied to the outbound queue. The more secure solution is to apply the filter to the inbound queue for three reasons:\n*The device can protect itself before damage is inflicted.\n*The input port is still known, and can be filtered.\n*It is more efficient to filter packets before forwarding them.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000205-FW-000122",
      "title": "The firewall implementation must apply egress filters leaving the network to the internal interface in the inbound direction.",
      "description": "Filters are used to separate data traffic into that which it will route (permitted packets) and that which it will not route (denied packets). Secure configuration of routers makes use of filters for restricting access to services on the router itself as well as for filtering traffic passing through the router. It should be noted that some operating systems default filters are applied to the outbound queue. The more secure solution is to apply the filter to the inbound queue for three reasons:\n* The device can protect itself before damage is inflicted.\n* The input port is still known, and can be filtered.\n* It is more efficient to filter packets before forwarding them.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000273-FW-000152",
      "title": "The firewall implementation must generate error messages that provide information necessary for corrective actions without revealing information that could be exploited by adversaries.",
      "description": "Internet Control Message Protocol (ICMP) messages are used to provide feedback about problems in the network.  These messages are sent back to the sender to support diagnostics.  However, some also provide information that an attacker can use in reconnaissance of a network.  A firewall rule or ACL entry must be configured to “silently drop” the packet and not send an ICMP control message back to the source.  In some cases, it may be necessary to direct the traffic to a null interface.  Three ICMP messages are commonly used by attackers for network mapping: Destination Unreachable, Redirect, and Address Mask Reply.  These responses must be blocked on external interfaces; however, blocking the Destination Unreachable response will prevent Path Maximum Transmission Unit Discovery (PMTUD), which relies on the response “ICMP Destination Unreachable—Fragmentation Needed but DF Bit Set”.  PMTUD is a useful function and should only be “broken” after careful consideration.  An acceptable alternative to blocking all Destination Unreachable responses is to filter Destination Unreachable messages generated by the firewall implementation to allow ICMP Destination Unreachable—Fragmentation Needed but DF Bit Set (Type 3, Code 4) and apply this filter to the external interfaces.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000273-FW-000258",
      "title": "The firewall implementation must block all inbound traceroutes to prevent network discovery by unauthorized users.",
      "description": "The traceroute tool will display routes and trip times on an IP network.  An attacker can use traceroute responses to create a map of the subnets and hosts behind the perimeter.  The traditional traceroute relies on TTL - time exceeded responses from routers along the path and an ICMP port-unreachable message from the target host. In some operating systems, such as UNIX, traceroute will use UDP port 33400 and increment ports on each response.  Since blocking these UDP ports alone will not block traceroute capabilities without also blocking potentially legitimate traffic on a network, it is unnecessary to block them explicitly.  Because traceroutes typically rely on an ICMP Type 11 - Time Exceeded message, the time-exceeded message will be the target, either implicitly or explicitly blocking outbound traffic from the trusted network.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000333-FW-000213",
      "title": "The firewall implementation must support centralized management and configuration of the content to be captured in log records.",
      "description": "Without the ability to centrally manage the content captured in the log records, identification, troubleshooting, and correlation of suspicious behavior would be difficult and could lead to a delayed or incomplete analysis of an attack.  Centralized management and storage of log records increases efficiency in maintenance and management of records as well as facilitates the backup and archiving of those records.  \n\nNetwork elements such as firewalls and components with Access Control Lists must have the capability to support centralized logging.  They must be configured to send log messages to centralized, redundant servers and be capable of being remotely configured to change logging parameters (such as facility and severity levels).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000334-FW-000201",
      "title": "The firewall implementation must write log records to centralized, redundant log servers and those records backed up to a different system or media.",
      "description": "Information stored in one location is vulnerable to accidental or intentional deletion or alteration.  Sending log records to a log server is a form of “off-loading” and is a common practice since network elements usually have a limited amount of storage.  This also prevents the log records from being lost if the logs stored locally are accidentally or intentionally deleted, altered, or corrupted.\n\nNetwork elements such as firewalls and components with Access Control Lists must have the capability to support centralized logging.  They must be configured to send log messages to centralized, redundant servers.\n\nIn turn, the log servers must be backed up to a separate storage device or to different media (such as CD-ROM).  This allows the records to be saved in case an investigation or audit is performed at a later date.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000335-FW-000216",
      "title": "The firewall implementation must provide an immediate real time alert to the System Administrator and Information Assurance Officer, at a minimum, of all audit failure events requiring real time alerts.",
      "description": "If the firewall implementation becomes unable to write events to either local storage or to a centralized server, this is a logging failure.   Configuring the network device or log server to provide alerts to the administrator in the event of a log failure ensures administrative staff is aware of critical alerts. \n\nThis can happen when the local storage is full and the device is not configured to overwrite the oldest record in the file with the newest (circular buffer) or when connectivity to the centralized log server is lost or when the log process is stopped or hung.  If this happens, there is a risk that high priority messages will not be logged and noted by the responsible personnel.  Severity levels 0 (Emergency), 1 (Alert), and 2 (Critical) require messages to be sent in real time (within seconds) to responsible personnel so they can take immediate corrective actions.\n\nThe firewall or devices with an Access Control List must generate an alert which will notify system administrators and other designated personnel of the failure to log messages of severity levels 0 through 2 (inclusive).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000335-FW-000217",
      "title": "The firewall implementation must make alarm messages identifying a security violation accessible to authorized personnel.",
      "description": "It is essential for security personnel to know what is being done, what was attempted, where it was done, when it was done, and by whom it was done in order to compile an accurate risk assessment.  The relevant audit information must be available to administrators.  The log records/alerts associated with a security violation must be accessible by authorized personnel so they can readily view them and take appropriate action based on the contents of the alert.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000362-FW-000229",
      "title": "The firewall implementation must protect against or limit the effects of all types of Denial of Service (DoS) attacks by employing security safeguards.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity.  DoS attacks can take multiple forms but have the common objective of overloading or blocking a network or host to deny or seriously degrade performance, thus rendering it useless.  These attacks can be simple “floods” of traffic to saturate circuits or devices, malware that consumes CPU and memory on a device or causes it to crash, or misconfigurations that disable or impair the proper function of a device.  \n\nA variety of technologies exist to limit, or in some cases, eliminate the effects of denial of service attacks.  For example, boundary protection devices can filter certain types of packets to protect information system components on internal organizational networks from being directly affected by denial of service attacks.  Employing increased capacity and bandwidth combined with service redundancy may also reduce the susceptibility to denial of service attacks.  Services and components should be redundant when possible. \n\nA firewall or other device implementing an Access Control List must be configured to protect the enclave from DoS attacks (e.g. SYN-flood, ICMP-flood, Land, etc.).  Various techniques exist such as rate-limiting, policing, or filtering excessive traffic.  Each protective measure depends on the specific attack.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000362-FW-000230",
      "title": "The firewall implementation must protect against TCP SYN floods.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  A SYN-flood attack is a denial-of-service attack where the attacker sends a huge amount of please-start-a-connection packets and then nothing else. This causes the device being attacked to be overloaded with the open sessions and eventually crash.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000362-FW-000231",
      "title": "The firewall implementation must drop half-open TCP connections through filtering thresholds or timeout periods.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  A TCP connection consists of a three-way handshake message sequence. A connection request is transmitted by the originator, an acknowledgement is returned from the receiver, and then an acceptance of that acknowledgement is sent by the originator.\n\nAn attacker’s goal in this scenario is to cause a denial of service to the network or device by initiating a high volume of TCP packets, then never sending an acknowledgement, leaving connections in a half-opened state. Without the device having a connection or time threshold for these half-opened sessions, the device risks being a victim of a denial of service attack. Setting a TCP timeout threshold will instruct the device to shut down any incomplete connections. Services such as SSH, BGP, SNMP, LDP, etc., are some services that may be prone to these types of denial of service attacks. If the router does not have any BGP connections with BGP neighbors across WAN links, values could be set to even tighter constraints.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000362-FW-000232",
      "title": "The firewall implementation must protect against \"Ping of Death\" (oversized ICMP echo request) attacks.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  The \"Ping of Death\" is a malformed (oversized) ICMP echo request.  An oversized ICMP echo request packet can cause a variety of adverse reactions such as crashing, freezing, or rebooting.  This results in a denial of service.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000362-FW-000233",
      "title": "The firewall implementation must protect against or limit the effects of all types of Denial of Service (DoS) attacks directed against the device itself by employing security safeguards.",
      "description": "Denial of Service is a condition when a resource is not available for legitimate users.  When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity.  DoS attacks can take multiple forms but have the common objective of overloading or blocking a network or host to deny or seriously degrade performance, thus rendering it useless.  These attacks can be simple “floods” of traffic to saturate circuits or devices, malware that consumes CPU and memory on a device or causes it to crash, or misconfigurations that disable or impair the proper function of a device.  \n\nIt is important to protect the management plane and the control plane of the firewall implementation itself.  When a DoS attack is directed against the firewall implementation (or any other network element), the device will operate at a degraded capacity and will not be able to process legitimate traffic and may not respond to management commands.    \n\nA firewall or other device implementing an Access Control List must be configured to protect itself from DoS attacks (e.g. embryonic connection or half-open attacks, etc.).  Various techniques exist such as rate-limiting or filtering excessive traffic.  Each protective measure depends on the specific attack.  Traffic to the loopback or management IP address or management zone of the device must be filtered, policed, and/or otherwise limited.\n\nWhenever possible, access to the device through the console port through an Out-of-Band (OOB) network should be implemented.  This provides a “last resort” remote access to the device.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000364-FW-000237",
      "title": "The firewall implementation must only allow incoming communications from authorized sources routed to authorized destinations.",
      "description": "Unauthorized traffic is untrusted traffic and may be malicious.  Traffic originating from unauthorized sources may be hostile and pose a threat to an enclave or to other connected networks.  Traffic originating from authorized sources but connecting to unauthorized destinations may be the result of compromised external hosts.  Additionally, unrestricted traffic may transit a network, which uses bandwidth and other resources. Therefore, all expected traffic must be identified by application, endpoints, protocol, and port and then vetted.  Only those connections (or traffic flows) which are essential and approved must be allowed.  \n\nThe firewall or other device implementing an Access Control List must only allow traffic from authorized sources to authorized destinations.  Sources and destinations should be as specifically identified as possible.  All other inbound and outbound traffic must be denied by default.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000365-FW-000239",
      "title": "The firewall implementation must fail securely in the event of an operational failure.",
      "description": "If the firewall implementation fails in an unsecure manner (open), unauthorized traffic originating externally to the enclave may enter, or the device may permit unauthorized information release.  Fail secure is a condition achieved by employing information system mechanisms to ensure, in the event of an operational failure of the firewall implementation, it does not enter into an unsecure state where intended security properties no longer hold. \n\nIf the device fails, it must not fail in a manner that will allow unauthorized access.  If the firewall or other device implementing an ACL fails for any reason, it must stop forwarding traffic altogether or maintain the configured security policies.  If the device stops forwarding traffic, maintaining network availability would be achieved through firewall redundancy.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000366-FW-000240",
      "title": "The firewall implementation must block both inbound and outbound communications traffic between organization-defined communication clients that are independently configured by end users and external service providers.",
      "description": "Various communication services such as public VoIP and Instant Messaging services route messages over their own networks and are stored on their own servers; therefore, that traffic can be accessed at any time by the provider and potentially intercepted.  These applications may also contain vulnerabilities and can be used as an attack vector against DoD Information Systems.  Communication clients independently configured by end users and external service providers include, for example, instant messaging clients.  They can be configured by third parties or users without the authorization, or even the knowledge, of security personnel.\n\nPublic hosting places the data on servers and networks that are beyond the control of the DoD.  This design provides a much broader base of users; however, the data is more vulnerable to attacks.  Public hosting architectures must not be deployed within the DoD.\n\nSome of these applications use the Peer-to-Peer (P2P) model.  There are two types of P2P networks, pure and hybrid. Pure P2P networks operate with peers acting as equals and merge the roles of clients and server. Pure P2P has no central server managing the network, while hybrid P2P has a central server that keeps information on peers and responds to requests for that information. Peers are responsible for hosting available resources and for letting the central server know what resources they want to share, and for making its shareable resources available to peers that request it.  Examples of these applications are P2PChat and Bit Torrent Chat.  Pure and hybrid P2P instant messaging architectures are prohibited, since they bypass the security policies within the enclave. \n\nThis does not apply to authorized communication clients that are configured by organizations to perform authorized functions.  Those applications must be authorized, secured in accordance with all applicable security guidance, and the ports, protocols, and endpoints identified.   The firewall or other device implementing an Access Control List must deny both inbound and outbound communications traffic of unauthorized communications clients.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000390-FW-000243",
      "title": "The firewall implementation must continuously monitor inbound communications traffic for unusual or unauthorized activities or conditions.",
      "description": "Failing to continuously monitor the network leaves the network vulnerable to attack.  The Enclave firewall rules and Access Control Lists should be based on authorized applications being used within the Enclave; all non-required ports and services will be blocked by the most restrictive rules possible.  This applies to both Wide Area Network (WAN) to Local Area Network (LAN) interfaces and the LAN to LAN interfaces between different security domains/sub-enclaves.  The device must be placed at these boundaries and configured to monitor and to only allow specifically authorized traffic.  All other traffic is unauthorized and unusual and therefore prohibited.\n\nAlthough only authorized traffic is permitted by source and destination IP address pair and protocol/port, ACLs and simple firewalls that cannot perform deep packet inspection can be “fooled” by malicious traffic masquerading as legitimate traffic.  The ports used by this traffic can be normally used by other applications; this makes identifying this traffic beyond the capabilities of a simple ACL or even stateful firewall.  If authorized traffic exhibits unusual traffic volumes, it indicates possible traffic masquerading.  Therefore, unusual volumes of traffic must be logged and a notification sent to authorized personnel.  This can be accomplished by configuring rate limiters to generate log messages when a threshold is met or exceeded or by using capabilities that monitor and export flow information to a centralized collector or console (e.g. Netflow, j-flow, etc.).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000391-FW-000244",
      "title": "The firewall implementation must continuously monitor outbound communications traffic for unusual/unauthorized activities or conditions.",
      "description": "Failing to continuously monitor the network leaves the network vulnerable to attack.  The Enclave firewall rules and Access Control Lists should be based on authorized applications being used within the Enclave; all non-required ports and services will be blocked by the most restrictive rules possible.  This applies to both Wide Area Network (WAN) to Local Area Network (LAN) interfaces and the LAN to LAN interfaces between different security domains/sub-enclaves.  The device must be placed at these boundaries and configured to monitor and to only allow specifically authorized traffic.  All other traffic is unauthorized and unusual, and therefore prohibited.\n\nAlthough only authorized traffic is permitted by source and destination IP address pair and protocol/port, ACLs and simple firewalls that cannot perform deep packet inspection can be “fooled” by malicious traffic masquerading as legitimate traffic.  The ports used by this traffic can be normally used by other applications; this makes identifying this traffic beyond the capabilities of a simple ACL or even stateful firewall.  If authorized traffic exhibits unusual traffic volumes, it indicates possible traffic masquerading.  Therefore, unusual volumes of traffic must be logged and a notification sent to authorized personnel.  This can be accomplished by configuring rate limiters to generate log messages when a threshold is met or exceeded or by using capabilities that monitor and export flow information to a centralized collector or console (e.g. Netflow, j-flow, etc.).",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000401-FW-000246",
      "title": "The firewall implementation must properly reassemble incoming fragmented packets before configured policies are applied to them or drop fragmented packets.",
      "description": "Packet fragmentation is allowed by the TCP/IP specifications and is encouraged in situations where it is needed. However, packet fragmentation has been used to make some attacks harder to detect (by placing them within fragmented packets), and unusual fragmentation has also been used as a form of attack.   For example, some network-based attacks have used packets that should not exist in normal communications, such as sending some fragments of a packet but not the first fragment, or sending packet fragments that overlap each other.   This latter case, known as the Overlapping Fragment Attack, attempts to “trick” the firewall by overwriting part of the TCP header information of the first fragment, which contained data that was allowed to pass through the firewall, with malicious data in subsequent fragments.  A common use of this is to overwrite the destination port number to change the type of service which would not be allowed to pass the router in normal circumstances.\n\nThe capability to properly reassemble incoming fragmented packets before configured policies are applied to them can be verified by acceptance/validation processes in DoD or other government agencies.   This would be verified, in part, by validation testing.  If the device cannot properly reassemble packets before configured policies are applied to them, it must be configured to drop fragmented packets.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000402-FW-000247",
      "title": "The firewall implementation must reveal error messages only to the IAO, IAM, and SA.",
      "description": "Only authorized personnel should be aware of errors and the details of the errors.  Error messages are an indicator of an organization's operational state or can give information about configuration and/or architecture of the network.\n\nInternet Control Message Protocol (ICMP) messages are used to provide feedback about problems in the network.  These messages are sent back to the sender to support diagnostics.  However, some also provide information that an attacker can use in reconnaissance of a network.  ICMP control messages must be filtered at external enclave boundaries and at connections to untrusted networks.\n\nLog messages and SNMP traps must only be directed to authorized end-points (such as the log server and SNMP management console respectively) and be restricted to the Network Management subnet/VLAN.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000511-FW-000214",
      "title": "The firewall implementation must write log records to centralized, redundant log servers in real time and those records backed up weekly.",
      "description": "Information stored in one location is vulnerable to accidental or intentional deletion or alteration.  Sending log records to a log server is a form of “off-loading” and is a common practice since network elements usually have a limited amount of storage.  This also prevents the log records from being lost if the logs stored locally are accidentally or intentionally deleted, altered, or corrupted.\n\nNetwork elements such as firewalls and components with Access Control Lists must have the capability to support centralized logging.  They must be configured to send log messages to centralized, redundant servers in real time.  Joint Publication 1-02 defines “real time” as “Pertaining to the timeliness of data or information which has been delayed only by the time required for electronic communication. This implies that there are no noticeable delays.”  In other words, the device must send the log records to the centralized, redundant servers at the same time it is writing them to the local storage.\n\nIn turn, the log servers must be backed up on a regular schedule at weekly intervals.  This allows the records to be saved in case an investigation or audit is performed at a later date.",
      "severity": "medium"
    },
    {
      "id": "SRG-NET-000512-FW-000222",
      "title": "The firewall implementation must be configured in accordance with the security configuration settings based on DoD security configuration or implementation guidance, including NSA configuration guides, Communications Tasking Orders (CTOs), and Directive-Type Memorandums (DTMs).",
      "description": "If the firewall or device implementing an ACL/rule set does not follow established security guidance, it is likely that it is not adequately secured, which increases the risk.  Configuring the firewall or device implementing an ACL to implement organization-wide security implementation guides and security checklists ensures compliance with federal standards and establishes a common security baseline across DoD that reflects the most restrictive security posture consistent with operational requirements. \n\nCommon secure configurations (also referred to as security configuration checklists, lockdown and hardening guides, security reference guides, security technical implementation guides) provide recognized, standardized, and established benchmarks that stipulate secure configuration settings for specific information technology platforms/products and instructions for configuring those information system components to meet operational requirements.\n\nTypically, an equipment vendor provides their product on an appliance with an embedded operating system (either a modified version of a common operating system or a proprietary operating system) and other application and/or database code.   To minimize risk, a firewall or device implementing an ACL must use a secure or hardened platform and comply with all applicable configuration guidance.",
      "severity": "medium"
    }
  ]
}