{
  "name": "google_chrome_v23_windows",
  "date": "2013-01-11",
  "description": "None",
  "title": "Google Chrome v23 Windows STIG ",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-35464",
      "title": "Firewall traversal from remote host must be disabled",
      "description": "Remote connections should never be allowed that bypass the firewall, as there is no way to verify if they can be trusted.\n\n\"Enables usage of STUN and relay servers when remote clients are trying to establish a connection to this machine. If this setting is enabled, then remote clients can discover and connect to this machine even if they are separated by a firewall. If this setting is disabled and outgoing UDP connections are filtered by the firewall, then this machine will only allow connections from client machines within the local network. If this policy is left not set the setting will be enabled.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35619",
      "title": "Site tracking users location must be disabled",
      "description": "Tracking of user location data over time poses a significant OPSEC issue.\n\n\"allows you to set whether websites are allowed to track the users' physical location. Tracking the users' physical location can be allowed by default, denied by default or the user can be asked every time a website requests the physical location. If this policy is left not set, 'AskGeolocation' will be used and the user will be able to change it.\n\t1 = Allow sites to track the users' physical location\n\t2 = Do not allow any site to track the users' physical location\n\t3 = Ask whenever a site wants to track the users' physical location\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35620",
      "title": "Sites ability for showing desktop notifications must be disabled",
      "description": "\"Allows you to set whether websites are allowed to display desktop notifications. Displaying desktop notifications can be allowed by default, denied by default or the user can be asked every time a website wants to show desktop notifications. If this policy is left not set, 'AskNotifications' will be used and the user will be able to change it.\n    1 = Allow sites to show desktop notifications\n    2 = Do not allow any site to show desktop notifications\n    3 = Ask every time a site wants to show desktop notifications\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35621",
      "title": "Sites ability to show pop-ups must be disabled",
      "description": "\"Allows you to set whether websites are allowed to show pop-ups. Showing popups can be either allowed for all websites or denied for all websites. If this policy is left not set, 'BlockPopups' will be used and the user will be able to change it.\n    1 = Allow all sites to show pop-ups\n    2 = Do not allow any site to show popups\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35622",
      "title": "Extensions must be blacklisted by default",
      "description": "Extensions are developed by third party sources. They are designed to extend Google Chrome's functionality. An extension can be made by anyone, to do and access almost anything on a system; this means they pose a high risk to any system that would allow all extensions to be installed by default. \n\n\"Allows you to specify which extensions the users can NOT install. Extensions already installed will be removed if blacklisted. A blacklist value of '*' means all extensions are blacklisted unless they are explicitly listed in the whitelist. If this policy is left not set the user can install any extension in Google Chrome.\" - Google Chrome Administrators Policy List",
      "severity": "high"
    },
    {
      "id": "V-35623",
      "title": "Extensions that are approved for use must be whitelisted",
      "description": "The whitelist should only contain organizationally approved extensions. This is to prevent a user from accidently whitelisitng a malicious extension.\n\n\"Allows you to specify which extensions are not subject to the blacklist. A blacklist value of * means all extensions are blacklisted and users can only install extensions listed in the whitelist. By default, no extensions are whitelisted. If all extensions have been blacklisted by policy, then the whitelist policy can be used to allow specific extensions to be installed. Administrators should determine which extensions should be allowed to be installed by their users. If no extensions are whitelisted, then no extensions can be installed when combined with blacklisting all extensions\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35624",
      "title": "The default search providers name must be set",
      "description": "\"Specifies the name of the default search provider. If left empty or not set, the host name specified by the search URL will be used. This policy is only considered if the 'DefaultSearchProviderEnabled' policy is enabled.\n    When doing internet searches it is important to used an encrypted connection via https.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35625",
      "title": "The default search provider URL must be set",
      "description": "\"Specifies the URL of the search engine used when doing a default search. The URL should contain the string '{searchTerms}', which will be replaced at query time by the terms the user is searching for. This option must be set when the 'DefaultSearchProviderEnabled' policy is enabled and will only be respected if this is the case..\" - Google Chrome Administrators Policy List\n\n    When doing internet searches it is important to used an encrypted connection via https. ",
      "severity": "medium"
    },
    {
      "id": "V-35626",
      "title": "Default search provider must be enabled",
      "description": "\"Enables the use of a default search provider. If you enable this setting, a default search is performed when the user types text In the omnibox that is not a URL. You can specify the default search provider to be used by setting the rest of the default search policies. If these are left empty, the user can choose the default provider. If you disable this setting, no search is performed when the user enters non-URL text in the omnibox. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, the default search provider is enabled, and the user will be able to set the search provider list.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35757",
      "title": "Use of cleartext passwords in the Password Manager must be disabled",
      "description": "Cleartext passwords would allow another individual to see password via shouldersurfing.\n\n\"Controls whether the user may show passwords in clear text in the password manager. If you disable this setting, the password manager does not allow showing stored passwords in clear text in the password manager window. If you enable or do not set this policy, users can view their passwords in clear text in the password manager..\" - Google Chrome Administrators Policy List",
      "severity": "high"
    },
    {
      "id": "V-35758",
      "title": "The Password Manager must be disabled",
      "description": "\"Enables saving passwords and using saved passwords in Google Chrome. If you enable this setting, users can have Google Chrome memorize passwords and provide them automatically the next time they log in to a site. If you disable this setting, users are not able to save passwords or use already saved passwords. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it.\" - Google Chrome Administrators Policy List\n\nPassword manager should not be used as it stores passwords locally.",
      "severity": "medium"
    },
    {
      "id": "V-35759",
      "title": "The HTTP Authentication must be set to negotiate",
      "description": "\"Specifies which HTTP Authentication schemes are supported by Google Chrome. Possible values are 'basic', 'digest', 'ntlm' and 'negotiate'. Separate multiple values with commas. If this policy is left not set, all four schemes will be used.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35760",
      "title": "The running of outdated plugins must be disabled",
      "description": "Running outdated plugins could lead to system compromise through the use of known exploits.Having plugins that udpated to the most current version ensures the smallest attack surfuce possible.\n\n\"Allows Google Chrome to run plugins that are outdated. If you enable this setting, outdated plugins are used as normal plugins. If you disable this setting, outdated plugins will not be used and users will not be asked for permission to run them. If this setting is not set, users will be asked for permission to run outdated plugins.\" - Google Chrome Administrators Policy List",
      "severity": "high"
    },
    {
      "id": "V-35761",
      "title": "Plugins requiring authorization must ask for user permission",
      "description": "\"Allows Google Chrome to run plugins that require authorization. If you enable this setting, plugins that are not outdated always run. If this setting is disabled or not set, users will be asked for permission to run plugins that require authorization. These are plugins that can compromise security.\" - Google Chrome Administrators Policy List",
      "severity": "high"
    },
    {
      "id": "V-35762",
      "title": "Third party cookies must be blocked",
      "description": "\"Blocks third party cookies. Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar. Disabling this setting allows cookies to be set by web page elements that are not from the domain that is in the browser's address bar and prevents users from changing this setting. If this policy is left not set, third party cookies will be enabled but the user will be able to change that.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35763",
      "title": "Site data must not be wiped on closing the browser",
      "description": "\"This policy is an override for the \"Clear cookies and other site data when I close my browser\" content settings option. When set to enabled Google Chrome will delete all locally stored data from the browser when it is shut down. If set to disabled site data will not be cleared on exit. If this policy is left not set Google Chrome will use the default which is to preserve site data on shut down and the user will be able to change this. If the \"RestoreOnStartup\" policy is set to restore URLs from previous sessions this policy will not clear cookies or other data relevant to restoring the previous browsing session completely.\" - Google Chrome Administrators Policy List\n\t\t\t\n    The site data must be retained for forensics purposes. If a system is compromised, it is important to have as much information available as possible to ensure that it can be determined how the system was compromised.",
      "severity": "medium"
    },
    {
      "id": "V-35764",
      "title": "Background processing must be disabled",
      "description": "\"Determines whether a Google Chrome process is started on OS login and keeps running when the last browser window is closed, allowing background apps to remain active. The background process displays an icon in the system tray and can always be closed from there. If this policy is set to True, background mode is enabled and cannot be controlled by the user in the browser settings. If this policy is set to False, background mode is disabled and cannot be controlled by the user in the browser settings. If this policy is left unset, background mode is initially disabled and can be controlled by the user in the browser settings.\" - Google Chrome Administrators Policy List\n\nThis setting, if enabled, allows Google Chrome to run at all times. There is two reasons that this is not wanted. First, it can tie up system resources that might otherwise be needed. Second, it does not make it obvious to the user that it is running and poorly written extensions could cause instability on the system.",
      "severity": "medium"
    },
    {
      "id": "V-35765",
      "title": "The SPDY protocol must be disabled",
      "description": "\"Disables use of the SPDY protocol in Google Chrome. If this policy is enabled the SPDY protocol will not be available in Google Chrome. Setting this policy to disabled will allow the usage of SPDY. If this policy is left not set, SPDY will be available.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35767",
      "title": "3D Graphics APIs must be disabled",
      "description": "\"Disable support for 3D graphics APIs. Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages can not access the WebGL API and plugins can not use the Pepper 3D API. Disabling this setting or leaving it not set potentially allows web pages to use the WebGL API and plugins to use the Pepper 3D API. The default settings of the browser may still require command line arguments to be passed in order to use these APIs.\" - Google Chrome Administrators Policy List\n\nChrome uses WebGL to render graphics using the GPU. There are few sites that currently take advantage of this feature. Since there is unlikely to be an operational impact, it is recommended that this feature is turned off in order to reduce the attack surface.",
      "severity": "medium"
    },
    {
      "id": "V-35769",
      "title": "Google Data Synchronization must be disabled",
      "description": "\"Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting. If you enable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set Google Sync will be available for the user to choose whether to use it or not.\nThis feature is used to sync information between different user devices. This data is stored on Google owned servers. The data consists of information such as email, calendars, viewing history, etc. This feature must be disabled because the organization has not control over the servers the data is stored on.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35771",
      "title": "The URL protocol schemas file and javascript must be disabled",
      "description": "\"Disables the listed protocol schemes in Google Chrome. URLs using a scheme from this list will not load and can not be navigated to. If this policy is left not set or the list is empty all schemes will be accessible in Google Chrome.\" - Google Chrome Administrators Policy List",
      "severity": "high"
    },
    {
      "id": "V-35773",
      "title": "AutoFill must be disabled",
      "description": "\"Enables Google Chrome's AutoFill feature and allows users to auto complete web forms using previously stored information such as address or credit card information. If you disable this setting, AutoFill will be inaccessible to users. If you enable this setting or do not set a value, AutoFill will remain under the control of the user. This will allow them to configure AutoFill profiles and to switch AutoFill on or off at their own discretion.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35776",
      "title": "Cloud print sharing must be disabled",
      "description": "\"Enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine. If this setting is enabled or not configured, users can enable the cloud print proxy by authentication with their Google account. If this setting is disabled, users cannot enable the proxy, and the machine will not be allowed to share it's printers with Google Cloud Print. If this policy is left not set, this will be enabled but the user will be able to change it.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35777",
      "title": "Google Chrome Instant must be disabled",
      "description": "\"Enables Google Chrome's Instant feature and prevents users from changing this setting. If you enable this setting, Google Chrome Instant is enabled. If you disable this setting, Google Chrome Instant is disabled. If you enable or disable this setting, users cannot change or override this setting. If this setting is left not set the user can decide to use this function or not.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35779",
      "title": "Network prediction must be disabled",
      "description": "\"Enables network prediction in Google Chrome and prevents users from changing this setting. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35780",
      "title": "Metrics reporting to Google must be disabled",
      "description": "\"Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting. If you enable this setting, anonymous reporting of usage and crash-related data is sent to Google. If you disable this setting, anonymous reporting of usage and crash-related data is never sent to Google. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set the setting will be what the user chose upon installation / first run.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35781",
      "title": "Search suggestions must be disabled",
      "description": "\"Search suggestion should be disabled as it could lead to searches being conducted that were never intended to be made.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35782",
      "title": "Submitting documents to Google Cloud Print must be disabled",
      "description": "\"Enables Google Chrome to submit documents to Google Cloud Print for printing. NOTE: This only affects Google Cloud Print support in Google Chrome. It does not prevent users from submitting print jobs on web sites. If this setting is enabled or not configured, users can print to Google Cloud Print from the Google Chrome print dialog. If this setting is disabled, users cannot print to Google Cloud Print from the Google Chrome print dialog\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35784",
      "title": "Importing of saved passwords must be disabled",
      "description": "\"This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog. If disabled, the saved passwords are not imported. If it is not set, the user may be asked whether to import, or importing may happen automatically.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35785",
      "title": "Incognito mode must be disabled",
      "description": "Incognito mode prevents saving of anything from the current session. This is bad from a foreignics standpoint. This information needs to be retained in case a compromise happens. \n\n\"pecifies whether the user may open pages in Incognito mode in Google Chrome. If 'Enabled' is selected or the policy is left unset, pages may be opened in Incognito mode. If 'Disabled' is selected, pages may not be opened in Incognito mode. If 'Forced' is selected, pages may be opened ONLY in Incognito mode.\n    0 = Incognito mode available.\n    1 = Incognito mode disabled.\n    2 = Incognito mode forced.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35786",
      "title": "The Chrome cache location must be set",
      "description": "\"Configures the directory that Google Chrome will use for storing cached files on the disk. If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--disk-cache-dir' flag or not. If this policy is left not set the default cache directory will be used and the user will be able to override it with the '--disk-cache-dir' command line flag.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35787",
      "title": "The user data location must be set",
      "description": "\"Configures the directory that Google Chrome will use for storing user data. If you set this policy, Google Chrome will use the provided directory regardless whether the user has specified the '--user-data-dir' flag or not. If this policy is left not set the default profile path will be used and the user will be able to override it with the '--user-data-dir' command line flag.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35788",
      "title": "Plugins must be disabled by default",
      "description": "\"Specifies a list of plugins that are disabled in Google Chrome and prevents users from changing this setting. The wildcard characters * and ? can be used to match sequences of arbitrary characters. * matches an arbitrary number of characters while ? specifies an optional single character, i.e. matches zero or one characters. The escape character is \\, so to match actual *, ?, or \\ characters, you can put a \\ in front of them. If you enable this setting, the specified list of plugins is never used in Google Chrome. The plugins are marked as disabled in about:plugins and users cannot enable them. Note that this policy can be overridden by EnabledPlugins and DisabledPluginsExceptions. If this policy is left not set the user can use any plugin installed on the system except for hard-coded incompatible, outdated or dangerous plugins. - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35789",
      "title": "Plugins approved for use must be enabled",
      "description": "\"Specifies a list of plugins that are enabled in Google Chrome and prevents users from changing this setting. The wildcard characters '*' and '?' can be used to match sequences of arbitrary characters. '*' matches an arbitrary number of characters while '?' specifies an optional single character, i.e. matches zero or one characters. The escape character is '\\', so to match actual '*', '?', or '\\' characters, you can put a '\\' in front of them. The specified list of plugins is always used in Google Chrome if they are installed. The plugins are marked as enabled in 'about:plugins' and users cannot disable them. Note that this policy overrides both DisabledPlugins and DisabledPluginsExceptions. If this policy is left not set the user can disable any plugin installed on the system.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35790",
      "title": "Automated installation of missing plugins must be disabled",
      "description": "\"If you set this setting to enabled the automatic search and installation of missing plugins will be disabled in Google Chrome.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35791",
      "title": "Online revocation checks must be done",
      "description": "\"By setting this policy to true, the previous behaviour is restored and online OCSP/CRL checks will be performed. If the policy is not set, or is set to false, then Chrome will not perform online revocation checks in Chrome 19 and later..\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35792",
      "title": "Safe Browsing must be enabled",
      "description": "\"Enables Google Chrome's Safe Browsing feature and prevents users from changing this setting. If you enable this setting, Safe Browsing is always active. If you disable this setting, Safe Browsing is never active. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it.\" - Google Chrome Administrators Policy List\n\nSafe browsing uses a signature database to test sites when they are be loaded to ensure they don't contain any known maleware.",
      "severity": "medium"
    },
    {
      "id": "V-35793",
      "title": "Browser history must be saved",
      "description": "\"Disables saving browser history in Google Chrome and prevents users from changing this setting. If this setting is enabled, browsing history is not saved. If this setting is disabled or not set, browsing history is saved.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35794",
      "title": "Default behavior must block plugin usage",
      "description": "\"Allows you to set whether websites are allowed to automatically run plugins. Automatically running plugins can be either allowed for all websites or denied for all websites. If this policy is left not set, 'AllowPlugins' will be used and the user will be able to change it.\n    1 = Allow all sites to automatically run plugins\n    2 = Block all plugins.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35795",
      "title": "JavaScript must be disabled by default",
      "description": "\"Allows you to set a list of url patterns that specify sites which are not allowed to run JavaScript. If this policy is left not set the global default value will be used for all sites either from the 'DefaultJavaScriptSetting' policy if it is set, or the user's personal configuration otherwise.\" - Google Chrome Administrators Policy List\n\nJavascript is one of the most common attack vectors used to compromise a system. Therefore, a system should block javascript by default and allow by exception.",
      "severity": "medium"
    },
    {
      "id": "V-35796",
      "title": "JavaScript must be enabled for approved domains",
      "description": "\"Allows you to set a list of url patterns that specify sites which are allowed to run JavaScript. If this policy is left not set the global default value will be used for all sites either from the 'DefaultJavaScriptSetting' policy if it is set, or the user's personal configuration otherwise..\" - Google Chrome Administrators Policy List\n\nJavascript is one of the most common attack vectors used to compromise a system, as such all sites should be blocked by default. Only trusted sites should be whitelisted.",
      "severity": "medium"
    },
    {
      "id": "V-35797",
      "title": "Plugin usage must be disabled by default",
      "description": "\"Allows you to set a list of url patterns that specify sites which are not allowed to run plugins. If this policy is left not set the global default value will be used for all sites either from the 'DefaultPluginsSetting' policy if it is set, or the user's personal configuration otherwise.",
      "severity": "medium"
    },
    {
      "id": "V-35798",
      "title": "Sites that are approved to use approved plugins must be whitelisted",
      "description": "Allows you to set a list of url patterns that specify sites which are allowed to run plugins. If this policy is left not set the global default value will be used for all sites either from the 'DefaultPluginsSetting' policy if it is set, or the user's personal configuration otherwise.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    },
    {
      "id": "V-35799",
      "title": "Session only based cookies must be disabled",
      "description": "\"Allows you to set a list of url patterns that specify sites which are allowed to set session only cookies. If this policy is left not set the global default value will be used for all sites either from the 'DefaultCookiesSetting' policy if it is set, or the user's personal configuration otherwise. If the \"RestoreOnStartup\" policy is set to restore URLs from previous sessions this policy will not be respected and cookies will be stored permanently for those sites.\" - Google Chrome Administrators Policy List",
      "severity": "medium"
    }
  ]
}