{
  "name": "google_chrome_browser",
  "date": "2017-06-20",
  "description": "The Google Chrome Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil",
  "title": "Google Chrome Browser STIG",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-44711",
      "title": "Firewall traversal from remote host must be disabled.",
      "description": "Remote connections should never be allowed that bypass the firewall, as there is no way to verify if they can be trusted. Enables usage of STUN and relay servers when remote clients are trying to establish a connection to this machine. If this setting is enabled, then remote clients can discover and connect to this machine even if they are separated by a firewall. If this setting is disabled and outgoing UDP connections are filtered by the firewall, then this machine will only allow connections from client machines within the local network. If this policy is left not set the setting will be enabled.\t",
      "severity": "medium"
    },
    {
      "id": "V-44713",
      "title": "Sites ability for showing desktop notifications must be disabled.",
      "description": "Chrome by default allows websites to display notifications on the desktop.  This check allows you to set whether or not this is permitted.  Displaying desktop notifications can be allowed by default, denied by default or the user can be asked every time a website wants to show desktop notifications. If this policy is left not set, 'AskNotifications' will be used and the user will be able to change it.    \n   1 = Allow sites to show desktop notifications    \n   2 = Do not allow any site to show desktop notifications    \n   3 = Ask every time a site wants to show desktop notifications\n",
      "severity": "low"
    },
    {
      "id": "V-44719",
      "title": "Sites ability to show pop-ups must be disabled.",
      "description": "Chrome allows you to manage whether unwanted pop-up windows appear. Pop-up windows that are opened when the end user clicks a link are not blocked. If you enable this policy setting, most unwanted pop-up windows are prevented from appearing. If you disable this policy setting, pop-up windows are not prevented from appearing. If you disable this policy setting, scripts can continue to create pop-up windows, and pop-ups that hide other windows. Recommend configuring this setting to ‘2’ to help prevent malicious websites from controlling the pop-up windows or fooling users into clicking on the wrong window.  If you do not configure this policy setting, most unwanted pop-up windows are prevented from appearing.  If this policy is left not set, 'BlockPopups' will be used and the user will be able to change it.    \n   1 = Allow all sites to show pop-ups    \n   2 = Do not allow any site to show pop-ups\n",
      "severity": "medium"
    },
    {
      "id": "V-44723",
      "title": "Site tracking users location must be disabled.",
      "description": "Website tracking is the practice of gathering information as to which websites were accesses by a browser. The common method of doing this is to have a website create a tracking cookie on the browser.   If the information of what sites are being accessed is made available to unauthorized persons, this violates confidentiality requirements, and over time poses a significant OPSEC issue. This policy setting allows you to set whether websites are allowed to track the user’s physical location. Tracking the user’s physical location can be allowed by default, denied by default or the user can be asked every time a website requests the physical location.\t\n   1 = Allow sites to track the user’s physical location\t\n   2 = Do not allow any site to track the user’s physical location\t\n   3 = Ask whenever a site wants to track the user’s physical location\n",
      "severity": "medium"
    },
    {
      "id": "V-44727",
      "title": "Extensions installation must be blacklisted by default.",
      "description": "Extensions are developed by third party sources and are designed to extend Google Chrome's functionality. An extension can be made by anyone, to do and access almost anything on a system; this means they pose a high risk to any system that would allow all extensions to be installed by default.  Allows you to specify which extensions the users can NOT install. Extensions already installed will be removed if blacklisted. A blacklist value of '*' means all extensions are blacklisted unless they are explicitly listed in the whitelist. If this policy is left not set the user can install any extension in Google Chrome.",
      "severity": "medium"
    },
    {
      "id": "V-44729",
      "title": "Extensions that are approved for use must be whitelisted.\n",
      "description": "The whitelist should only contain organizationally approved extensions. This is to prevent a user from accidently whitelisitng a malicious extension. This policy allows you to specify which extensions are not subject to the blacklist. A blacklist value of ‘*’ means all extensions are blacklisted and users can only install extensions listed in the whitelist. By default, no extensions are whitelisted. If all extensions have been blacklisted by policy, then the whitelist policy can be used to allow specific extensions to be installed. Administrators should determine which extensions should be allowed to be installed by their users. If no extensions are whitelisted, then no extensions can be installed when combined with blacklisting all extensions.",
      "severity": "medium"
    },
    {
      "id": "V-44733",
      "title": "The default search providers name must be set.",
      "description": "Specifies the name of the default search provider that is to be used, if left empty or not set, the host name specified by the search URL will be used. This policy is only considered if the 'DefaultSearchProviderEnabled' policy is enabled. When doing internet searches it is important to use an encrypted connection via https.",
      "severity": "medium"
    },
    {
      "id": "V-44735",
      "title": "The default search provider URL must be set to perform encrypted searches.\n",
      "description": "Specifies the URL of the search engine used when doing a default search. The URL should contain the string '{searchTerms}', which will be replaced at query time by the terms the user is searching for. This option must be set when the 'DefaultSearchProviderEnabled' policy is enabled and will only be respected if this is the case.  When doing internet searches it is important to use an encrypted connection via https.",
      "severity": "medium"
    },
    {
      "id": "V-44737",
      "title": "Default search provider must be enabled.",
      "description": "Policy enables the use of a default search provider. If you enable this setting, a default search is performed when the user types text in the omnibox that is not a URL. You can specify the default search provider to be used by setting the rest of the default search policies. If these are left empty, the user can choose the default provider. If you disable this setting, no search is performed when the user enters non-URL text in the omnibox. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, the default search provider is enabled, and the user will be able to set the search provider list.",
      "severity": "medium"
    },
    {
      "id": "V-44741",
      "title": "The Password Manager must be disabled.",
      "description": "Enables saving passwords and using saved passwords in Google Chrome. Malicious sites may take advantage of this feature by using hidden fields gain access to the stored information. If you enable this setting, users can have Google Chrome memorize passwords and provide them automatically the next time they log in to a site. If you disable this setting, users are not able to save passwords or use already saved passwords. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it. ListPassword manager should not be used as it stores passwords locally.",
      "severity": "medium"
    },
    {
      "id": "V-44745",
      "title": "The running of outdated plugins must be disabled.",
      "description": "Running outdated plugins could lead to system compromise through the use of known exploits. Having plugins that updated to the most current version ensures the smallest attack surfuce possible. If you enable this setting, outdated plugins are used as normal plugins. If you disable this setting, outdated plugins will not be used and users will not be asked for permission to run them. If this setting is not set, users will be asked for permission to run outdated plugins.",
      "severity": "high"
    },
    {
      "id": "V-44749",
      "title": "Plugins requiring authorization must ask for user permission.",
      "description": "Policy allows Google Chrome to run plugins that require authorization. If you enable this setting, plugins that are not outdated will always run. If this setting is disabled or not set, users will be not be asked for permission to run plugins that require authorization. These are plugins that can compromise security.",
      "severity": "high"
    },
    {
      "id": "V-44751",
      "title": "Third party cookies must be blocked.",
      "description": "Third party cookies are cookies which can be set by web page elements that are not from the domain that is in the browser's address bar. Enabling this setting prevents cookies from being set by web page elements that are not from the domain that is in the browser's address bar. Disabling this setting allows cookies to be set by web page elements that are not from the domain that is in the browser's address bar and prevents users from changing this setting. If this policy is left not set, third party cookies will be enabled but the user will be able to change that.",
      "severity": "low"
    },
    {
      "id": "V-44753",
      "title": "Background processing must be disabled.",
      "description": "Determines whether a Google Chrome process is started on OS login that keeps running when the last browser window is closed, allowing background apps to remain active. The background process displays an icon in the system tray and can always be closed from there. If this policy is set to True, background mode is enabled and cannot be controlled by the user in the browser settings. If this policy is set to False, background mode is disabled and cannot be controlled by the user in the browser settings. If this policy is left unset, background mode is initially disabled and can be controlled by the user in the browser settings.' - Google Chrome Administrators Policy ListThis setting, if enabled, allows Google Chrome to run at all times. There is two reasons that this is not wanted. First, it can tie up system resources that might otherwise be needed. Second, it does not make it obvious to the user that it is running and poorly written extensions could cause instability on the system.",
      "severity": "medium"
    },
    {
      "id": "V-44757",
      "title": "3D Graphics APIs must be disabled.",
      "description": "Disable support for 3D graphics APIs. Enabling this setting prevents web pages from accessing the graphics processing unit (GPU). Specifically, web pages cannot access the WebGL API and plugins cannot use the Pepper 3D API. Disabling this setting or leaving it not set potentially allows web pages to use the WebGL API and plugins to use the Pepper 3D API. The default settings of the browser may still require command line arguments to be passed in order to use these APIs. Chrome uses WebGL to render graphics using the GPU. There are few sites that currently take advantage of this feature. Since there is unlikely to be an operational impact, it is recommended that this feature is turned off in order to reduce the attack surface.",
      "severity": "medium"
    },
    {
      "id": "V-44759",
      "title": "Google Data Synchronization must be disabled.",
      "description": "Disables data synchronization in Google Chrome using Google-hosted synchronization services and prevents users from changing this setting. If you enable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set the user will be able to enable Google Sync.  Google Sync is used to sync information between different user devices, this data is then stored on Google owned servers. The synced data may consist of information such as email, calendars, viewing history, etc. This feature must be disabled because the organization does not have control over the servers the data is stored on.",
      "severity": "medium"
    },
    {
      "id": "V-44761",
      "title": "The URL protocol schema javascript must be disabled.",
      "description": "Each access to a URL is handled by the browser according to the URL's \"scheme\". The \"scheme\" of a URL is the section before the \":\". The term \"protocol\" is often mistakenly used for a \"scheme\". The difference is that the scheme is how the browser handles a URL and the protocol is how the browser communicates with a service.  If a scheme or its associated protocol used by a browser is insecure or obsolete, vulnerabilities can be exploited resulting in exposed data or unrestricted access to the browser's system.   The browser must be configured to disable the use of insecure and obsolete schemas (protocols).\nThis policy disables the listed protocol schemes in Google Chrome, URLs using a scheme from this list will not load and cannot be navigated to. If this policy is left not set or the list is empty all schemes will be accessible in Google Chrome.\n",
      "severity": "medium"
    },
    {
      "id": "V-44763",
      "title": "AutoFill must be disabled.",
      "description": "This AutoComplete feature suggests possible matches when users are filling in forms. It is possible that this feature will cache sensitive data and store it in the user's profile, where it might not be protected as rigorously as required by organizational policy. If you enable this setting or do not set a value, AutoFill will remain under the control of the user. This will allow them to configure AutoFill profiles and to switch AutoFill on or off at their own discretion.",
      "severity": "medium"
    },
    {
      "id": "V-44765",
      "title": "Cloud print sharing must be disabled.",
      "description": "Policy enables Google Chrome to act as a proxy between Google Cloud Print and legacy printers connected to the machine. If this setting is enabled or not configured, users can enable the cloud print proxy by authentication with their Google account. If this setting is disabled, users cannot enable the proxy, and the machine will not be allowed to share it’s printers with Google Cloud Print. If this policy is not set, this will be enabled but the user will be able to change it.",
      "severity": "medium"
    },
    {
      "id": "V-44769",
      "title": "Network prediction must be disabled.",
      "description": "Disables network prediction in Google Chrome and prevents users from changing this setting. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it.",
      "severity": "medium"
    },
    {
      "id": "V-44771",
      "title": "Metrics reporting to Google must be disabled.",
      "description": "Enables anonymous reporting of usage and crash-related data about Google Chrome to Google and prevents users from changing this setting. If you enable this setting, anonymous reporting of usage and crash-related data is sent to Google. A crash report could contain sensitive information from the computer's memory. If you disable this setting, anonymous reporting of usage and crash-related data is never sent to Google. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set the setting will be what the user chose upon installation / first run.",
      "severity": "medium"
    },
    {
      "id": "V-44773",
      "title": "Search suggestions must be disabled.",
      "description": "Search suggestion should be disabled as it could lead to searches being conducted that were never intended to be made. Enables search suggestions in Google Chrome's omnibox and prevents users from changing this setting. If you enable this setting, search suggestions are used. If you disable this setting, search suggestions are never used. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it.",
      "severity": "medium"
    },
    {
      "id": "V-44775",
      "title": "Importing of saved passwords must be disabled.",
      "description": "Importing of saved passwords should be disabled as it could lead to unencrypted account passwords stored on the system from another browser to be viewed. This policy forces the saved passwords to be imported from the previous default browser if enabled. If enabled, this policy also affects the import dialog. If disabled, the saved passwords are not imported. If it is not set, the user may be asked whether to import, or importing may happen automatically.",
      "severity": "medium"
    },
    {
      "id": "V-44777",
      "title": "Incognito mode must be disabled.",
      "description": "Incognito mode allows the user to browse the Internet without recording their browsing history/activity.  From a forensics perspective, this is unacceptable.  Best practice requires that browser history is retained.  The \"IncognitoModeAvailability\" setting controls whether the user may utilize Incognito mode in Google Chrome. If 'Enabled' is selected or the policy is left unset, pages may be opened in Incognito mode. If 'Disabled' is selected, pages may not be opened in Incognito mode. If 'Forced' is selected, pages may be opened ONLY in Incognito mode.   \n   0 = Incognito mode available.    \n   1 = Incognito mode disabled.    \n   2 = Incognito mode forced.",
      "severity": "medium"
    },
    {
      "id": "V-44787",
      "title": "Automated installation of missing plugins must be disabled.",
      "description": "The automatic search and installation of missing or not installed plugins should be disabled as this can cause significant risk if a unapproved or vulnerable plugin were to be installed without proper permissions or authorization. If you set this setting to enabled the automatic search and installation of missing plugins will be disabled in Google Chrome.",
      "severity": "medium"
    },
    {
      "id": "V-44789",
      "title": "Online revocation checks must be done.",
      "description": "By setting this policy to true, the previous behavior is restored and online OCSP/CRL checks will be performed. If the policy is not set, or is set to false, then Chrome will not perform online revocation checks. Certificates are revoked when they have been compromised or are no longer valid, and this option protects users from submitting confidential data to a site that may be fraudulent or not secure.",
      "severity": "medium"
    },
    {
      "id": "V-44791",
      "title": "Safe Browsing must be enabled,",
      "description": "Enables Google Chrome's Safe Browsing feature and prevents users from changing this setting. If you enable this setting, Safe Browsing is always active. If you disable this setting, Safe Browsing is never active. If you enable or disable this setting, users cannot change or override this setting in Google Chrome. If this policy is left not set, this will be enabled but the user will be able to change it. Safe browsing uses a signature database to test sites when they are be loaded to ensure they don't contain any known malware.",
      "severity": "medium"
    },
    {
      "id": "V-44793",
      "title": "Browser history must be saved.",
      "description": "This policy disables saving browser history in Google Chrome and prevents users from changing this setting. If this setting is enabled, browsing history is not saved. If this setting is disabled or not set, browsing history is saved.",
      "severity": "medium"
    },
    {
      "id": "V-44795",
      "title": "Default behavior must block webpages from automatically running plugins.",
      "description": "This policy allows you to set whether websites are allowed to automatically run plugins. Automatically running plugins can be either allowed for all websites or denied for all websites. If this policy is left not set, 'AllowPlugins' will be used and the user will be able to change it.    \n   1 = Allow all sites to automatically run plugins    \n   2 = Block all plugins    \n   3 = Click to play.\n",
      "severity": "medium"
    },
    {
      "id": "V-44799",
      "title": "Session only based cookies must be disabled.",
      "description": "Policy allows you to set a list of URL patterns that specify sites which are allowed to set session only cookies. If this policy is left not set the global default value will be used for all sites either from the 'DefaultCookiesSetting' policy if it is set, or the user's personal configuration otherwise. If the 'RestoreOnStartup' policy is set to restore URLs from previous sessions this policy will not be respected and cookies will be stored permanently for those sites.",
      "severity": "medium"
    },
    {
      "id": "V-44805",
      "title": "Browser must support auto-updates.",
      "description": "One of the most effective defenses against exploitation of browser vulnerabilities is to ensure the version of the browser is current.   Frequent updates provide corrections to discovered vulnerabilities and the timely update reduces the window for zero day attacks.   Automatic installation of updates and patches is the most effective method for keeping the browser software current.  The browser must have the capability to install software updates and patches automatically. ",
      "severity": "medium"
    },
    {
      "id": "V-52795",
      "title": "URLs must be whitelisted for plugin use",
      "description": "This policy allows you to set a list of URL patterns that specify sites which are allowed to run plugins. If this policy is not set, plugins could be run from any website, including potentially malicious ones.",
      "severity": "medium"
    },
    {
      "id": "V-75165",
      "title": "Access to history URL must be disabled.",
      "description": "Regardless of controls in place to safeguard the Chrome browser history users may still delete individual items via the Chrome://History URL.  In order to protect against this occurrence access to Chrome://History must be blacklisted.",
      "severity": "medium"
    }
  ]
}