{
  "name": "mcafee_application_control_7.x",
  "date": "2018-01-03",
  "description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.",
  "title": "McAfee Application Control 7.x Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-74175",
      "title": "A McAfee Application Control written policy must be documented to outline the organization-specific variables for application whitelisting.",
      "description": "Enabling application whitelisting without adequate design and organization-specific requirements will either result in an implementation which is too relaxed or an implementation which causes denial of service to its user community. Documenting the specific requirements and trust model before configuring and deploying the McAfee Application Control software is mandatory.",
      "severity": "medium"
    },
    {
      "id": "V-74195",
      "title": "The Solidcore client Command Line Interface (CLI) Access Password protection process must be documented in the organizations written policy.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nSince the McAfee Application Control configuration is to be managed by ePO policies, allowing enablement of the CLI to would introduce the capability of local configuration changes. \n\nStrict management of the accessibility of the CLI is necessary in order to prevent its misuse.\n\nThe misuse of the CLI would open the system up to the possible configuration changes potentially allowing malicious applications to execute unknowingly.",
      "severity": "medium"
    },
    {
      "id": "V-74197",
      "title": "The requirement for scheduled Solidcore client Command Line Interface (CLI) Access Password changes must be documented in the organizations written policy.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nThe misuse of the CLI would open the system up to the possible configuration, allowing malicious applications to execute unknowingly. Strict management of the accessibility of the CLI is necessary in order to prevent its misuse.",
      "severity": "medium"
    },
    {
      "id": "V-74199",
      "title": "The process by which the Solidcore client Command Line Interface (CLI) Access Password is made available to administrators when needed must be documented in the organizations written policy.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nSince the McAfee Application Control configuration is to be managed by ePO policies, allowing enablement of the CLI to would introduce the capability of local configuration changes. \n\nStrict management of the accessibility of the CLI is necessary in order to prevent its misuse.\n\nThe misuse of the CLI would open the system up to the possible configuration changes potentially allowing malicious applications to execute unknowingly.",
      "severity": "medium"
    },
    {
      "id": "V-74201",
      "title": "The McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be confined to the organizations enclave.",
      "description": "Data will be leaving the endpoint to be analyzed by the ATD. Because data could feasibly be intercepted en route, risk of outside threats is minimized by ensuring the ATD is in the same enclave as the endpoints.",
      "severity": "medium"
    },
    {
      "id": "V-74203",
      "title": "The configuration of features under McAfee Application Control Options policies Enforce feature control must be documented in the organizations written policy.",
      "description": "By default, the McAfee Application Control prevents installation of ActiveX controls on endpoints, enforces memory protection techniques on endpoints, and prevents MSI-installers from running on endpoints. The Feature Control allows for those safeguards to be bypassed and in doing so renders the McAfee Application Control less effective.",
      "severity": "medium"
    },
    {
      "id": "V-74205",
      "title": "The organizations written policy must include a process for how whitelisted applications are deemed to be allowed.",
      "description": "Enabling application whitelisting without adequate design and organization-specific requirements will either result in an implementation which is too relaxed or an implementation which causes denial of service to its user community. Documenting the specific requirements and trust model before configuring and deploying the McAfee Application Control software is mandatory.",
      "severity": "medium"
    },
    {
      "id": "V-74207",
      "title": "The organizations written policy must include procedures for how often the whitelist of allowed applications is reviewed.",
      "description": "Enabling application whitelisting without adequate design and organization-specific requirements will either result in an implementation which is too relaxed or an implementation which causes denial of service to its user community. Documenting the specific requirements and trust model before configuring and deploying the McAfee Application Control software is mandatory.",
      "severity": "medium"
    },
    {
      "id": "V-74209",
      "title": "The Solidcore client must be enabled.",
      "description": "The Application Control whitelisting must be enabled on all workstation endpoints. To enable Application Control, the Solidcore client needs to be in enabled mode.",
      "severity": "medium"
    },
    {
      "id": "V-74211",
      "title": "The Solidcore client Command Line Interface (CLI) must be in lockdown mode.",
      "description": "By default, when an endpoint's Solidcore installation is managed by the ePO server, the CLI will automatically be in lockdown mode. This will ensure the endpoint receives all of its Solidcore configuration settings from the ePO server. The CLI can, however, be activated for troubleshooting efforts during which time the ePO settings will not be enforced. Leaving the CLI in an allowed status will prevent the endpoint from receiving changes from the ePO server for the Solidcore client.",
      "severity": "high"
    },
    {
      "id": "V-74213",
      "title": "The Solidcore client Command Line Interface (CLI) Access Password must be changed from the default.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nSince the McAfee Application Control configuration is to be managed by ePO policies, allowing enablement of the CLI to would introduce the capability of local configuration changes. \n\nStrict management of the accessibility of the CLI is necessary in order to prevent its misuse.\n\nThe misuse of the CLI would open the system up to the possible configuration changes potentially allowing malicious applications to execute unknowingly.",
      "severity": "high"
    },
    {
      "id": "V-74215",
      "title": "The organization-specific Rules policy must only include executable and dll files that are associated with applications as allowed by the organizations written policy.",
      "description": "To ensure Solidcore clients are only configured to STIG and organization-specific settings, organization-specific ePO policies must be applied to all organization workstation endpoints.\n\nThe McAfee Application Control installs with two Default Rules policies.\n\nThe McAfee Default Rules policy includes the whitelist for commonly used applications to the platform.\n\nThe McAfee Applications Default Rules policy include the whitelist for McAfee applications.\n\nBoth of these policies are at the \"My Organization\" level of the System Tree and must be inherited by all branches of the System Tree.\n\nOrganization-specific applications would be whitelisted with an organization-specific policy combined with the two Default policies into one effective policy.",
      "severity": "medium"
    },
    {
      "id": "V-74217",
      "title": "The McAfee Application Control Options Reputation setting must be configured to use the McAfee Global Threat Intelligence (McAfee GTI) option.",
      "description": "If a Threat Intelligence Exchange (TIE) server is being used in the organization, reputation for files and certificates is fetched from the TIE server. The reputation values control execution at endpoints and are displayed on the Application Control pages on the McAfee ePO console.\n\nIf the GTI is being used, reputation for files and certificates is fetched from the McAfee GTI.\n\nFor both methods, the administrator can review the reputation values and make informed decisions for inventory items in the enterprise.",
      "severity": "medium"
    },
    {
      "id": "V-74219",
      "title": "The use of a Solidcore 7.x local Command Line Interface (CLI) Access Password must be documented in the organizations written policy.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nSince the McAfee Application Control configuration is to be managed by ePO policies, allowing enablement of the CLI to would introduce the capability of local configuration changes. \n\nStrict management of the accessibility of the CLI is necessary in order to prevent its misuse.\n\nThe misuse of the CLI would open the system up to the possible configuration changes potentially allowing malicious applications to execute unknowingly.",
      "severity": "medium"
    },
    {
      "id": "V-74221",
      "title": "The Solidcore client Command Line Interface (CLI) Access password complexity requirements must be documented in the organizations written policy.",
      "description": "The Solidcore client can be configured locally at the CLI, but only when accessed with the required password.\n\nThe misuse of the CLI would open the system up to the possible configuration, allowing malicious applications to execute unknowingly. Strict management of the accessibility of the CLI is necessary in order to prevent its misuse.",
      "severity": "medium"
    },
    {
      "id": "V-74223",
      "title": "The McAfee Application Control Options Reputation-Based Execution settings, if enabled, must be configured to allow Most Likely Trusted or Known Trusted only.",
      "description": "When a file is executed on an endpoint, the Application Control performs multiple checks to determine whether to allow or ban the execution. Only files with a reputation of \"Most Likely Trusted\", \"Known Trusted\" or \"Might be Trusted\" are considered to be allowed. By configuring the setting to only \"Most Likely Trusted\" or \"Known Trusted\", the files with a reputation of \"Might be Trusted\" are blocked. While this may impact operationally in the beginning, after the inventories are vetted by the administrators, files with a \"Might be Trusted\" value may be recategorized in that organization.",
      "severity": "medium"
    },
    {
      "id": "V-74225",
      "title": "The McAfee Application Control Options Advanced Threat Defense (ATD) settings must not be enabled unless an internal ATD is maintained by the organization.",
      "description": "This option will automatically send files with a specific file reputation to ATD for further analysis. This option is not selected by default and must only be selected if an ATD is being used.",
      "severity": "medium"
    },
    {
      "id": "V-74227",
      "title": "The McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be configured to send all binaries with a reputation of Might be Trusted and below for analysis.",
      "description": "When the file reputation of \"Might be Trusted\" is configured for being forwarded to ATD, all files with the reputation of \"Might be Trusted\", \"Unknown\", \"Might be Malicious\", \"Most Likely Malicious\" and \"Known Malicious\" are forwarded to the ATD.\n\nThe files with \"Might be Trusted\" reputation may be redesignated as \"Trusted\" after analysis.",
      "severity": "medium"
    },
    {
      "id": "V-74229",
      "title": "The McAfee Application Control Options Advanced Threat Defense (ATD) settings, if being used, must be configured to only send binaries with a size of 5 MB or less.",
      "description": "Since binaries can be large, the file size must be limited to avoid congestion on the network and degradation on the endpoint when sending the binaries to the ATD.",
      "severity": "medium"
    },
    {
      "id": "V-74231",
      "title": "Organization-specific McAfee Applications Control Options policies must be created and applied to all endpoints.",
      "description": "To ensure Solidcore clients are only configured to STIG and organization-specific settings, organization-specific ePO policies must be applied to all organization workstation endpoints rather than resorting to the McAfee Applications Control (Default) policy.",
      "severity": "medium"
    },
    {
      "id": "V-74233",
      "title": "The McAfee Application Control Options policy must be configured to disable Self-Approval.",
      "description": "The McAfee Application Control Self-Approval feature allows the user to take an action when a user tries to run a new or unknown application.",
      "severity": "medium"
    },
    {
      "id": "V-74235",
      "title": "The McAfee Application Control Options policy End User Notification, if configured by organization, must have all default variables replaced with the organization-specific data.",
      "description": "The \"User Message\" option will show a dialog box when an event is detected and display the organization-specified text in the message.",
      "severity": "medium"
    },
    {
      "id": "V-74237",
      "title": "The McAfee Application Control Options policies Enforce feature control memory protection must be enabled.",
      "description": "By default, the McAfee Application Control prevents installation of ActiveX controls on endpoints, enforces memory protection techniques on endpoints, and prevents MSI-installers from running on endpoints. The Feature Control allows for those safeguards to be bypassed and in doing so renders the McAfee Application Control less effective.",
      "severity": "medium"
    },
    {
      "id": "V-74239",
      "title": "Enabled features under McAfee Application Control Options policies Enforce feature control must not be configured unless documented in written policy and approved by ISSO/ISSM.",
      "description": "By default, the McAfee Application Control prevents installation of ActiveX controls on endpoints, enforces memory protection techniques on endpoints, and prevents MSI-installers from running on endpoints. The \"Feature Control\" allows for those safeguards to be bypassed and in doing so renders the McAfee Application Control less effective.",
      "severity": "medium"
    },
    {
      "id": "V-74241",
      "title": "The McAfee Application Control Options Inventory option must be configured to hide OS Files.",
      "description": "By default, the Windows operating system files are excluded from the inventory. By selecting this option, the overwhelming the inventory with legitimate Windows Files in the <system drive>\\Windows folder which are signed by the Microsoft certificate and all files in the <system drive>\\Windows\\winsxs folder will not be included in the inventory.",
      "severity": "medium"
    },
    {
      "id": "V-74243",
      "title": "The McAfee Application Control Options Inventory interval option must be configured to pull inventory from endpoints on a regular basis not to exceed seven days.",
      "description": "When McAfee Application Control is deployed on a system, it creates a whitelist of all executable binaries and scripts present on the system. The whitelist contains all authorized files, and only files that are present in the whitelist are allowed to execute. An executable binary, script, or process that is not in the whitelist is said to be unauthorized and is prevented from running.  McAfee Application Control uses a centralized repository of trusted applications and dynamic whitelisting to reduce manual maintenance effort.\nRunning frequent Pull Inventory tasks ensures inventory information does not become stale. There must be the minimum interval between consecutive inventory pull runs (when the inventory information is fetched from the endpoints). By default, this value is 7 days and is the recommended setting. Pulling at an interval of greater than 7 days will allow for the inventory of endpoints to become stale.\n",
      "severity": "medium"
    },
    {
      "id": "V-74247",
      "title": "The McAfee Applications Default Rules policy must be part of the effective rules policy applied to every endpoint.",
      "description": "To ensure Solidcore clients are only configured to STIG and organization-specific settings, organization-specific ePO policies must be applied to all organization workstation endpoints.\n\nThe McAfee Application Control installs with two Default Rules policies.\n\nThe McAfee Default Rules policy includes the whitelist for commonly used applications to the platform.\n\nThe McAfee Applications Default Rules policy include the whitelist for McAfee applications.\n\nBoth of these policies are at the \"My Organization\" level of the System Tree and must be inherited by all branches of the System Tree.\n\nOrganization-specific applications would be whitelisted with an organization-specific policy combined with the two Default policies into one effective policy.",
      "severity": "medium"
    },
    {
      "id": "V-74249",
      "title": "A copy of the McAfee Default Rules policy must be part of the effective rules policy applied to every endpoint.",
      "description": "To ensure Solidcore clients are only configured to STIG and organization-specific settings, an organization-specific ePO policies must be applied to all organization workstation endpoints.\n\nThe McAfee Application Control installs with two Default Rules policies.\n\nThe McAfee Default Rules policy includes the whitelist for commonly used applications to the platform.\n\nThe McAfee Applications Default Rules policy include the whitelist for McAfee applications.\n\nBoth of these policies are at the My Organization level of the System Tree and must be inherited by all branches of the System Tree.\n\nOrganization-specific applications would be whitelisted with an organization-specific policy combined with the two Default policies into one effective policy.",
      "severity": "medium"
    },
    {
      "id": "V-74251",
      "title": "The organization-specific Rules policies must be part of the effective rules policy applied to all endpoints.",
      "description": "To ensure Solidcore clients are only configured to STIG and organization-specific settings, an organization-specific ePO policies must be applied to all organization workstation endpoints.\n\nThe McAfee Application Control installs with two Default Rules policies. \n\nThe McAfee Default Rules policy includes the whitelist for commonly used applications to the platform.\n\nThe McAfee Applications Default Rules policy include the whitelist for McAfee applications.\n\nBoth of these policies are at the \"My Organization\" level of the System Tree and must be inherited by all branches of the System Tree.\n\nOrganization-specific applications would be whitelisted with an organization-specific policy combined with the two Default policies into one effective policy.",
      "severity": "medium"
    },
    {
      "id": "V-74253",
      "title": "The organization-specific Solidcore Client Policies must be created and applied to all endpoints.",
      "description": "McAfee Application Control is deployed with default policies. To ensure the default policies are not used and that an organization knowingly configures their systems to their own configuration requirements, organization-specific policies will need to be created.",
      "severity": "medium"
    },
    {
      "id": "V-74255",
      "title": "The Throttling settings must be enabled and configured to settings according to organizations requirements.",
      "description": "The throttling settings regulate the data flow between the clients and McAfee ePO. The value for each category defines the number of entries that will be sent to the McAfee ePO daily. Clients start caching for the defined category when the specified threshold value is reached. After the cache is full, new data for that category is dropped and not sent to the McAfee ePO. As such, settings must be high enough to allow for all data to reach the McAfee ePO.",
      "severity": "medium"
    },
    {
      "id": "V-74257",
      "title": "The Solidcore Client Exception Rules must be documented in the organizations written policy.",
      "description": "When exceptions are created for applications, it results in potential attack vectors. As such, exceptions should only be created with a full approval by the local ISSO/ISSM. The organization's entire written policy requires approval by the ISSO/ISSM/AO and is required to be under CAB/CCB oversight.",
      "severity": "medium"
    }
  ]
}