{
  "name": "microsoft_infopath_2007",
  "date": "2015-10-02",
  "description": "None",
  "title": "Microsoft InfoPath 2007 ",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-17173",
      "title": "Disable user name and password syntax from being used in URLs",
      "description": "The Uniform Resource Locator (URL) standard allows user authentication to be included in URL strings in the form http://username:password@example.com. A malicious user might use this URL syntax to create a hyperlink that appears to open a legitimate website but actually opens a deceptive (spoofed) website. For example, the URL http://www.wingtiptoys.com@example.com appears to open http://www.wingtiptoys.com but actually opens http://example.com. To protect users from such attacks, Internet Explorer usually blocks any URLs using this syntax.\n\nThis functionality can be controlled separately for instances of Internet Explorer spawned by 2007 Office applications (for example, if a user clicks a link in an Office document or selects a menu option that loads a web page). If user names and passwords in URLs are allowed, users could be diverted to dangerous web pages, which could pose a security risk.\n",
      "severity": "medium"
    },
    {
      "id": "V-17174",
      "title": "Enable IE Bind to Object functionality for instances of IE launched from InfoPath.",
      "description": "Internet Explorer performs a number of safety checks before initializing an ActiveX control. It will not initialize a control if the kill bit for the control is set in the registry, or if the security settings for the zone in which the control is located do not allow it to be initialized.\n\nThis functionality can be controlled separately for instances of Internet Explorer spawned by 2007 Office applications (for example, if a user clicks a link in an Office document or selects a menu option that loads a web page). A security risk could occur if potentially dangerous controls are allowed to load.\n",
      "severity": "medium"
    },
    {
      "id": "V-17175",
      "title": "Evaluate Saved from URL mark when launched from InfoPath.",
      "description": "Typically, when Internet Explorer loads a web page from a UNC share that contains a Mark of the Web (MOTW) comment that indicates the page was saved from a site on the Internet, Internet Explorer runs the page in the Internet security zone instead of the less restrictive Local Intranet security zone. This functionality can be controlled separately for instances of Internet Explorer spawned by 2007 Office applications (for example, if a user clicks a link in an Office document or selects a menu option that loads a web page). If Internet Explorer does not evaluate the page for a MOTW, potentially dangerous code could be allowed to run.",
      "severity": "medium"
    },
    {
      "id": "V-17183",
      "title": "Block navigation to URL embedded in Office products to protect against attack by malformed URL. ",
      "description": "To protect users from attacks, Internet Explorer usually does not attempt to load malformed URLs. This functionality can be controlled separately for instances of Internet Explorer spawned by 2007 Office applications (for example, if a user clicks a link in an Office document or selects a menu option that loads a web page). If Internet Explorer attempts to load a malformed URL, a security risk could occur in some cases.",
      "severity": "medium"
    },
    {
      "id": "V-17184",
      "title": "Block pop-ups for links that invoke instances of IE from within InfoPath.",
      "description": "The Pop-up Blocker feature in Internet Explorer can be used to block most unwanted pop-up and pop-under windows from appearing. This functionality can be controlled separately for instances of Internet Explorer spawned by 2007 Office applications (for example, if a user clicks a link in an Office document or selects a menu option that loads a web page). If the Pop-up Blocker is disabled, disruptive and potentially dangerous pop-up windows could load and present a security risk.",
      "severity": "medium"
    },
    {
      "id": "V-17187",
      "title": "Disable Trust Bar Notification for unsigned application add-ins - InfoPath",
      "description": "By default, if an application is configured to require that all add-ins be signed by a trusted publisher, any unsigned add-ins the application loads will be disabled and the application will display the Trust Bar at the top of the active window. The Trust Bar contains a message that informs users about the unsigned add-in.",
      "severity": "medium"
    },
    {
      "id": "V-17576",
      "title": "Block redirection behavior for upgraded web sites by SharePoint - Infopath.",
      "description": "During a Windows SharePoint Services gradual upgrade, sites that have been upgraded remain available at their original URLs (for example, http://<company_name>/sites/SiteA), while sites that are still in the process of being upgraded are located at a temporary domain URL (for example, http://<company_name_old>/sites/SiteB).\nBy default, InfoPath 2007 automatically redirects user requests for sites that have not been upgraded to the temporary URL if it is located on the local intranet, but blocks them if the temporary URL is located elsewhere. InfoPath will prompt users before redirecting forms or form templates to another intranet site.\nIf this restriction is relaxed, all requests to sites that have not been upgraded will be redirected to their targets, regardless of location. This functionality could cause requests made to a secure site to be redirected to an unsecured one (for example, requests to an intranet site could be redirected to an unencrypted Internet site), causing sensitive information to be at risk.",
      "severity": "medium"
    },
    {
      "id": "V-17577",
      "title": "Control \"open forms\" behavior for Internet Security zone - InfoPath",
      "description": "When InfoPath solutions are opened locally, the location of the form is checked so that updates to the form can be downloaded. If a user saves a form locally from a location on the Internet and then opens the same form from another location on the Internet, the cache will be updated with the new location information. If the user then opens the first form from its saved location, there will be a mismatch between the locally saved form and the locally cached form. This situation would typically happen when developers move forms to a new location, but if there is no warning when the cached location is used it could be misused by an attacker attempting to redirect the forms to a new location. This type of attack is a form of beaconing.\nBy default, if the location information in the cached form and the saved form do not match, the form cannot be opened without prompting the user for consent.\n",
      "severity": "medium"
    },
    {
      "id": "V-17578",
      "title": "Control behavior when opening forms in the Intranet Security Zone - InfoPath",
      "description": "When InfoPath solutions are opened locally, the location of the form is checked so that updates to the form can be downloaded. If a user saves a form locally from a location on the Local Intranet and then opens the same form from another location on the Local Intranet, the cache will be updated with the new location information. If the user then opens the first form from its saved location, there will be a mismatch between the locally saved form and the locally cached form. This situation would typically happen when developers move forms to a new location, but if there is no warning when the cached location is used it could be misused by an attacker attempting to redirect the forms to a new location. This type of attack is a form of beaconing.\nBy default, if the location information in the cached form and the saved form do not match, then the form cannot be opened without prompting the user for consent.\n",
      "severity": "medium"
    },
    {
      "id": "V-17579",
      "title": "Control behavior when opening eMail forms in the Trusted Site Security Zone - InfoPath",
      "description": "When InfoPath solutions are opened locally, the location of the form is checked so that updates to the form can be downloaded. If a user saves a form locally from a location in the Trusted Sites zone and then opens the same form from another location in the Trusted Sites zone, the cache will be updated with the new location information. If the user then opens the first form from its saved location, there will be a mismatch between the locally saved form and the locally cached form. This situation would typically happen when developers move forms to a new location, but if there is no warning when the cached location is used it could be misused by an attacker attempting to redirect the forms to a new location. This type of attack is a form of beaconing.\nBy default, if the location information in the cached form and the saved form do not match, then the form cannot be opened without prompting the user for consent.\n",
      "severity": "medium"
    },
    {
      "id": "V-17580",
      "title": "Control Forms Opening behavior for EMail forms containing code or scripts - InfoPath.  ",
      "description": "By default, InfoPath 2007 notifies and prompts users before opening InfoPath e-mail forms that contain code or script. If this restriction is relaxed, InfoPath will open e-mail forms that contain code or script without prompting users, which could allow malicious code to run on the users' computers.",
      "severity": "medium"
    },
    {
      "id": "V-17582",
      "title": "Enable the Restriction on adding custom code to InfoPath forms. ",
      "description": "By default, users can design new InfoPath 2007 forms that use custom code to add interactivity and other functionality to forms. Designers can add managed code written in C# and Visual Basic .NET, as well as scripts written in Jscript and VBScript. \nAn inexperienced or malicious user could design a form with dangerous code that harms users' computers or puts sensitive data at risk.\n",
      "severity": "medium"
    },
    {
      "id": "V-17611",
      "title": "Email with InfoPath forms to show UI to recipients. ",
      "description": "Malicious users could send e-mail InfoPath forms with embedded Web beacons that can be used to track when recipients open the form and provide confirmation that recipients' e-mail addresses are valid. Additional information gathered by the form or information entered by users could also be sent to an external server and leave the users vulnerable to additional attacks.\nBy default, InfoPath 2007 users are only warned of a beaconing threat if the form originates from the Internet.\n",
      "severity": "medium"
    },
    {
      "id": "V-17646",
      "title": "Disable the Information Rights Management feature for InfoPath.  ",
      "description": "By default, users can use Information Rights Management (IRM) in InfoPath 2007 to create forms that have restricted permission for specific people who will access the form. By using IRM, users can help prevent sensitive information from being printed, forwarded, or copied by unauthorized people.",
      "severity": "medium"
    },
    {
      "id": "V-17654",
      "title": "Disable dynamic caching of the form template in InfoPath eMail forms.  ",
      "description": "By default, InfoPath 2007 caches form templates when they are attached to a mail item that is recognized as an InfoPath e-mail form. When users fill out forms that open with a restricted security level, InfoPath uses the cached version of the mailed template, rather than any published version.\nTo circumvent users filling out a published form, an attacker could e-mail an alternate version of the form, which would return the data to the sender as part of a phishing attack and could be used to gain access to confidential information.\n",
      "severity": "medium"
    },
    {
      "id": "V-17655",
      "title": "Disable email forms from the Full Trust Security Zone - InfoPath",
      "description": "InfoPath provides three security levels for form templates: Restricted, Domain, and Full Trust. The security levels determine whether a form template can access data on other domains, or access files and settings on your computer. Fully trusted forms have a Full Trust security level, and can access files and settings on users' computers. The form template for these forms must be digitally signed with a trusted root certificate, or installed on users' computers. \nBy default, InfoPath 2007 can open e-mail forms with full trust. If an attacker designs and sends a dangerous fully trusted e-mail form, it could affect users' computers or give the attacker access to sensitive information.\n",
      "severity": "medium"
    },
    {
      "id": "V-17656",
      "title": "Disable eMail forms from the Internet Security Zone for InfoPath. ",
      "description": "InfoPath 2007 e-mail forms can be designed by an external attacker and sent over the Internet as part of a phishing attempt. Users might fill out such forms and provide sensitive information to the attacker.\nBy default, forms that originate from the Internet can be opened, although those forms cannot access content that is stored in a different domain.\n",
      "severity": "medium"
    },
    {
      "id": "V-17657",
      "title": "Disable eMail forms running in Restricted Security Level - InfoPath. ",
      "description": "InfoPath 2007 forms that run with the restricted security level can only access data that is stored on the forms. However, a malicious user could still send an e-mail form that runs with the restricted security level in an attempt to access sensitive information provided by users.\nBy default InfoPath 2007 e-mail forms running with the restricted security level can be opened.\n",
      "severity": "medium"
    },
    {
      "id": "V-17658",
      "title": "Disable Fully Trusted Solutions access to computers - InfoPath",
      "description": "By default, InfoPath 2007 users can choose whether to allow trusted forms to run on their computers. The Full Trust security level allows a form to access local system resources, such as COM components or files on users' computers, and suppresses certain security prompts. It can only be used with forms that are installed on users' computers or with forms using a form template that is digitally signed with a trusted root certificate.\nAs with any security model that allows trusted entities to operate with fewer security controls, if a form with malicious content is marked as fully trusted it could be used to compromise information security or affect users' computers.\n",
      "severity": "medium"
    },
    {
      "id": "V-17663",
      "title": "Disable opening of solutions from the Internet Security Zone - InfoPath. ",
      "description": "Attackers could use InfoPath 2007 solutions published to Internet Web sites to try to obtain sensitive information from users.\nBy default, users can open InfoPath solutions that do not contain managed code from sources located in the Internet security zone as defined in the Internet Options dialog box in Internet Explorer.\n",
      "severity": "medium"
    },
    {
      "id": "V-17667",
      "title": "Disable sending the form template with the eMail form in InfoPath. ",
      "description": "By default, InfoPath 2007 allows users to attach form templates when sending e-mail forms. If users are able to open form templates included with e-mail forms, rather than using a cached version that is previously published, an attacker could send a malicious form template with the e-mail form in an attempt to gain access to sensitive information.\nNote   The form template is only opened directly if the form opens with a restricted security level. Otherwise the attachment is actually a link to the published location.\n",
      "severity": "medium"
    },
    {
      "id": "V-17668",
      "title": "Disable sending \"InfoPath 2003\" forms as email forms in InfoPath 2007. ",
      "description": "An attacker might target InfoPath 2003 forms to try and compromise an organization's security. InfoPath 2003 did not write a publish location for e-mail forms, which meant that forms could open without a corresponding published location.\nBy default, InfoPath 2007 sends all forms via e-mail using InfoPath e-mail forms integration, including forms that were created using the InfoPath 2003 file format.\n",
      "severity": "medium"
    },
    {
      "id": "V-17745",
      "title": "Beaconing UI shown for forms opened in InfoPath - InfoPath",
      "description": "Malicious users can create InfoPath forms with embedded Web beacons that can be used to contact an external server when the user opens the form. Information could be gathered by the form, or information entered by users could be sent to an external server and cause them to be vulnerable to additional attacks.\nBy default, InfoPath 2007 warns users about potential Web beaconing threats.\n",
      "severity": "medium"
    },
    {
      "id": "V-17746",
      "title": "Beaconing UI forms opened in Editor ActiveX - InfoPath",
      "description": "InfoPath 2007 makes it possible to host InfoPath forms in other applications as ActiveX controls. Such controls are known as InfoPath form controls.\nA malicious user could insert a Web beacon into one of these controls which could be used to contact an external server when the user opens the form. Information could be gathered by the form, or information entered by users could be sent to an external server and cause them to be vulnerable to additional attacks.\nBy default, InfoPath form controls warn users about potential Web beaconing threats.\n",
      "severity": "medium"
    },
    {
      "id": "V-17758",
      "title": "Offline Mode enabled to cache queries for offline mode. ",
      "description": "InfoPath 2007 can function in online mode or offline mode. It can also cache queries for use in offline mode. If offline mode is used and cached queries are enabled, sensitive information contained in the cache could be at risk.\nBy default, InfoPath is in online mode, but offline mode is available to users. Users can also cache queries for use in offline mode.\n",
      "severity": "medium"
    },
    {
      "id": "V-17764",
      "title": "Prevent unsafe file types to be attached to InfoPath forms. ",
      "description": "By default, users can attach any type of file to forms except potentially unsafe files that might contain viruses, such as .bat or .exe files. For the full list of file types that InfoPath 2007 disallows by default, see \"Security Details\" in Insert a file attachment control on the Microsoft Office Online Web site.\nIf unsafe file types are added to InfoPath forms, they might be used as a means of attacking the computer on which the form is opened. These unsafe file types may include active content, or may introduce other vulnerabilities that an attacker can exploit.\n",
      "severity": "medium"
    }
  ]
}