{
  "name": "mozilla_firefox",
  "date": "2017-12-21",
  "description": "The Mozilla Firefox Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil",
  "title": "Mozilla Firefox Security Technical Implementation Guide",
  "version": "4",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-15768",
      "title": "FireFox is configured to ask which certificate to present to a web site when a certificate is required.",
      "description": "When a web site asks for a certificate for user authentication, Firefox must be configured to have the user choose which certificate to present. Websites within DOD require user authentication for access which increases security for DoD information. Access will be denied to the user if certificate management is not configured.",
      "severity": "medium"
    },
    {
      "id": "V-15770",
      "title": "Firefox automatically executes or downloads MIME types which are not authorized for auto-download.",
      "description": "The default action for file types for which a plugin is installed is to automatically download and execute the file using the associated plugin. Firefox allows you to change the specified download action so that the file is opened with a selected external application or saved to disk instead. View the list of installed browser plugins and related MIME types by entering about:plugins in the address bar. \n\nWhen you click a link to download a file, the MIME type determines what action Firefox will take. You may already have a plugin installed that will automatically handle the download, such as Windows Media Player or QuickTime. Other times, you may see a dialog asking whether you want to save the file or open it with a specific application. When you tell Firefox to open or save the file and also check the option to \"Do this automatically for files like this from now on\", an entry appears for that type of file in the Firefox Applications panel, shown below.\n",
      "severity": "medium"
    },
    {
      "id": "V-15771",
      "title": "Network shell protocol is enabled in FireFox.",
      "description": "Although current versions of Firefox have this set to disabled by default, use of this option can be harmful.  This would allow the browser to access the Windows shell. This could allow access to the\nunderlying system.  This check verifies that the default setting has not been changed.\n",
      "severity": "medium"
    },
    {
      "id": "V-15772",
      "title": "Firefox not configured to prompt user before download and opening for required file types.",
      "description": "New file types cannot be added directly to the helper applications or plugins listing. Files with these extensions will not be allowed to use Firefox publicly available plugins and extensions to open.  The application will be configured to open these files using external applications only.  After a helper application or save to disk download action has been set, that action will be taken automatically for those types of files.  When the user receives a dialog box asking if you want to save the file or open it with a specified application, this indicates that a plugin does not exist. The user has not previously selected a download action or helper application to automatically use for that type of file. When prompted, if the user checks the option to Do this automatically for files like this from now on, then an entry will appear for that type of file in the plugins listing and this file type is automatically opened in the future. This can be a security issue.  New file types cannot be added directly to the Application plugin listing. ",
      "severity": "medium"
    },
    {
      "id": "V-15773",
      "title": "FireFox plug-in for ActiveX controls is installed.",
      "description": "When an ActiveX control is referenced in an HTML document, MS Windows checks to see if\nthe control already resides on the client machine. If not, the control can be downloaded from a\nremote web site. This provides an automated delivery method for mobile code.",
      "severity": "medium"
    },
    {
      "id": "V-15774",
      "title": "Firefox formfill assistance option is disabled.",
      "description": "In order to protect privacy and sensitive data, Firefox provides the ability to configure Firefox such that data entered into forms is not saved.  This mitigates the risk of a website gleaning private information from prefilled information.",
      "severity": "medium"
    },
    {
      "id": "V-15775",
      "title": "Firefox is configured to autofill passwords.",
      "description": "While on the internet, it may be possible for an attacker to view the saved password files and gain access to the user's accounts on various hosts. ",
      "severity": "medium"
    },
    {
      "id": "V-15776",
      "title": "FireFox is configured to use a password store with or without a master password.",
      "description": "Firefox can be set to store passwords for sites visited by the user.  These individual passwords are stored in a file and can be protected by a master password. Autofill of the password can then be enabled when the site is visited.  This feature could also be used to autofill the certificate pin which could lead to compromise of DoD information.",
      "severity": "medium"
    },
    {
      "id": "V-15777",
      "title": "History retention must be set to 40 days.",
      "description": "This setting specifies the number of days that Firefox keeps track of the pages viewed in the History List. If you enable this policy setting, a user cannot set the number of days that Firefox keeps track of the pages viewed in the History List. The number of days that Firefox keeps track of the pages viewed in the History List must be specified. If you disable or do not configure this policy setting, a user can set the number of days that Firefox tracks views of pages in the History List.",
      "severity": "medium"
    },
    {
      "id": "V-15778",
      "title": "FireFox is not configured to block pop-up windows.",
      "description": "Popup windows may be used to launch an attack within a new browser window with altered settings. This setting blocks popup windows created while the page is loading.",
      "severity": "medium"
    },
    {
      "id": "V-15779",
      "title": "FireFox is configured to allow JavaScript to move or resize windows.\n",
      "description": "JavaScript can make changes to the browser’s appearance. This activity can help disguise an attack taking place in a minimized background window.  Set browser setting to prevent scripts on visited websites from moving and resizing browser windows.  ",
      "severity": "medium"
    },
    {
      "id": "V-15983",
      "title": "Firefox must be configured to allow only TLS.",
      "description": "Use of versions prior to TLS 1.1 are not permitted. SSL 2.0 and SSL 3.0 contain a number of security flaws. These versions must be disabled in compliance with the Network Infrastructure and Secure Remote Computing STIGs.",
      "severity": "medium"
    },
    {
      "id": "V-15985",
      "title": "Firefox is configured to allow JavaScript to raise or lower windows.",
      "description": "JavaScript can make changes to the browser’s appearance. Allowing a website to use JavaScript to raise and lower browser windows may disguise an attack. Browser windows may not be set as active via JavaScript.\n",
      "severity": "medium"
    },
    {
      "id": "V-15986",
      "title": "Firefox is configured to allow JavaScript to disable or replace context menus.",
      "description": "A context menu (also known as a pop-up menu) is often used in a graphical user interface (GUI) and appears upon user interaction (e.g., a right mouse click). A context menu offers a limited set of choices that are available in the current state, or context, of the operating system or application.  A website may execute JavaScript that can make changes to these context menus.  This can help disguise an attack.  Set this preference to \"false\" so that webpages will not be able to affect the context menu event.",
      "severity": "medium"
    },
    {
      "id": "V-15987",
      "title": "Firefox is configured to allow JavaScript to hide or change the status bar.",
      "description": "When a user visits some webpages, JavaScript can hide or make changes to the browser’s appearance to hide unauthorized activity. This activity can help disguise an attack taking place in a minimized background window.  Determines whether the text in the browser status bar may be set by JavaScript.  Set and lock to True (default in Firefox) so that JavaScript access to preference settings for is disabled.",
      "severity": "medium"
    },
    {
      "id": "V-15988",
      "title": "Firefox is configured to allow JavaScript to change the status bar text.",
      "description": "JavaScript can make changes to the browser’s appearance. This activity can help disguise an attack taking place in a minimized background window.  Webpage authors can disable many features of a popup window that they open. Setting these preferences to true will override the author's settings and ensure that the feature is enabled and present in any popup window.  This setting prevents the status bar from being hidden.",
      "severity": "medium"
    },
    {
      "id": "V-15989",
      "title": "Firefox is not configured to provide warnings when a user switches from a secure (SSL-enabled) to a non-secure page.",
      "description": "Users may not be aware that the information being viewed under secure conditions in a previous page are not currently being viewed under the same security settings. ",
      "severity": "medium"
    },
    {
      "id": "V-17988",
      "title": "Installed version of Firefox unsupported.",
      "description": "Use of versions of an application which are not supported by the vendor are not permitted. Vendors respond to security flaws with updates and patches. These updates are not available for unsupported version which can leave the application vulnerable to attack.",
      "severity": "high"
    },
    {
      "id": "V-19741",
      "title": "Firefox application is set to auto-update.",
      "description": "Allowing software updates from non-trusted sites can introduce settings that will override a secured installation of the application. This can place DoD information at risk. If this setting is enabled, then there are many other default settings which point to untrusted sites which must be changed to point to an authorized update site that is not publicly accessible.",
      "severity": "medium"
    },
    {
      "id": "V-19742",
      "title": "Firefox automatically updates installed add-ons and plugins.",
      "description": "Set this to false to disable checking for updated versions of the Extensions/Themes.  Automatic updates from untrusted sites puts the enclave at risk of attack and may override security settings.",
      "severity": "medium"
    },
    {
      "id": "V-19743",
      "title": "Firefox required security preferences cannot be changed by user.",
      "description": "Locked settings prevent users from accessing about:config and changing the security settings set by the system administrator.  Locked settings should be placed in the mozilla.cfg file. The mozilla.cfg file is an encoded file of JavaScript commands. The encoding is a simple \"byte-shifting\" with an offset of 13 (Netscape 4 used a similar encoding, but with a 7 instead). This file also needs to be \"called\" from the configuration file local-settings.js",
      "severity": "medium"
    },
    {
      "id": "V-19744",
      "title": "Firefox automatically checks for updated version of installed Search plugins.",
      "description": "Updates need to be controlled and installed from authorized and trusted servers.  This setting overrides a number of other settings which may direct the application to access external URLs.",
      "severity": "medium"
    },
    {
      "id": "V-6318",
      "title": "The DOD Root Certificate is not installed.",
      "description": "The DOD root certificate will ensure that the trust chain is established for server certificate issued from the DOD CA.",
      "severity": "medium"
    },
    {
      "id": "V-64891",
      "title": "Extensions install must be disabled.",
      "description": "A browser extension is a program that has been installed into the browser which adds functionality to it. Where a plug-in interacts only with a web page and usually a third party external application (Flash, Adobe Reader) an extension interacts with the browser program itself. Extensions are not embedded in web pages and must be downloaded and installed in order to work. Extensions allow browsers to avoid restrictions which apply to web pages. For example, a Chrome extension can be written to combine data from multiple domains and present it when a certain page is accessed which can be considered Cross Site Scripting. If a browser is configured to allow unrestricted use of extension then plug-ins can be loaded and installed from malicious sources and used on the browser. ",
      "severity": "medium"
    },
    {
      "id": "V-79053",
      "title": "Background submission of information to Mozilla must be disabled.",
      "description": "There should be no background submission of technical and other information from DoD computers to Mozilla with portions posted publically.",
      "severity": "medium"
    }
  ]
}