{
  "name": "pdasmartphone",
  "date": "2011-10-07",
  "description": "This STIG contains the technical security controls for the operation of a PDA or Smartphone in the DoD environment.",
  "title": "PDA/Smartphone Security Technical Implementation Guide",
  "version": "6",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-14202",
      "title": "FIPS 140-2 validated encryption modules must be used to encrypt unclassified sensitive data at rest on the wireless device (e.g., laptop, PDA, smartphone).",
      "description": "If a wireless device is lost or stolen without DAR encryption, sensitive DoD data could be compromised.  Most known security breaches of cryptography result from improper implementation, not flaws in the cryptographic algorithms themselves.   FIPS 140-2 validation provides assurance that cryptography is implemented correctly, and is required for Federal Government uses of cryptography in non-classified applications.",
      "severity": "medium"
    },
    {
      "id": "V-14275",
      "title": "DoD-licensed anti-malware software will be installed on all wireless clients (e.g., PDAs and smartphones) and non-wireless PDAs.   ",
      "description": "Security risks inherent to wireless technology usage can be minimized with security measures such current anti-virus updates.",
      "severity": "medium"
    },
    {
      "id": "V-18621",
      "title": "A personal firewall must be implemented on each PDA / smartphone that is used to connect to the Internet or DoD network.",
      "description": "Without a personal firewall, the PDA / Smartphone is susceptible to vulnerability scanning and malware attacks from the Internet and other networks to which it may intentionally or inadvertently connect.",
      "severity": "low"
    },
    {
      "id": "V-18625",
      "title": "PDA and Smartphones that are connected to DoD Windows computers via a USB connection must be compliant with requirements.",
      "description": "PDAs with flash memory can introduce malware to a PC when they are connected for provisioning of the PDA or to transfer data between the PC and PDA, particularly if the PDA is seen by the PC as a mass storage device and autorun in enabled.  ",
      "severity": "medium"
    },
    {
      "id": "V-18627",
      "title": "The VPN client on wireless clients (PDAs, smartphones) used for remote access to DoD networks must be FIPS 140-2 validated.  ",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.  FIPS validation provides a level of assurance that the encryption of the device has been securely implemented.",
      "severity": "medium"
    },
    {
      "id": "V-19897",
      "title": "All wireless PDA clients used for remote access to DoD networks must have a VPN capability that supports AES encryption.",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-19898",
      "title": "All wireless PDA clients used for remote access to a DoD network must have a VPN capability that supports CAC authentication. ",
      "description": "If an adversary can bypass a VPN’s authentication controls, then the adversary can compromise DoD data transmitted over the VPN and conduct further attacks on DoD networks.  CAC authentication greatly mitigates this risk by providing strong two-factor authentication.",
      "severity": "medium"
    },
    {
      "id": "V-19899",
      "title": "Wireless PDA VPNs must operate with split tunneling disabled.",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-25007",
      "title": "The PDA/smartphone must be configured to require a passcode for device unlock.",
      "description": "Sensitive DoD data could be compromised if a device unlock passcode is not set up on a DoD PDA/smartphone. These devices are particularly vulnerable because they are exposed to many potential adversaries when they taken outside of the physical security perimeter of DoD facilities, and because they are easily concealed if stolen.",
      "severity": "high"
    },
    {
      "id": "V-25009",
      "title": "Maximum password/passcode age must be set as required.",
      "description": "If the passcode is not changed periodically, then an adversary with knowledge of the passcode can use it indefinitely without detection, potentially allowing access to sensitive DoD information and enabling subsequent attacks.",
      "severity": "low"
    },
    {
      "id": "V-25011",
      "title": "Password/passcode maximum failed attempts must be set to the required value.",
      "description": "A hacker with unlimited attempts can determine the passcode of a smartphone within a few minutes using password hacking tools, which could lead to unauthorized access to the PDA/smartphone and disclosure of sensitive DoD data.",
      "severity": "medium"
    },
    {
      "id": "V-25016",
      "title": "The device minimum password/passcode length must be set as required. ",
      "description": "If the length of the passcode is less than the required length, brute force password attacks will take less time than they would otherwise.  Successful attacks will compromise authentication credentials and potentially compromise other sensitive DoD information.",
      "severity": "medium"
    },
    {
      "id": "V-25022",
      "title": "PDAs/smartphones must display the required banner during device unlock/ logon.  ",
      "description": "DoD CIO memo requires all PDAs, BlackBerrys, and smartphones to have a consent banner displayed during logon/device unlock to ensure users understand their responsibilities to safeguard DoD data.  When users understand their responsibilities, they are less likely to engage in behaviors that could compromise of DoD information systems.",
      "severity": "medium"
    },
    {
      "id": "V-30358",
      "title": "DoD network users authorized to remotely connect to a DoD network from a residential WLAN must configure the access point with a strong pre-shared key (PSK) passcode.",
      "description": "If the passcode is weak, then an adversary is more likely to crack it.  Once an adversary obtains the passcode, the adversary can use the passcode access to gain access to WLAN and potentially other networks to which it is attached.",
      "severity": "medium"
    }
  ]
}