{
  "name": "stig_web_policy",
  "date": "2011-10-03",
  "description": "None",
  "title": "Web Policy STIG",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-23819",
      "title": "The production web server staff will have a formal migration plan for removing or upgrading production web server software prior to the date the vendor drops security patch support.",
      "description": "It is one of the primary duties of the Change Control Board (CCB) to have a complete and detailed inventory of hardware, software, and firmware, inclusive of version, license, and certificate information (such as expiration dates) in order to properly track and plan for change. This requirement will also be reflected in the Continuity of Operations Plan (COOP) within the organization, which forms the basis of contingency planning and recovery.\n\nWith regards to software, firmware, and hardware expired licenses, certificates, and support agreements that may lead to outages of availability, a process should be in place in order to ensure these are kept current in a timely fashion as determined by the organization. Also, vendor agreements, contact numbers, and support identification protocols should be maintained, kept current, and be readily available to the CCB, the IAO, and the SA for the production web server.\n\nSoftware that has fallen out of warranty and is no longer supported by the vendor presents a significant risk to the computing environment. When software is no longer supported by the vendor, patches are no longer supplied for the particular piece of software which can make an organization vulnerable to attacks. Also, unsupported software is normally not included on various vulnerability notices, such as IAVMs and CVEs, due to the fact that the vendors are not providing this information since the software is not supported. \n\nIt is important to note that software that fails to meet DoD security guidelines may be denied connection to the network.\n",
      "severity": "medium"
    },
    {
      "id": "V-23822",
      "title": "Incident Response procedures must exist for web servers and sites.",
      "description": "It is a requirement that all DoD information sites have developed and implemented Incident Response (IR) policies and procedures. In the event that an unexpected occurrence disrupts the web server’s function, a mechanism will be in place to guide the SA or the web administrator through the process of determining the cause and effect of such an event. This may involve, among other things, the use of forensic techniques (such as log file research as well as file and directory modification analysis), and may include specific reporting and coordination requirements as well as specific steps necessary to begin recovery of an affected server. The IAO, SAs, and web administrators should have a copy of these procedures and be knowledgeable about their roles and responsibilities.",
      "severity": "medium"
    },
    {
      "id": "V-23829",
      "title": "Production web server scripts are tested before implementation.",
      "description": "Interactive server-side scripts, sometimes referred to as CGI, are a powerful means for enhancing web site functionality. Scripts are often executable at the application layer and can interact with the operating system, frequently exercising control over fundamental system resources (i.e., start and stop programs, write data to the server, alter and delete data, etc.). A variety of scripting languages and middleware is available for this purpose. Typically, this middleware involves the use of an interpreter. The opportunity for a malicious user to exploit poorly-designed or untested web scripts is significant and has proven to be a leading cause of server compromises. This would apply to any operating system and any web server software in use. SSI, ASP, JSP, JAVA, PHP, JS, PERL scripts, and enabled SWFs are commonly found in these circumstances. \n\nIt is important that all programs have been reviewed, tested, and approved with regard to security prior to being promoted to the production web server. \n\nThe IAO, the SA, and/or the web master should be in possession of copies of assurance from either an application development team utilizing the guidance of the Application Security and Development STIG or an assurance from a trusted third-party vendor that security evaluations have been performed with regard to scripts being used on a production web server. \n",
      "severity": "medium"
    },
    {
      "id": "V-23833",
      "title": "Trained staff are not available to respond to web server or web content problems.",
      "description": "Many web sites are available 24 hours per day, 7 days a week, and the potential for problems relating to the web server operations are significant. Operating staff may discover a problem with the organization’s web server operation or web content. Points-of-contact (staff) with the appropriate access and training must be available to respond to immediate operational needs to correct the problem.",
      "severity": "low"
    },
    {
      "id": "V-23834",
      "title": "All interactive CGI programs used on the production web server will be documented. ",
      "description": "Common Gateway Interface (CGI) is a standard protocol that defines how web server software can delegate the generation of web pages to an external application or the web browser. These web server-based applications, known as CGI scripts, are not to be confused with the more specific .cgi file extension. CGI applications can be written in many programming languages. Common applications involve the acquisition of data between a web page and the web browser, executing the CGI scripts, and returning customized web content. There is a possibility of compromising security when using CGI. CGI programs that are carelessly written can grant the malicious user as much access to the server as a privileged account. Documenting these programs will allow the site to maintain an inventory of the interactive programs so that rogue programs are not installed and running on the web server.",
      "severity": "low"
    },
    {
      "id": "V-23835",
      "title": "The sensitivity level of all data for publication on a production web site is known and documented.",
      "description": "It is important to be aware of the data sensitivity level and security category of information being published on a web site so that appropriate safeguards may be applied. Such safeguards may include the physical separation of information published on servers located within the DoD DMZ as referenced by the DoD Internet-NIPRNet DMZ STIG. \n\nIt is important for the IAO to have access to this documentation regarding the data sensitivity level and security category level of hosted information to help ensure that appropriate safeguards have been applied.\n\nInitiatives are currently in progress within the NIPRNet DMZ that may require this awareness.\n\n\n\n",
      "severity": "medium"
    },
    {
      "id": "V-23836",
      "title": "Configuration management policies are available to the SA and the web administrator.",
      "description": "A Configuration Management Policy and its associated procedures help to ensure the effective implementation of security controls requisite to the organizational goals of integrity, availability, and confidentiality by governing the change process, which is necessary to ensure that unapproved and malformed software, or unapproved configuration changes, are not introduced into the production environment. It should include, but may not be limited to, auditing change, the use of automated change controls, limiting change to authorized personnel with regard to direct changes to production software, and lists of approved or disapproved software.",
      "severity": "low"
    },
    {
      "id": "V-23838",
      "title": "A current baseline configuration for the web server is maintained at all times.",
      "description": "The Web Server STIG and the OS STIG can provide guidance with respect to the creation of a baseline configuration for web servers. However, changes to the server configuration over time will occur due to either threat mitigation or the customization of server software. These configurable changes may occur outside of STIG guidance, creating a new configuration baseline. A new configuration baseline should be documented, readily accessible, and current in order to help ensure rapid incident response. This check recognizes that each server operating within the DoD, although similar, may be unique. \n\nThere are many types of customized configurations with respect to the OS and the web server software (e.g., IIS, Apache, etc.) which, although compliant with DoD STIG guidance, may affect the overall availability of a DoD asset to fulfill its mission in the event of a significant incident. If these customizations are not known, documented, and available, a web server recovery may be impacted. It is also recognized that although automated backup and recovery software may significantly mitigate the risk to a web server’s availability, there may be circumstances that require significant manual configuration.\n\nThis requirement is aligned with those configurable settings that affect the role of a web server. Some of those settings may be required by the OS STIG and some of those settings may be required within the Web Server STIG.\n\nConfiguration settings that affect availability, integrity, or confidentially of a production web server should be documented and available.\n",
      "severity": "low"
    },
    {
      "id": "V-23839",
      "title": "Change on a production web site is controlled.",
      "description": "One of the greatest potential threats to a production web server comes from the allowance of inappropriately controlled software change.\n\nAll change and modification to production web sites must be controlled with respect to organizational policy or to a specific and approved local policy. The preferred mechanism to introduce approved new programs and CGI should be through an automated, auditable, and access controlled interface. This interface should have the ability to maintain software versions that will allow a rapid reversion to a known working copy of the software in the event of a problem. Both direct and un-auditable changes should be disallowed on production web sites. Exceptions to change management policy must be documented and approved by the IAO or higher authority.\n",
      "severity": "medium"
    },
    {
      "id": "V-23840",
      "title": "Documented procedures and processes exist to recover the production web server and its associated web sites and are included as a part of the COOP.",
      "description": "In the event that a production web site or server needs to be recovered, a current and complete process exists to recover the web server and its associated web sites. \n\nFormed as an integral part of the risk management framework and a requirement within the DoD, a Continuity of Operations Plan (COOP) is the basis by which guidance may be given in order to recover a production web server and its associated web sites from significant incidents. The COOP’s procedures and associated recovery check-off lists, the contact information for both internal personnel and vendor-specific assistance, Service Level Agreements (SLAs), warranties, and licensing information, provide the mechanisms for success during the recovery process.\n\n\n\n",
      "severity": "medium"
    },
    {
      "id": "V-23841",
      "title": "The SA and the web administrator are aware of mobile code technology deployed on servers under their administration. ",
      "description": "Mobile code technologies represent a major threat vector with respect to the protection of DoD assets. Because this technology is continually evolving, guidance offered by DoD and NIST is also continually evolving. It is important to note with respect to threat mitigation that the hosting agency be aware of deployed mobile code.",
      "severity": "low"
    },
    {
      "id": "V-23842",
      "title": "A process must exist to ensure changes to a production web server’s software or a production web server’s configurable settings are tested and documented before being implemented.",
      "description": "This requirement only addresses the physical web server software (e.g., IIS, Apache, etc.) and web server software configuration changes. It is not related to web site application code, web content, or changes to the OS that are governed by other vulnerabilities or STIGs.\n\nA significant threat to the production web server comes from the implementation of untested changes, which may risk compromising existing security controls with regard to availability, integrity, and confidentiality. The requirement for formal testing should be driven by the completion of a risk and security impact assessment. Although all changes should be tested, a DoD component may determine that formal testing may not be necessary, based on the recommendation of the assessment. However, in those cases where an assessment clearly indicates risk, a formal testing process should exist. This process should be followed and documented.\n",
      "severity": "medium"
    },
    {
      "id": "V-23844",
      "title": "Web server access logs are generated and retained according to DoDI 8500.2 requirements.",
      "description": "Audit trails (logs) are required, as a minimum, to determine accountability according to DoDI 8500.2. They also provide the accountability functionality of a C2-level trusted requirement. Auditing (logging) provides an investigative tool to detect misuse of the system and has been used as evidence to convict individuals of computer crimes.",
      "severity": "low"
    },
    {
      "id": "V-23846",
      "title": "Information on public web servers is reviewed before publication and periodically reviewed after publication.\n\n",
      "description": "The publishing of un-reviewed and unapproved content on a public web server may pose a serious threat to the safety of the warfighter and national security. Security is everyone’s responsibility and, although the originating organization posting the information must ensure that the information has been approved prior to publication, all individuals have a responsibility to raise concern if they suspect that inappropriate content has been published.\n\nThere are a number of events that may require the removal of publicly posted information from a public web site such as a change in security postures and guidance directives, the discovery of inadvertently released sensitive information, the discovery of the use of copy-righted material without proper permissions, and the removal of outdated or superseded information.\n",
      "severity": "medium"
    }
  ]
}