{
  "name": "stig_solaris_10_sparc",
  "date": "2018-04-10",
  "description": "The Solaris 10 (SPARC) Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems.  Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "SOLARIS 10 SPARC SECURITY TECHNICAL IMPLEMENTATION GUIDE",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-1010",
      "title": "Public directories must be the only world-writable directories and world-writable files must be located only in public directories.",
      "description": "World-writable files and directories make it easy for a malicious user to place potentially compromising files on the system.\n\nThe only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage (e.g., /tmp) and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-1011",
      "title": "Inetd or xinetd logging/tracing must be enabled.",
      "description": "Inetd or xinetd logging and tracing allows the system administrators to observe the IP addresses connecting to their machines and to observe what network services are being sought.  This provides valuable information when trying to find the source of malicious users and potential malicious users.",
      "severity": "low"
    },
    {
      "id": "V-1013",
      "title": "The system must be configured to only boot from the system boot device.",
      "description": "The ability to boot from removable media is the same as being able to boot into single user or maintenance mode without a password.  This ability could allow a malicious user to boot the system and perform changes possibly compromising or damaging the system.  It could also allow the system to be used for malicious purposes by a malicious anonymous user.",
      "severity": "high"
    },
    {
      "id": "V-1023",
      "title": "The system must not run an Internet Network News (INN) server.",
      "description": "Internet Network News (INN) servers access Usenet newsfeeds and store newsgroup articles.  INN servers use the Network News Transfer Protocol (NNTP) to transfer information from the Usenet to the server and from the server to authorized remote hosts.\n\nIf this function is necessary to support a valid mission requirement, its use must be authorized and approved in the system accreditation package.",
      "severity": "medium"
    },
    {
      "id": "V-1026",
      "title": "The Samba Web Administration Tool (SWAT) must be restricted to the local host or require SSL.",
      "description": "SWAT is a tool used to configure Samba. As it modifies Samba configuration, which can impact system security, it must be protected from unauthorized access. SWAT authentication may involve the root password, which must be protected by encryption when traversing the network.\n\nRestricting access to the local host allows for the use of SSH TCP forwarding, if configured, or administration by a web browser on the local system.",
      "severity": "medium"
    },
    {
      "id": "V-1027",
      "title": "The smb.conf file must be owned by root.",
      "description": "The smb.conf file allows access to other machines on the network and grants permissions to certain users.  If it is owned by another user, the file may be maliciously modified and the Samba configuration could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-1028",
      "title": "The smb.conf file must have mode 0644 or less permissive.",
      "description": "If the smb.conf file has excessive permissions, the file may be maliciously modified and the Samba configuration could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-1029",
      "title": "The smbpasswd file must be owned by root.",
      "description": "If the smbpasswd file is not owned by root, the smbpasswd file may be maliciously accessed or modified, potentially resulting in the compromise of Samba accounts.",
      "severity": "medium"
    },
    {
      "id": "V-1030",
      "title": "The smb.conf file must use the hosts option to restrict access to Samba.",
      "description": "Samba increases the attack surface of the system and must be restricted to communicate only with systems requiring access.",
      "severity": "medium"
    },
    {
      "id": "V-1032",
      "title": "Users must not be able to change passwords more than once every 24 hours.",
      "description": "The ability to change passwords frequently facilitates users reusing the same password. This can result in users effectively never changing their passwords. This would be accomplished by users changing their passwords when required and then immediately changing it to the original value.",
      "severity": "medium"
    },
    {
      "id": "V-1046",
      "title": "Root passwords must never be passed over a network in clear text form.",
      "description": "If a user accesses the root account (or any account) using an unencrypted connection, the password is passed over the network in clear text form and is subject to interception and misuse.  This is true even if recommended procedures are followed by logging on to a named account and using the su command to access root.",
      "severity": "high"
    },
    {
      "id": "V-1047",
      "title": "The system must not permit root logins using remote access programs such as SSH.\n",
      "description": "Even though communications are encrypted, an additional layer of security may be gained by extending the policy of not logging directly on as root. In addition, logging in with a user-specific account preserves the audit trail.",
      "severity": "medium"
    },
    {
      "id": "V-1048",
      "title": "Audio devices must have mode 0660 or less permissive.",
      "description": "Globally accessible  audio and video devices have proven to be security hazards.  There is software that can activate system microphones and video devices connected to user workstations and/or X terminals.  Once the microphone has been activated, it is possible to eavesdrop on otherwise private conversations without the victim being aware of it.  This action effectively changes the user's microphone to a bugging device.",
      "severity": "medium"
    },
    {
      "id": "V-1049",
      "title": "Audio devices must be owned by root.",
      "description": "Globally Accessible audio and video devices have proven to be security hazards.  There is software that can activate system microphones and video devices connected to user workstations and/or X terminals.  Once the microphone has been activated, it is possible to eavesdrop on otherwise private conversations without the victim being aware of it.  This action effectively changes the user's microphone to a bugging device.",
      "severity": "medium"
    },
    {
      "id": "V-1056",
      "title": "The smb.conf file must be group-owned by root, bin, or sys.",
      "description": "If the group owner of the smb.conf file is not root or a system group, the file may be maliciously modified and the Samba configuration could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-1058",
      "title": "The smbpasswd file must be group-owned by root.",
      "description": "If the smbpasswd file is not group-owned by root, the smbpasswd file may be maliciously accessed or modified, potentially resulting in the compromise of Samba accounts.",
      "severity": "medium"
    },
    {
      "id": "V-1059",
      "title": "The smbpasswd file must have mode 0600 or less permissive.",
      "description": "If the smbpasswd file has a mode more permissive than 0600, the smbpasswd file may be maliciously accessed or modified, potentially resulting in the compromise of Samba accounts.",
      "severity": "medium"
    },
    {
      "id": "V-1061",
      "title": "Audio devices must be group-owned by root, sys, or bin.",
      "description": "Without privileged group owners, audio devices will be vulnerable to being used as eaves-dropping devices by malicious users or intruders to possibly listen to conversations containing sensitive information.\n",
      "severity": "medium"
    },
    {
      "id": "V-1062",
      "title": "The root shell must be located in the / file system.",
      "description": "To ensure the root shell is available in repair and administrative modes, the root shell must be located in the / file system.\n",
      "severity": "low"
    },
    {
      "id": "V-11940",
      "title": "The operating system must be a supported release.",
      "description": "An operating system release is considered supported if the vendor continues to provide security patches for the product.  With an unsupported release, it will not be possible to resolve security issues discovered in the system software.",
      "severity": "high"
    },
    {
      "id": "V-11941",
      "title": "A file integrity baseline must be created and maintained.",
      "description": "A file integrity baseline is a collection of file metadata which is to evaluate the integrity of the system. A minimal baseline must contain metadata for all device files, setuid files, setgid files, system libraries, system binaries, and system configuration files. The minimal metadata must consist of the mode, owner, group owner, and modification times. For regular files, metadata must also include file size and a cryptographic hash of the file’s contents.",
      "severity": "medium"
    },
    {
      "id": "V-11945",
      "title": "A file integrity tool must be used at least weekly to check for unauthorized file changes, particularly the addition of unauthorized system libraries or binaries, or for unauthorized modification to authorized system libraries or binaries.",
      "description": "Changes in system libraries and binaries can indicate compromise or significant system events, such as patching needing to be checked by automated processes and the results reviewed by the SA.\n\nNOTE: The frequency may be increased to daily, if necessary, in accordance with the contingency plan.",
      "severity": "medium"
    },
    {
      "id": "V-11946",
      "title": "UIDs reserved for system accounts must not be assigned to non-system accounts.",
      "description": "Reserved UIDs are typically used by system software packages. If non-system accounts have UIDs in this range, they may conflict with system software, possibly leading to the user having permissions to modify system files.\n",
      "severity": "medium"
    },
    {
      "id": "V-11947",
      "title": "The system must require passwords contain a minimum of 15 characters.",
      "description": "The use of longer passwords reduces the ability of attackers to successfully obtain valid passwords using guessing or exhaustive search techniques by increasing the password search space.",
      "severity": "medium"
    },
    {
      "id": "V-11948",
      "title": "The system must require passwords to contain at least one uppercase alphabetic character.",
      "description": "To enforce the use of complex passwords, minimum numbers of characters of different classes are mandated.  The use of complex passwords reduces the ability of attackers to successfully obtain valid passwords using guessing or exhaustive search techniques.  Complexity requirements increase the password search space by requiring users to construct passwords from a larger character set than they may otherwise use.",
      "severity": "medium"
    },
    {
      "id": "V-11972",
      "title": "The system must require passwords to contain at least one numeric character.",
      "description": "To enforce the use of complex passwords, minimum numbers of characters of different classes are mandated.  The use of complex passwords reduces the ability of attackers to successfully obtain valid passwords using guessing or exhaustive search techniques.  Complexity requirements increase the password search space by requiring users to construct passwords from a larger character set than they may otherwise use.",
      "severity": "medium"
    },
    {
      "id": "V-11973",
      "title": "The system must require passwords to contain at least one special character.",
      "description": "To enforce the use of complex passwords, minimum numbers of characters of different classes are mandated.  The use of complex passwords reduces the ability of attackers to successfully obtain valid passwords using guessing or exhaustive search techniques.  Complexity requirements increase the password search space by requiring users to construct passwords from a larger character set than they may otherwise use.",
      "severity": "medium"
    },
    {
      "id": "V-11975",
      "title": "The system must require passwords to contain no more than three consecutive repeating characters.",
      "description": "To enforce the use of complex passwords, the number of consecutive repeating characters is limited.  Passwords with excessive repeated characters may be more vulnerable to password-guessing attacks.",
      "severity": "medium"
    },
    {
      "id": "V-11976",
      "title": "User passwords must be changed at least every 60 days.",
      "description": "Limiting the lifespan of authenticators limits the period of time an unauthorized user has access to the system while using compromised credentials and reduces the period of time available for password-guessing attacks to run against a single password.",
      "severity": "medium"
    },
    {
      "id": "V-11977",
      "title": "All non-interactive/automated processing account passwords must be changed at least once per year or be locked.",
      "description": "Limiting the lifespan of authenticators limits the period of time an unauthorized user has access to the system while using compromised credentials and reduces the period of time available for password-guessing attacks to run against a single password. Locking the password for non-interactive and automated processing accounts is preferred as it removes the possibility of accessing the account by a password. On some systems, locking the passwords of these accounts may prevent the account from functioning properly. Passwords for non-interactive/automated processing accounts must not be used for direct logon to the system.",
      "severity": "medium"
    },
    {
      "id": "V-11979",
      "title": "The root account must not be used for direct logins.",
      "description": "Direct login with the root account prevents individual user accountability. Acceptable non-routine uses of the root account for direct login are limited to emergency maintenance, the use of single-user mode for maintenance, and situations where individual administrator accounts are not available.",
      "severity": "medium"
    },
    {
      "id": "V-11980",
      "title": "The system must log successful and unsuccessful access to the root account.",
      "description": "If successful and unsuccessful logins and logouts are not monitored or recorded, access attempts cannot be tracked.  Without this logging, it may be impossible to track unauthorized access to the system.",
      "severity": "medium"
    },
    {
      "id": "V-11981",
      "title": "All global initialization files must have mode 0644 or less permissive.",
      "description": "Global initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-11982",
      "title": "All global initialization files must be owned by root.",
      "description": "Global initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.  Failure to give ownership of sensitive files or utilities to root or bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-11983",
      "title": "All global initialization files must be group-owned by root, sys, or bin.",
      "description": "Global initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.  Failure to give ownership of sensitive files or utilities to root or bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-11984",
      "title": "All skeleton files and directories (typically in /etc/skel) must be owned by bin.",
      "description": "If the skeleton files are not protected, unauthorized personnel could change user startup parameters and possibly jeopardize user files.  Failure to give ownership of sensitive files or utilities to bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-11985",
      "title": "All global initialization files executable search paths must contain only authorized paths.",
      "description": "The executable search path (typically the PATH environment variable) contains a list of directories for the shell to search to find executables. If this path includes the current working directory or other relative paths, executables in these directories may be executed instead of system commands. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-11986",
      "title": "All local initialization files executable search paths must contain only authorized paths.",
      "description": "The executable search path (typically the PATH environment variable) contains a list of directories for the shell to search to find executables. If this path includes the current working directory or other relative paths, executables in these directories may be executed instead of system commands. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-11987",
      "title": "The .rhosts, .shosts, hosts.equiv, shosts.equiv, /etc/passwd, /etc/shadow, and/or /etc/group files must not contain a plus (+) without defining entries for NIS+ netgroups.",
      "description": "A plus (+) in system accounts' files causes the system to lookup the specified entry using NIS.  If the system is not using NIS, no such entries should exist.",
      "severity": "medium"
    },
    {
      "id": "V-11988",
      "title": "There must be no .rhosts, .shosts, hosts.equiv, or shosts.equiv files on the system.",
      "description": "The .rhosts, .shosts, hosts.equiv, and shosts.equiv files are used to configure host-based authentication for individual users or the system.  Host-based authentication is not sufficient for preventing unauthorized access to the system.",
      "severity": "high"
    },
    {
      "id": "V-11989",
      "title": "The .rhosts file must not be supported in PAM.",
      "description": "The .rhosts files are used to specify a list of hosts that are permitted remote access to a particular account without authenticating.  The use of such a mechanism defeats strong identification and authentication requirements.",
      "severity": "medium"
    },
    {
      "id": "V-11990",
      "title": "All public directories must be group-owned by root or an application group.",
      "description": "If a public directory has the sticky bit set and is not group-owned by a system GID, unauthorized users may be able to modify files created by others.\n\nThe only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage (e.g., /tmp) and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-11994",
      "title": "Crontabs must be owned by root or the crontab creator.",
      "description": "To protect the integrity of scheduled system jobs and prevent malicious modification to these jobs, crontab files must be secured.",
      "severity": "medium"
    },
    {
      "id": "V-11995",
      "title": "Default system accounts (with the exception of root) must not be listed in the cron.allow file or must be included in the cron.deny file, if cron.allow does not exist.",
      "description": "To centralize the management of privileged account crontabs, of the default system accounts, only root may have a crontab.",
      "severity": "medium"
    },
    {
      "id": "V-11996",
      "title": "Process core dumps must be disabled unless needed.",
      "description": "Process core dumps contain the memory in use by the process when it crashed.  Process core dump files can be of significant size and their use can result in file systems filling to capacity, which may result in Denial of Service.  Process core dumps can be useful for software debugging.  ",
      "severity": "low"
    },
    {
      "id": "V-11997",
      "title": "The kernel core dump data directory must be owned by root.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash.  As the system memory may contain sensitive information, it must be protected accordingly. If the kernel core dump data directory is not owned by root, the core dumps contained in the directory may be subject to unauthorized access.",
      "severity": "low"
    },
    {
      "id": "V-11999",
      "title": "The system must implement non-executable program stacks.",
      "description": "A common type of exploit is the stack buffer overflow.  An application receives, from an attacker, more data than it is prepared for and stores this information on its stack, writing beyond the space reserved for it.  This can be designed to cause execution of the data written on the stack.  One mechanism to mitigate this vulnerability is for the system to not allow the execution of instructions in sections of memory identified as part of the stack.",
      "severity": "medium"
    },
    {
      "id": "V-12001",
      "title": "The system must use initial TCP sequence numbers most resistant to sequence number guessing attacks.",
      "description": "One use of initial TCP sequence numbers is to verify bidirectional communication between two hosts, which provides some protection against spoofed source addresses being used by the connection originator.  If the initial TCP sequence numbers for a host can be determined by an attacker, it may be possible to establish a TCP connection from a spoofed source address without bidirectional communication.",
      "severity": "medium"
    },
    {
      "id": "V-12002",
      "title": "The system must not forward IPv4 source-routed packets.",
      "description": "Source-routed packets allow the source of the packet to suggest that routers forward the packet along a different path than configured on the router, which can be used to bypass network security measures.  This requirement applies only to the forwarding of source-routed traffic, such as when IPv4 forwarding is enabled and the system is functioning as a router.",
      "severity": "medium"
    },
    {
      "id": "V-12003",
      "title": "A separate file system must be used for user home directories (such as /home or equivalent).",
      "description": "The use of separate file systems for different paths can protect the system from failures resulting from a file system becoming full or failing.",
      "severity": "low"
    },
    {
      "id": "V-12004",
      "title": "The system must log authentication informational data.",
      "description": "Monitoring and recording successful and unsuccessful logins assists in tracking unauthorized access to the system.",
      "severity": "medium"
    },
    {
      "id": "V-12005",
      "title": "Inetd and xinetd must be disabled or removed if no network services utilizing them are enabled.",
      "description": "Unnecessary services should be disabled to decrease the attack surface of the system.",
      "severity": "medium"
    },
    {
      "id": "V-12006",
      "title": "The SMTP service HELP command must not be enabled.",
      "description": "The HELP command should be disabled to mask version information. The version of the SMTP service software could be used by attackers to target vulnerabilities present in specific software versions.",
      "severity": "medium"
    },
    {
      "id": "V-12010",
      "title": "Unencrypted FTP must not be used on the system.",
      "description": "FTP is typically unencrypted and, therefore, presents confidentiality and integrity risks.  FTP may be protected by encryption in certain cases, such as when used in a Kerberos environment.   SFTP and FTPS are encrypted alternatives to FTP.",
      "severity": "medium"
    },
    {
      "id": "V-12011",
      "title": "All FTP users must have a default umask of 077.",
      "description": "The umask controls the default access mode assigned to newly created files.  An umask of 077 limits new files to mode 700 or less permissive.  Although umask is stored as a 4-digit number, the first digit representing special access modes is typically ignored or required to be 0.",
      "severity": "medium"
    },
    {
      "id": "V-12014",
      "title": "All .Xauthority files must have mode 0600 or less permissive.",
      "description": ".Xauthority files ensure the user is authorized to access the specific X Windows host.  Excessive permissions may permit unauthorized modification of these files, which could lead to Denial of Service to authorized access or allow unauthorized access to be obtained.",
      "severity": "medium"
    },
    {
      "id": "V-12016",
      "title": ".Xauthority or X*.hosts (or equivalent) file(s) must be used to restrict access to the X server.",
      "description": "If access to the X server is not restricted, a user's X session may be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-12017",
      "title": "The .Xauthority utility must only permit access to authorized hosts.",
      "description": "If unauthorized clients are permitted access to the X server, a user's X session may be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-12018",
      "title": "X Window System connections that are not required must be disabled.",
      "description": "If unauthorized clients are permitted access to the X server, a user's X session may be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-12019",
      "title": "The snmpd.conf files must be owned by root.",
      "description": "The snmpd.conf files contain authenticators and must be protected from unauthorized access and modification.  If the files are not owned by root, they may be subject to access and modification from unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-12020",
      "title": "The system must not be used as a syslog server (log host) for systems external to the enclave.",
      "description": "Syslog messages are typically unencrypted and may contain sensitive information and are, therefore, restricted to the enclave.",
      "severity": "medium"
    },
    {
      "id": "V-12021",
      "title": "The syslog daemon must not accept remote messages unless it is a syslog server documented using site-defined procedures.",
      "description": "Unintentionally running a syslog server accepting remote messages puts the system at increased risk.  Malicious syslog messages sent to the server could exploit vulnerabilities in the server software itself, could introduce misleading information in to the system's logs, or could fill the system's storage leading to a Denial of Service.",
      "severity": "medium"
    },
    {
      "id": "V-12022",
      "title": "The SSH daemon must be configured for IP filtering.",
      "description": "The SSH daemon must be configured for IP filtering to provide a layered defense against connection attempts from unauthorized addresses.",
      "severity": "medium"
    },
    {
      "id": "V-12023",
      "title": "IP forwarding for IPv4 must not be enabled, unless the system is a router.",
      "description": "If the system is configured for IP forwarding and is not a designated router, it could be used to bypass network security by providing a path for communication not filtered by network devices.",
      "severity": "medium"
    },
    {
      "id": "V-12024",
      "title": "The system must not have a public Instant Messaging (IM) client installed.",
      "description": "Public Instant Messaging (IM) systems are not approved for use and may result in the unauthorized distribution of information. IM clients provide a way for a user to send a message to one or more other users in real time. Additional capabilities may include file transfer and support for distributed game playing. Communication between clients and associated directory services are managed through messaging servers. Commercial IM clients include AOL Instant Messenger (AIM), MSN Messenger, and Yahoo! Messenger.\n\nIM clients present a security issue when the clients route messages through public servers. The obvious implication is potentially sensitive information could be intercepted or altered in the course of transmission. This same issue is associated with the use of public email servers. In order to reduce the potential for disclosure of sensitive Government information and to ensure the validity of official government information, IM clients connecting to public IM services will not be installed. Clients used to access internal or DoD-controlled IM services are permitted.",
      "severity": "medium"
    },
    {
      "id": "V-12025",
      "title": "The system must not have any peer-to-peer file-sharing application installed.",
      "description": "Peer-to-peer file-sharing software can result in the unintentional exfiltration of information.  There are also many legal issues associated with these types of utilities including copyright infringement or other intellectual property issues.  The ASD Memo \"Use of Peer-to-Peer (P2P) File-Sharing Applications across the DoD\" states the following:\n\n“P2P file-sharing applications are authorized for use on DoD networks with approval by the appropriate Designated Approval Authority (DAA).  Documented requirements, security architecture, configuration management process, and a training program for users are all requirements within the approval process.  The unauthorized use of application or services, including P2P applications, is prohibited, and such applications or services must be eliminated.”\n\nP2P applications include, but are not limited to, the following:\n\n-Napster,\n-Kazaa,\n-ARES,\n-Limewire,\n-IRC Chat Relay, and\n-BitTorrent.",
      "severity": "medium"
    },
    {
      "id": "V-12026",
      "title": "NIS maps must be protected through hard-to-guess domain names.",
      "description": "The use of hard-to-guess NIS domain names provides additional protection from unauthorized access to the NIS directory information.",
      "severity": "medium"
    },
    {
      "id": "V-12028",
      "title": "The system vulnerability assessment tool, host-based intrusion detection tool, and file integrity tool must notify the SA and the IAO of a security breach or a suspected security breach.",
      "description": "Timely notifications of potential security compromises minimize the potential damage.\n\nMinimally, the system must log these events and the SA and the IAO will receive the notifications during the daily system log review.  If feasible, active alerting (such as email or paging) should be employed consistent with the site’s established operations management systems and procedures.",
      "severity": "medium"
    },
    {
      "id": "V-12030",
      "title": "The system's access control program must be configured to grant or deny system access to specific hosts.",
      "description": "If the system's access control program is not configured with appropriate rules for allowing and denying access to system network resources, services may be accessible to unauthorized hosts.",
      "severity": "medium"
    },
    {
      "id": "V-12031",
      "title": "The nosuid option must be configured in the /etc/rmmount.conf file.",
      "description": "The rmmount.conf file controls the mounting of removable media on a Solaris system. Removable media is not to be trusted with privileged access, and therefore the filesystems must be mounted with the nosuid option, which prevents any executables with the setuid bit set on this filesystem from running with owner privileges.",
      "severity": "medium"
    },
    {
      "id": "V-12032",
      "title": "Hidden extended file attributes must not exist on the system.",
      "description": "Solaris extended attributes are essentially files themselves that are of an arbitrary size and content.  They could be used to hide files from ordinary system file scans.",
      "severity": "medium"
    },
    {
      "id": "V-12033",
      "title": "The root account must be the only account with GID of 0.",
      "description": "Accounts with a GID of 0 have root group privileges.",
      "severity": "high"
    },
    {
      "id": "V-12049",
      "title": "Network analysis tools must not be installed.",
      "description": "Network analysis tools allow for the capture of network traffic visible to the system.",
      "severity": "medium"
    },
    {
      "id": "V-12765",
      "title": "The system must use a virus scan program.",
      "description": "Virus scanning software can be used to protect a system from penetration by computer viruses and to limit their spread through intermediate systems.",
      "severity": "medium"
    },
    {
      "id": "V-22290",
      "title": "The system clock must be synchronized continuously.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  Internal system clocks tend to drift and require periodic resynchronization to ensure their accuracy.  Software, such as NTPD, can be used to continuously synchronize the system clock with authoritative sources.  Alternatively, the system may be synchronized periodically, with a maximum of one day between synchronizations.\n\nIf the system is completely isolated (no connections to networks or other systems), time synchronization is not required as no correlation of events or operation of time-dependent protocols between systems will be necessary. If the system is completely isolated, this requirement is not applicable.",
      "severity": "medium"
    },
    {
      "id": "V-22291",
      "title": "The system must use at least two time sources for clock synchronization.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  For redundancy, two time sources are required so synchronization continues to function if one source fails.  \n\nIf the system is completely isolated (no connections to networks or other systems), time synchronization is not required as no correlation of events or operation of time-dependent protocols between systems will be necessary.  If the system is completely isolated, this requirement is not applicable.\n\nNOTE:  For the Network Time Protocol (NTP), the requirement is two servers, but it is recommended to configure at least four distinct time servers which allow NTP to effectively exclude a time source not consistent with the others.  The system's local clock must be excluded from the count of time sources.",
      "severity": "medium"
    },
    {
      "id": "V-22292",
      "title": "The system must use time sources local to the enclave.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  The network architecture should provide multiple time servers within an enclave that provide local service to the enclave and synchronize with time sources outside of the enclave.\n\nIf this server is an enclave time server, this requirement is not applicable.\n\nIf the system is completely isolated (no connections to networks or other systems), time synchronization is not required as no correlation of events or operation of time-dependent protocols between systems will be necessary.  If the system is completely isolated, this requirement is not applicable.",
      "severity": "low"
    },
    {
      "id": "V-22294",
      "title": "The time synchronization configuration file (such as /etc/ntp.conf) must be owned by root.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised.  If the configuration files controlling time synchronization are not owned by a system account, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-22295",
      "title": "The time synchronization configuration file (such as /etc/ntp.conf) must be group-owned by root, bin, or sys.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised.  If the configuration files controlling time synchronization are not owned by a system group, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-22296",
      "title": "The time synchronization configuration file (such as /etc/ntp.conf) must have mode 0640 or less permissive.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised.  If the configuration files controlling time synchronization are not protected, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-22297",
      "title": "The time synchronization configuration file (such as /etc/ntp.conf) must not have an extended ACL.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems.  If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised.  If the configuration files controlling time synchronization are not protected, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-22299",
      "title": "The system must display the date and time of the last successful account login upon login.",
      "description": "Providing users with feedback on when account accesses last occurred facilitates user recognition and reporting of unauthorized account use.",
      "severity": "low"
    },
    {
      "id": "V-22301",
      "title": "The system must display a publicly-viewable pattern during a graphical desktop environment session lock.",
      "description": "To protect the on-screen content of a session, it must be replaced with a publicly-viewable pattern upon session lock. Examples of publicly viewable patterns include screen saver patterns, photographic images, solid colors, or a blank screen, so long as none of those patterns convey sensitive information.\n\nThis requirement applies to graphical desktop environments provided by the system to locally attached displays and input devices, as well as, to graphical desktop environments provided to remote systems using remote access protocols.",
      "severity": "low"
    },
    {
      "id": "V-22302",
      "title": "The system must enforce compliance of the entire password during authentication.",
      "description": "Some common password hashing schemes only process the first eight characters of a user's password, which reduces the effective strength of the password.",
      "severity": "medium"
    },
    {
      "id": "V-22303",
      "title": "The system must use a FIPS 140-2 approved cryptographic hashing algorithm for generating account password hashes.",
      "description": "Systems must employ cryptographic hashes for passwords using the SHA-2 family of algorithms or FIPS 140-2 approved successors. The use of unapproved algorithms may result in weak password hashes more vulnerable to compromise.",
      "severity": "medium"
    },
    {
      "id": "V-22304",
      "title": "The password hashes stored on the system must have been generated using a FIPS 140-2 approved cryptographic hashing algorithm.",
      "description": "Systems must employ cryptographic hashes for passwords using the SHA-2 family of algorithms or FIPS 140-2 approved successors. The use of unapproved algorithms may result in weak password hashes more vulnerable to compromise.",
      "severity": "medium"
    },
    {
      "id": "V-22306",
      "title": "The system must require at least eight characters be changed between the old and new passwords during a password change.",
      "description": "To ensure password changes are effective in their goals, the system must ensure old and new passwords have significant differences.  Without significant changes, new passwords may be easily guessed based on the value of a previously compromised password.",
      "severity": "medium"
    },
    {
      "id": "V-22307",
      "title": "The system must prevent the use of dictionary words for passwords.",
      "description": "An easily guessable password provides an open door to any external or internal malicious intruder.  Many computer compromises occur as the result of account name and password guessing.  This is generally done by someone with an automated script using repeated logon attempts until the correct account and password pair is guessed.  Utilities, such as cracklib, can be used to validate passwords are not dictionary words and meet other criteria during password changes.",
      "severity": "medium"
    },
    {
      "id": "V-22308",
      "title": "The system must restrict the ability to switch to the root user to members of a defined group.",
      "description": "Configuring a supplemental group for users permitted to switch to the root user prevents unauthorized users from accessing the root account, even with knowledge of the root credentials.",
      "severity": "low"
    },
    {
      "id": "V-22309",
      "title": "The root account's home directory must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.",
      "severity": "medium"
    },
    {
      "id": "V-22310",
      "title": "The root account's library search path must be the system default and must contain only absolute paths.",
      "description": "The library search path environment variable(s) contain a list of directories for the dynamic linker to search to find libraries.  If this path includes the current working directory or other relative paths, libraries in these directories may be loaded instead of system libraries.  This variable is formatted as a colon-separated list of directories.  If there is an empty entry, such as a leading or trailing colon or two consecutive colons, this is interpreted as the current working directory.  Entries starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22311",
      "title": "The root account's list of preloaded libraries must be empty.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary.  If this list contains paths to libraries relative to the current working directory, unintended libraries may be preloaded.  This variable is formatted as a space-separated list of libraries.  Paths starting with (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22312",
      "title": "All files and directories must have a valid group-owner.",
      "description": "Files without a valid group-owner may be unintentionally inherited if a group is assigned the same GID as the GID of the files without a valid group-owner.",
      "severity": "medium"
    },
    {
      "id": "V-22313",
      "title": "All network services daemon files must not have extended ACLs.",
      "description": "Restricting permission on daemons will protect them from unauthorized modification and possible system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-22314",
      "title": "All system command files must not have extended ACLs.",
      "description": "Restricting permissions will protect system command files from unauthorized modification.  System command files include files present in directories used by the operating system for storing default system executables and files present in directories included in the system's default executable search paths.",
      "severity": "medium"
    },
    {
      "id": "V-22315",
      "title": "System log files must not have extended ACLs, except as needed to support authorized software.",
      "description": "If the system log files are not protected, unauthorized users could change the logged data, eliminating its forensic value.  Authorized software may be given log file access through the use of extended ACLs when needed and configured to provide the least privileges required.",
      "severity": "medium"
    },
    {
      "id": "V-22316",
      "title": "All manual page files must not have extended ACLs.",
      "description": "If manual pages are compromised, misleading information could be inserted, causing actions that may compromise the system.",
      "severity": "low"
    },
    {
      "id": "V-22317",
      "title": "All library files must not have extended ACLs.",
      "description": "Unauthorized access could destroy the integrity of the library files.",
      "severity": "medium"
    },
    {
      "id": "V-22318",
      "title": "NIS/NIS+/yp command files must not have extended ACLs.",
      "description": "NIS/NIS+/yp files are part of the system's identification and authentication processes and are, therefore, critical to system security.  ACLs on these files could result in unauthorized modification, which could compromise these processes and the system.  ",
      "severity": "medium"
    },
    {
      "id": "V-22319",
      "title": "The /etc/resolv.conf file must be owned by root.",
      "description": "The resolv.conf (or equivalent) file configures the system's DNS resolver.  DNS is used to resolve host names to IP addresses.  If DNS configuration is modified maliciously, host name resolution may fail or return incorrect information.  DNS may be used by a variety of system security functions, such as time synchronization, centralized authentication, and remote system logging.\n",
      "severity": "medium"
    },
    {
      "id": "V-22320",
      "title": "The /etc/resolv.conf file must be group-owned by root, bin, or sys.",
      "description": "The resolv.conf (or equivalent) file configures the system's DNS resolver.  DNS is used to resolve host names to IP addresses.  If DNS configuration is modified maliciously, host name resolution may fail or return incorrect information.  DNS may be used by a variety of system security functions such as time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22321",
      "title": "The /etc/resolv.conf file must have mode 0644 or less permissive.\n",
      "description": "The resolv.conf (or equivalent) file configures the system's DNS resolver.  DNS is used to resolve host names to IP addresses.  If DNS configuration is modified maliciously, host name resolution may fail or return incorrect information.  DNS may be used by a variety of system security functions, such as time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22322",
      "title": "The /etc/resolv.conf file must not have an extended ACL.",
      "description": "The resolv.conf (or equivalent) file configures the system's DNS resolver.  DNS is used to resolve host names to IP addresses.  If DNS configuration is modified maliciously, host name resolution may fail or return incorrect information.  DNS may be used by a variety of system security functions such as time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22323",
      "title": "The /etc/hosts file must be owned by root.",
      "description": "The /etc/hosts file (or equivalent) configures local host name to IP address mappings that typically take precedence over DNS resolution.  If this file is maliciously modified, it could cause the failure or compromise of security functions requiring name resolution, which may include time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22324",
      "title": "The /etc/hosts file must be group-owned by root, bin, or sys.",
      "description": "The /etc/hosts file (or equivalent) configures local host name to IP address mappings that typically take precedence over DNS resolution.  If this file is maliciously modified, it could cause the failure or compromise of security functions requiring name resolution, which may include time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22325",
      "title": "The /etc/hosts file must have mode 0644 or less permissive.",
      "description": "The /etc/hosts file (or equivalent) configures local host name to IP address mappings that typically take precedence over DNS resolution.  If this file is maliciously modified, it could cause the failure or compromise of security functions requiring name resolution, which may include time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22326",
      "title": "The /etc/hosts file must not have an extended ACL.",
      "description": "The /etc/hosts file (or equivalent) configures local host name to IP address mappings that typically take precedence over DNS resolution.  If this file is maliciously modified, it could cause the failure or compromise of security functions requiring name resolution, which may include time synchronization, centralized authentication, and remote system logging.",
      "severity": "medium"
    },
    {
      "id": "V-22327",
      "title": "The /etc/nsswitch.conf file must be owned by root.",
      "description": "The nsswitch.conf file (or equivalent) configures the source of a variety of system security information including account, group, and host lookups.  Malicious changes could prevent the system from functioning or compromise system security.",
      "severity": "medium"
    },
    {
      "id": "V-22328",
      "title": "The /etc/nsswitch.conf file must be group-owned by root, bin, or sys.",
      "description": "The nsswitch.conf file (or equivalent) configures the source of a variety of system security information including account, group, and host lookups.  Malicious changes could prevent the system from functioning or compromise system security.",
      "severity": "medium"
    },
    {
      "id": "V-22329",
      "title": "The /etc/nsswitch.conf file must have mode 0644 or less permissive.",
      "description": "The nsswitch.conf file (or equivalent) configures the source of a variety of system security information including account, group, and host lookups.  Malicious changes could prevent the system from functioning or compromise system security.",
      "severity": "medium"
    },
    {
      "id": "V-22330",
      "title": "The /etc/nsswitch.conf file must not have an extended ACL.",
      "description": "The nsswitch.conf file (or equivalent) configures the source of a variety of system security information including account, group, and host lookups.  Malicious changes could prevent the system from functioning or compromise system security.",
      "severity": "medium"
    },
    {
      "id": "V-22332",
      "title": "The /etc/passwd file must be owned by root.",
      "description": "The /etc/passwd file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22333",
      "title": "The /etc/passwd file must be group-owned by root, bin, or sys.",
      "description": "The /etc/passwd file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22334",
      "title": "The /etc/passwd file must not have an extended ACL.",
      "description": "File system ACLs can provide access to files beyond what is allowed by the mode numbers of the files.  The /etc/passwd file contains the list of local system accounts. It is vital to system security and must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22335",
      "title": "The /etc/group file must be owned by root.",
      "description": "The /etc/group file is critical to system security and must be owned by a privileged user.  The group file contains a list of system groups and associated information.",
      "severity": "medium"
    },
    {
      "id": "V-22336",
      "title": "The /etc/group file must be group-owned by root, bin, or sys.",
      "description": "The /etc/group file is critical to system security and must be protected from unauthorized modification.  The group file contains a list of system groups and associated information.",
      "severity": "medium"
    },
    {
      "id": "V-22337",
      "title": "The /etc/group file must have mode 0644 or less permissive.",
      "description": "The /etc/group file is critical to system security and must be protected from unauthorized modification.  The group file contains a list of system groups and associated information.",
      "severity": "medium"
    },
    {
      "id": "V-22338",
      "title": "The /etc/group file must not have an extended ACL.",
      "description": "The /etc/group file is critical to system security and must be protected from unauthorized modification.  The group file contains a list of system groups and associated information.",
      "severity": "medium"
    },
    {
      "id": "V-22339",
      "title": "The /etc/shadow file (or equivalent) must be group-owned by root, bin, or sys.",
      "description": "The /etc/shadow file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.  The file also contains password hashes which must not be accessible to users other than root.",
      "severity": "medium"
    },
    {
      "id": "V-22340",
      "title": "The /etc/shadow file must not have an extended ACL.\n",
      "description": "The /etc/shadow file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.  The file also contains password hashes which must not be accessible to users other than root.",
      "severity": "medium"
    },
    {
      "id": "V-22347",
      "title": "The /etc/passwd file must not contain password hashes.",
      "description": "If password hashes are readable by non-administrators, the passwords are subject to attack through lookup tables or cryptographic weaknesses in the hashes.",
      "severity": "medium"
    },
    {
      "id": "V-22348",
      "title": "The /etc/group file must not contain any group password hashes.",
      "description": "Group passwords are typically shared and should not be used.  Additionally, if password hashes are readable by non-administrators, the passwords are subject to attack through lookup tables or cryptographic weaknesses in the hashes.",
      "severity": "medium"
    },
    {
      "id": "V-22350",
      "title": "User's home directories must not have extended ACLs.",
      "description": "Excessive permissions on home directories allow unauthorized access to user's files.",
      "severity": "low"
    },
    {
      "id": "V-22351",
      "title": "All files and directories contained in user home directories must be group-owned by a group of which the home directory's owner is a member.",
      "description": "If a user's files are group-owned by a group of which the user is not a member, unintended users may be able to access them.",
      "severity": "medium"
    },
    {
      "id": "V-22352",
      "title": "All files and directories contained in user home directories must not have extended ACLs.",
      "description": "Excessive permissions allow unauthorized access to user files.",
      "severity": "medium"
    },
    {
      "id": "V-22353",
      "title": "All run control scripts must have no extended ACLs.",
      "description": "If the startup files are writable by other users, they could modify the startup files to insert malicious commands into the startup files.",
      "severity": "medium"
    },
    {
      "id": "V-22354",
      "title": "Run control scripts lists of preloaded libraries must contain only authorized paths.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries to the current working directory that have not been authorized, unintended libraries may be preloaded. This variable is formatted as a space-separated list of libraries. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22355",
      "title": "Run control scripts lists of preloaded libraries must contain only authorized paths.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries to the current working directory that have not been authorized, unintended libraries may be preloaded. This variable is formatted as a space-separated list of libraries. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22356",
      "title": "All global initialization files must not have extended ACLs.",
      "description": "Global initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-22357",
      "title": "Skeleton files must not have extended ACLs.",
      "description": "If the skeleton files are not protected, unauthorized personnel could change user's startup parameters and possibly jeopardize user's files.",
      "severity": "medium"
    },
    {
      "id": "V-22358",
      "title": "All skeleton files (typically in /etc/skel) must be group-owned by root, bin, or sys.",
      "description": "If the skeleton files are not protected, unauthorized personnel could change user startup parameters and possibly jeopardize user files.",
      "severity": "medium"
    },
    {
      "id": "V-22359",
      "title": "Global initialization files library search paths must contain only authorized paths.",
      "description": "The library search path environment variable(s) contain a list of directories for the dynamic linker to search to find libraries. If this path includes the current working directory or other relative paths, libraries in these directories may be loaded instead of system libraries. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22360",
      "title": "Global initialization files lists of preloaded libraries must contain only authorized paths.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries to the current working directory that have not been authorized, unintended libraries may be preloaded. This variable is formatted as a space-separated list of libraries. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22361",
      "title": "Local initialization files must be group-owned by the user's primary group or root.",
      "description": "Local initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-22362",
      "title": "Local initialization files must not have extended ACLs.",
      "description": "Local initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-22363",
      "title": "Local initialization files library search paths must contain only authorized paths.",
      "description": "The library search path environment variable(s) contain a list of directories for the dynamic linker to search to find libraries. If this path includes the current working directory or other relative paths, libraries in these directories may be loaded instead of system libraries. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22364",
      "title": "Local initialization files lists of preloaded libraries must contain only authorized paths.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary If this list contains paths to libraries to the current working directory that have not been authorized, unintended libraries may be preloaded. This variable is formatted as a space-separated list of libraries. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-22365",
      "title": "All shell files must be group-owned by root, bin, or sys.",
      "description": "If shell files are group-owned by users other than root or a system group, they could be modified by intruders or malicious users to perform unauthorized actions.",
      "severity": "medium"
    },
    {
      "id": "V-22366",
      "title": "All shell files must not have extended ACLs.",
      "description": "Shells with world/group write permissions give the ability to maliciously modify the shell to obtain unauthorized access.",
      "severity": "medium"
    },
    {
      "id": "V-22367",
      "title": "Audio devices must not have extended ACLs.",
      "description": "File system ACLs can provide access to files beyond what is allowed by the mode numbers of the files.",
      "severity": "medium"
    },
    {
      "id": "V-22369",
      "title": "All system audit files must not have extended ACLs.",
      "description": "If a user can write to the audit logs, then audit trails can be modified or destroyed and system intrusion may not be detected.",
      "severity": "medium"
    },
    {
      "id": "V-22370",
      "title": "System audit tool executables must be owned by root.",
      "description": "To prevent unauthorized access or manipulation of system audit logs, the tools for manipulating those logs must be protected.",
      "severity": "low"
    },
    {
      "id": "V-22371",
      "title": "System audit tool executables must be group-owned by root, bin, or sys.",
      "description": "To prevent unauthorized access or manipulation of system audit logs, the tools for manipulating those logs must be protected.",
      "severity": "low"
    },
    {
      "id": "V-22372",
      "title": "System audit tool executables must have mode 0750 or less permissive.",
      "description": "To prevent unauthorized access or manipulation of system audit logs, the tools for manipulating those logs must be protected.",
      "severity": "low"
    },
    {
      "id": "V-22373",
      "title": "System audit tool executables must not have extended ACLs.",
      "description": "To prevent unauthorized access or manipulation of system audit logs, the tools for manipulating those logs must be protected.",
      "severity": "low"
    },
    {
      "id": "V-22374",
      "title": "The audit system must alert the SA in the event of an audit processing failure.",
      "description": "An accurate and current audit trail is essential for maintaining \na record of system activity. If the system fails, the SA must be notified and must take prompt \naction to correct the problem.\n\nMinimally, the system must log this event and the SA will receive this notification during the \ndaily system log review. If feasible, active alerting (such as email or paging) should be \nemployed consistent with the site’s established operations management systems and procedures.\n",
      "severity": "low"
    },
    {
      "id": "V-22375",
      "title": "The audit system must alert the SA when the audit storage volume approaches its capacity.",
      "description": "An accurate and current audit trail is essential for maintaining a record of system activity.  If the system fails, the SA must be notified and must take prompt action to correct the problem.\n\nMinimally, the system must log this event and the SA will receive this notification during the daily system log review.  If feasible, active alerting (such as email or paging) should be employed consistent with the site’s established operations management systems and procedures.",
      "severity": "medium"
    },
    {
      "id": "V-22376",
      "title": "The audit system must be configured to audit account creation.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises, and damages incurred during a system compromise.",
      "severity": "low"
    },
    {
      "id": "V-22377",
      "title": "The audit system must be configured to audit account modification.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.",
      "severity": "low"
    },
    {
      "id": "V-22378",
      "title": "The audit system must be configured to audit account disabling.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.",
      "severity": "low"
    },
    {
      "id": "V-22382",
      "title": "The audit system must be configured to audit account termination.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.",
      "severity": "low"
    },
    {
      "id": "V-22383",
      "title": "The audit system must be configured to audit the loading and unloading of dynamic kernel modules.",
      "description": "Actions concerning dynamic kernel modules must be recorded as they are substantial events.  Dynamic kernel modules can increase the attack surface of a system.  A malicious kernel module can be used to substantially alter the functioning of a system, often with the purpose of hiding a compromise from the SA.",
      "severity": "medium"
    },
    {
      "id": "V-22384",
      "title": "The cron.allow file must not have an extended ACL.",
      "description": "A cron.allow file that is readable and/or writable by other than root could allow potential intruders and malicious users to use the file contents to help discern information, such as who is allowed to execute cron programs, which could be harmful to overall system and network security.",
      "severity": "medium"
    },
    {
      "id": "V-22385",
      "title": "Crontab files must be group-owned by root, sys, or the crontab creator's primary group.",
      "description": "To protect the integrity of scheduled system jobs and prevent malicious modification to these jobs, crontab files must be secured.",
      "severity": "medium"
    },
    {
      "id": "V-22386",
      "title": "Crontab files must not have extended ACLs.",
      "description": "To protect the integrity of scheduled system jobs and to prevent malicious modification to these jobs, crontab files must be secured.  ACLs on crontab files may provide unauthorized access to the files.",
      "severity": "medium"
    },
    {
      "id": "V-22387",
      "title": "Cron and crontab directories must not have extended ACLs.",
      "description": "To protect the integrity of scheduled system jobs and to prevent malicious modification to these jobs, crontab files must be secured.  ACLs on cron and crontab directories may provide unauthorized access to these directories.  Unauthorized modifications to these directories or their contents may result in the addition of unauthorized cron jobs or deny service to authorized cron jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22388",
      "title": "The cron log files must not have extended ACLs.",
      "description": "Cron logs contain reports of scheduled system activities and must be protected from unauthorized access or manipulation.",
      "severity": "medium"
    },
    {
      "id": "V-22389",
      "title": "The cron.deny file must not have an extended ACL.",
      "description": "If file permissions for cron.deny are more permissive than 0700, sensitive information could be viewed or edited by unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22390",
      "title": "The at.allow file must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.  Unauthorized modification of the at.allow file could result in Denial of Service to authorized at users and the granting of the ability to run at jobs to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22391",
      "title": "The cron.allow file must be group-owned by root, bin, or sys.",
      "description": "If the group of the cron.allow is not set to root, bin, or sys, the possibility exists for an unauthorized user to view or edit the list of users permitted to use cron.  Unauthorized modification of this file could cause Denial of Service to authorized cron users or provide unauthorized users with the ability to run cron jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22392",
      "title": "The at.deny file must have mode 0600 or less permissive.",
      "description": "The at daemon control files restrict access to scheduled job manipulation and must be protected.  Unauthorized modification of the at.deny file could result in Denial of Service to authorized at users or provide unauthorized users with the ability to run at jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22393",
      "title": "The at.deny file must not have an extended ACL.",
      "description": "The \"at\" daemon control files restrict access to scheduled job manipulation and must be protected.  Unauthorized modification of the at.deny file could result in Denial of Service to authorized \"at\" users or provide unauthorized users with the ability to run \"at\" jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22394",
      "title": "The cron.deny file must be group-owned by root, bin, or sys.",
      "description": "Cron daemon control files restrict the scheduling of automated tasks and must be protected.  Unauthorized modification of the cron.deny file could result in Denial of Service to authorized cron users or could provide unauthorized users with the ability to run cron jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22395",
      "title": "The \"at\" directory must not have an extended ACL.",
      "description": "If the \"at\" directory has an extended ACL, unauthorized users could be allowed to view or to edit files containing sensitive information within the \"at\" directory.  Unauthorized modifications could result in Denial of Service to authorized \"at\" jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22396",
      "title": "The \"at\" directory must be group-owned by root, bin, or sys.",
      "description": "If the \"at\" directory's group owner is not root, bin, or sys, unauthorized users could be allowed to view or edit files containing sensitive information within the directory.",
      "severity": "medium"
    },
    {
      "id": "V-22397",
      "title": "The at.allow file must be group-owned by root, bin, or sys.",
      "description": "If the group owner of the at.allow file is not set to root, bin, or sys, unauthorized users could be allowed to view or edit the list of users permitted to run at jobs.  Unauthorized modification could result in Denial of Service to authorized at users or provide unauthorized users with the ability to run at jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22398",
      "title": "The at.deny file must be group-owned by root, bin, or sys.",
      "description": "If the group owner of the at.deny file is not set to root, bin, or sys, unauthorized users could be allowed to view or edit sensitive information contained within the file.  Unauthorized modification could result in Denial of Service to authorized \"at\" users or provide unauthorized users with the ability to run \"at\" jobs.",
      "severity": "medium"
    },
    {
      "id": "V-22399",
      "title": "The system must be configured to store any process core dumps in a specific, centralized directory.",
      "description": "Specifying a centralized location for core file creation allows for the centralized protection of core files.  Process core dumps contain the memory in use by the process when it crashed.  Any data the process was handling may be contained in the core file, and it must be protected accordingly.  If process core dump creation is not configured to use a centralized directory, core dumps may be created in a directory that does not have appropriate ownership or permissions configured, which could result in unauthorized access to the core dumps.",
      "severity": "low"
    },
    {
      "id": "V-22400",
      "title": "The centralized process core dump data directory must be owned by root.",
      "description": "Process core dumps contain the memory in use by the process when it crashed.  Any data the process was handling may be contained in the core file, and it must be protected accordingly.  If the centralized process core dump data directory is not owned by root, the core dumps contained in the directory may be subject to unauthorized access.",
      "severity": "low"
    },
    {
      "id": "V-22401",
      "title": "The centralized process core dump data directory must be group-owned by root, bin, or sys.",
      "description": "Process core dumps contain the memory in use by the process when it crashed.  Any data the process was handling may be contained in the core file, and it must be protected accordingly.  If the centralized process core dump data directory is not group-owned by a system group, the core dumps contained in the directory may be subject to unauthorized access.",
      "severity": "low"
    },
    {
      "id": "V-22402",
      "title": "The centralized process core dump data directory must have mode 0700 or less permissive.",
      "description": "Process core dumps contain the memory in use by the process when it crashed.  Any data the process was handling may be contained in the core file, and it must be protected accordingly.  If the process core dump data directory has a mode more permissive than 0700, unauthorized users may be able to view or to modify sensitive information contained any process core dumps in the directory.",
      "severity": "low"
    },
    {
      "id": "V-22403",
      "title": "The centralized process core dump data directory must not have an extended ACL.",
      "description": "Process core dumps contain the memory in use by the process when it crashed.  Any data the process was handling may be contained in the core file, and it must be protected accordingly.  If the process core dump data directory has an extended ACL, unauthorized users may be able to view or to modify sensitive information contained any process core dumps in the directory.",
      "severity": "low"
    },
    {
      "id": "V-22404",
      "title": "Kernel core dumps must be disabled unless needed.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash.  Kernel core dumps may consume a considerable amount of disk space and may result in Denial of Service by exhausting the available space on the target file system.  The kernel core dump process may increase the amount of time a system is unavailable due to a crash.  Kernel core dumps can be useful for kernel debugging.",
      "severity": "medium"
    },
    {
      "id": "V-22405",
      "title": "The kernel core dump data directory must be group-owned by root.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash.  As the system memory may contain sensitive information, it must be protected accordingly.  If the kernel core dump data directory is not group-owned by a system group, the core dumps contained in the directory may be subject to unauthorized access.",
      "severity": "low"
    },
    {
      "id": "V-22406",
      "title": "The kernel core dump data directory must have mode 0700 or less permissive.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash.  As the system memory may contain sensitive information, it must be protected accordingly.  If the mode of the kernel core dump data directory is more permissive than 0700, unauthorized users may be able to view or to modify kernel core dump data files.",
      "severity": "low"
    },
    {
      "id": "V-22407",
      "title": "The kernel core dump data directory must not have an extended ACL.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash.  As the system memory may contain sensitive information, it must be protected accordingly.  If there is an extended ACL for the kernel core dump data directory, unauthorized users may be able to view or to modify kernel core dump data files.",
      "severity": "low"
    },
    {
      "id": "V-22409",
      "title": "The system must not process ICMP timestamp requests.",
      "description": "The processing of Internet Control Message Protocol (ICMP) timestamp requests increases the attack surface of the system.",
      "severity": "low"
    },
    {
      "id": "V-22410",
      "title": "The system must not respond to ICMPv4 echoes sent to a broadcast address.",
      "description": "Responding to broadcast Internet Control Message Protocol (ICMP) echoes facilitates network mapping and provides a vector for amplification attacks.",
      "severity": "medium"
    },
    {
      "id": "V-22411",
      "title": "The system must not respond to ICMP timestamp requests sent to a broadcast address.",
      "description": "The processing of Internet Control Message Protocol (ICMP) timestamp requests increases the attack surface of the system.  Responding to broadcast ICMP timestamp requests facilitates network mapping and provides a vector for amplification attacks.",
      "severity": "medium"
    },
    {
      "id": "V-22412",
      "title": "The system must not apply reversed source routing to TCP responses.",
      "description": "Source-routed packets allow the source of the packet to suggest that routers forward the packet along a different path than configured on the router, which can be used to bypass network security measures.",
      "severity": "medium"
    },
    {
      "id": "V-22413",
      "title": "The system must prevent local applications from generating source-routed packets.",
      "description": "Source-routed packets allow the source of the packet to suggest that routers forward the packet along a different path than configured on the router, which can be used to bypass network security measures.",
      "severity": "medium"
    },
    {
      "id": "V-22414",
      "title": "The system must not accept source-routed IPv4 packets.",
      "description": "Source-routed packets allow the source of the packet to suggest that routers forward the packet along a different path than configured on the router, which can be used to bypass network security measures.  This requirement applies only to the handling of source-routed traffic destined to the system itself, not to traffic forwarded by the system to another, such as when IPv4 forwarding is enabled and the system is functioning as a router.",
      "severity": "medium"
    },
    {
      "id": "V-22415",
      "title": "Proxy ARP must not be enabled on the system.",
      "description": "Proxy ARP allows a system to respond to ARP requests on one interface on behalf of hosts connected to another interface.  If this function is enabled when not required, addressing information may be leaked between the attached network segments.",
      "severity": "medium"
    },
    {
      "id": "V-22416",
      "title": "The system must ignore IPv4 ICMP redirect messages.",
      "description": "ICMP redirect messages are used by routers to inform hosts that a more direct route exists for a particular destination. These messages modify the host's route table and are unauthenticated.  An illicit ICMP redirect message could result in a man-in-the-middle attack.",
      "severity": "medium"
    },
    {
      "id": "V-22417",
      "title": "The system must not send IPv4 ICMP redirects.",
      "description": "ICMP redirect messages are used by routers to inform hosts that a more direct route exists for a particular destination.  These messages contain information from the system's route table that could reveal portions of the network topology.",
      "severity": "medium"
    },
    {
      "id": "V-22418",
      "title": "The system must log martian packets.",
      "description": "Martian packets are packets containing addresses known by the system to be invalid.  Logging these messages allows the SA to identify misconfigurations or attacks in progress.",
      "severity": "low"
    },
    {
      "id": "V-22421",
      "title": "The system must not be configured for network bridging.",
      "description": "Some systems have the ability to bridge or switch frames (link-layer forwarding) between multiple interfaces. This can be useful in a variety of situations but, if enabled when not needed, has the potential to bypass network partitioning and security.",
      "severity": "medium"
    },
    {
      "id": "V-22422",
      "title": "All local file systems must employ journaling or another mechanism ensuring file system consistency.",
      "description": "File system journaling, or logging, can allow reconstruction of file system data after a system crash, thus preserving the integrity of data that may have otherwise been lost.  Journaling file systems typically do not require consistent checks upon booting after a crash, which can improve system availability.  Some file systems employ other mechanisms to ensure consistency which also satisfy this requirement.",
      "severity": "low"
    },
    {
      "id": "V-22423",
      "title": "The inetd.conf file must be group-owned by root, bin, or sys.",
      "description": "Failure to give ownership of sensitive files or utilities to system groups may provide unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-22424",
      "title": "The inetd.conf file must not have extended ACLs.",
      "description": "The Internet service daemon configuration files must be protected as malicious modification could cause Denial of Service or increase the attack surface of the system.",
      "severity": "medium"
    },
    {
      "id": "V-22427",
      "title": "The services file must be group-owned by root, bin, or sys.",
      "description": "Failure to give ownership of system configuration files to root or a system group provides the designated owner and unauthorized users with the potential to change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-22428",
      "title": "The services file must not have an extended ACL.",
      "description": "The services file is critical to the proper operation of network services and must be protected from unauthorized modification.  If the services file has an extended ACL, it may be possible for unauthorized users to modify the file.  Unauthorized modification could result in the failure of network services.",
      "severity": "medium"
    },
    {
      "id": "V-22429",
      "title": "The portmap or rpcbind service must not be running unless needed.",
      "description": "The portmap and rpcbind services increase the attack surface of the system and should only be used when needed.  The portmap or rpcbind services are used by a variety of services using remote procedure calls (RPCs).",
      "severity": "medium"
    },
    {
      "id": "V-22430",
      "title": "The portmap or rpcbind service must not be installed unless needed.",
      "description": "The portmap and rpcbind services increase the attack surface of the system and should only be used when needed.  The portmap or rpcbind services are used by a variety of services using Remote Procedure Calls (RPCs).",
      "severity": "medium"
    },
    {
      "id": "V-22431",
      "title": "The rshd service must not be installed.",
      "description": "The rshd process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.",
      "severity": "medium"
    },
    {
      "id": "V-22432",
      "title": "The rlogind service must not be running.",
      "description": "The rlogind process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.",
      "severity": "medium"
    },
    {
      "id": "V-22433",
      "title": "The rlogind service must not be installed.",
      "description": "The rlogind process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.",
      "severity": "medium"
    },
    {
      "id": "V-22434",
      "title": "The rexecd service must not be installed.",
      "description": "The rexecd process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.",
      "severity": "medium"
    },
    {
      "id": "V-22435",
      "title": "The hosts.lpd (or equivalent) file must be group-owned by root, bin, or sys.",
      "description": "Failure to give group ownership of the hosts.lpd (or equivalent) file to root, bin, sys, or system provides the members of the owning group and possible unauthorized users, with the potential to modify it.  Unauthorized modifications could disrupt access to local printers from authorized remote hosts or permit unauthorized remote access to local printers.",
      "severity": "medium"
    },
    {
      "id": "V-22436",
      "title": "The hosts.lpd (or equivalent) file must not have an extended ACL.",
      "description": "Excessive permissions on the hosts.lpd (or equivalent) file may permit unauthorized modification.  Unauthorized modifications could disrupt access to local printers from authorized remote hosts or permit unauthorized remote access to local printers.",
      "severity": "medium"
    },
    {
      "id": "V-22437",
      "title": "The traceroute file must not have an extended ACL.",
      "description": "If an extended ACL exists on the traceroute executable file, it may provide unauthorized users with access to the file.  Malicious code could be inserted by an attacker and triggered whenever the traceroute command is executed by authorized users.  Additionally, if an unauthorized user is granted executable permissions to the traceroute command, it could be used to gain information about the network topology behind the firewall.  This information may allow an attacker to determine trusted routers and other network information possibly leading to system and network compromise.",
      "severity": "medium"
    },
    {
      "id": "V-22438",
      "title": "The aliases file must be group-owned by root, sys, smmsp, or bin.",
      "description": "If the alias file is not group-owned by root or a system group, an unauthorized user may modify the file to add aliases to run malicious code or redirect email.",
      "severity": "medium"
    },
    {
      "id": "V-22439",
      "title": "The alias file must not have an extended ACL.",
      "description": "Excessive permissions on the aliases file may permit unauthorized modification.  If the alias file is modified by an unauthorized user, they may modify the file to run malicious code or redirect email.",
      "severity": "medium"
    },
    {
      "id": "V-22440",
      "title": "Files executed through a mail aliases file must be group-owned by root, bin, or sys, and must reside within a directory group-owned by root, bin, or sys.",
      "description": "If a file executed through a mail aliases file is not group-owned by root or a system group, it may be subject to unauthorized modification.  Unauthorized modification of files executed through aliases may allow unauthorized users to attain root privileges.",
      "severity": "medium"
    },
    {
      "id": "V-22441",
      "title": "Files executed through a mail aliases file must not have extended ACLs.",
      "description": "Excessive permissions on files executed through a mail alias file could result in modification by an unauthorized user, execution of malicious code, and/or system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-22442",
      "title": "The SMTP service log file must not have an extended ACL.",
      "description": "If the SMTP service log file has an extended ACL, unauthorized users may be allowed to access or to modify the log file.",
      "severity": "medium"
    },
    {
      "id": "V-22444",
      "title": "The ftpusers file must be group-owned by root, bin, or sys.",
      "description": "If the ftpusers file is not group-owned by root or a system group, an unauthorized user may modify the file to allow unauthorized accounts to use FTP.",
      "severity": "medium"
    },
    {
      "id": "V-22445",
      "title": "The ftpusers file must not have an extended ACL.",
      "description": "Excessive permissions on the ftpusers file could permit unauthorized modification.  Unauthorized modification could result in Denial of Service to authorized FTP users or permit unauthorized users to access the FTP service.",
      "severity": "medium"
    },
    {
      "id": "V-22446",
      "title": "The .Xauthority files must not have extended ACLs.",
      "description": ".Xauthority files ensure the user is authorized to access the specific X Windows host.  Extended ACLs may permit unauthorized modification of these files, which could lead to Denial of Service to authorized access or allow unauthorized access to be obtained.",
      "severity": "medium"
    },
    {
      "id": "V-22447",
      "title": "The SNMP service must use only SNMPv3 or its successors.",
      "description": "SNMP Versions 1 and 2 are not considered secure. Without the strong authentication and privacy  provided by the SNMP Version 3 User-based Security Model (USM), an attacker or other unauthorized users may gain access to detailed system management information and use the information to launch attacks against the system.",
      "severity": "medium"
    },
    {
      "id": "V-22450",
      "title": "Management Information Base (MIB) files must not have extended ACLs.",
      "description": "The ability to read the MIB file could impart special knowledge to an intruder or malicious user about the ability to extract compromising information about the system or network.",
      "severity": "medium"
    },
    {
      "id": "V-22451",
      "title": "The snmpd.conf file must be group-owned by root, sys, or bin.",
      "description": "The snmpd.conf file contains authenticators and must be protected from unauthorized access and modification.  If the file is not group-owned by a system group, it may be subject to access and modification from unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22452",
      "title": "The snmpd.conf file must not have an extended ACL.",
      "description": "The snmpd.conf file contains authenticators and must be protected from unauthorized access and modification.",
      "severity": "medium"
    },
    {
      "id": "V-22453",
      "title": "The /etc/syslog.conf file must have mode 0640 or less permissive.",
      "description": "Unauthorized users must not be allowed to access or modify the /etc/syslog.conf file.",
      "severity": "medium"
    },
    {
      "id": "V-22454",
      "title": "The /etc/syslog.conf file must not have an extended ACL.",
      "description": "Unauthorized users must not be allowed to access or modify the /etc/syslog.conf file.",
      "severity": "medium"
    },
    {
      "id": "V-22455",
      "title": "The system must use a remote syslog server (log host).",
      "description": "A syslog server (log host) receives syslog messages from one or more systems.  This data can be used as an authoritative log source in the event a system is compromised and its local logs are suspect.",
      "severity": "medium"
    },
    {
      "id": "V-22456",
      "title": "The SSH client must be configured to only use the SSHv2 protocol.",
      "description": "SSHv1 is not a DoD-approved protocol and has many well-known vulnerability exploits.  Exploits of the SSH client could provide access to the system with the privileges of the user running the client.",
      "severity": "medium"
    },
    {
      "id": "V-22457",
      "title": "The SSH daemon must only listen on management network addresses unless authorized for uses other than management.",
      "description": "The SSH daemon should only listen on network addresses designated for management traffic.  If the system has multiple network interfaces and SSH listens on addresses not designated for management traffic, the SSH service could be subject to unauthorized access.  If SSH is used for purposes other than management, such as providing an SFTP service, the list of approved listening addresses may be documented.",
      "severity": "medium"
    },
    {
      "id": "V-22458",
      "title": "The SSH daemon must be configured to only use FIPS 140-2 approved ciphers.",
      "description": "DoD information systems are required to use FIPS 140-2 approved ciphers.  SSHv2 ciphers meeting this requirement are 3DES and AES.",
      "severity": "medium"
    },
    {
      "id": "V-22459",
      "title": "The SSH daemon must be configured to not use Cipher-Block Chaining (CBC) ciphers.",
      "description": "The Cipher-Block Chaining (CBC) mode of encryption as implemented in the SSHv2 protocol is vulnerable to chosen plain text attacks and must not be used.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-22460",
      "title": "The SSH daemon must be configured to only use Message Authentication Codes (MACs) employing FIPS 140-2 approved cryptographic hash algorithms.",
      "description": "DoD information systems are required to use FIPS 140-2 approved cryptographic hash functions.",
      "severity": "medium"
    },
    {
      "id": "V-22461",
      "title": "The SSH client must be configured to only use FIPS 140-2 approved ciphers.",
      "description": "DoD information systems are required to use FIPS 140-2 approved ciphers.  SSHv2 ciphers meeting this requirement are 3DES and AES.",
      "severity": "medium"
    },
    {
      "id": "V-22462",
      "title": "The SSH client must be configured to not use CBC-based ciphers.",
      "description": "The Cipher-Block Chaining (CBC) mode of encryption as implemented in the SSHv2 protocol is vulnerable to chosen plain text attacks and must not be used.\n",
      "severity": "medium"
    },
    {
      "id": "V-22463",
      "title": "The SSH client must be configured to only use Message Authentication Codes (MACs) employing FIPS 140-2 approved cryptographic hash algorithms.",
      "description": "DoD information systems are required to use FIPS 140-2 approved cryptographic hash functions.",
      "severity": "medium"
    },
    {
      "id": "V-22470",
      "title": "The SSH daemon must restrict login ability to specific users and/or groups.",
      "description": "Restricting SSH logins to a limited group of users, such as system administrators, prevents password-guessing and other SSH attacks from reaching system accounts and other accounts not authorized for SSH access.",
      "severity": "medium"
    },
    {
      "id": "V-22471",
      "title": "The SSH public host key files must have mode 0644 or less permissive.",
      "description": "If a public host key file is modified by an unauthorized user, the SSH service may be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-22472",
      "title": "The SSH private host key files must have mode 0600 or less permissive.",
      "description": "If an unauthorized user obtains the private SSH host key file, the host could be impersonated.",
      "severity": "medium"
    },
    {
      "id": "V-22473",
      "title": "The SSH daemon must not permit GSSAPI authentication unless needed.",
      "description": "GSSAPI authentication is used to provide additional authentication mechanisms to applications. Allowing GSSAPI authentication through SSH exposes the system’s GSSAPI to remote hosts, increasing the attack surface of the system.  GSSAPI authentication must be disabled unless needed.",
      "severity": "low"
    },
    {
      "id": "V-22474",
      "title": "The SSH client must not permit GSSAPI authentication unless needed.",
      "description": "GSSAPI authentication is used to provide additional authentication mechanisms to applications. Allowing GSSAPI authentication through SSH exposes the system’s GSSAPI to remote hosts, increasing the attack surface of the system.  GSSAPI authentication must be disabled unless needed.",
      "severity": "low"
    },
    {
      "id": "V-22485",
      "title": "The SSH daemon must perform strict mode checking of home directory configuration files.",
      "description": "If other users have access to modify user-specific SSH configuration files, they may be able to log into the system as another user.",
      "severity": "medium"
    },
    {
      "id": "V-22487",
      "title": "The SSH daemon must not allow rhosts RSA authentication.\n",
      "description": "If SSH permits rhosts RSA authentication, a user may be able to log in based on the keys of the host originating the request and not any user-specific authentication.",
      "severity": "medium"
    },
    {
      "id": "V-22488",
      "title": "The SSH daemon must not allow compression or must only allow compression after successful authentication.",
      "description": "If compression is allowed in an SSH connection prior to authentication, vulnerabilities in the compression software could result in compromise of the system from an unauthenticated connection, potentially with root privileges.",
      "severity": "medium"
    },
    {
      "id": "V-22489",
      "title": "The SSH daemon must be configured with the Department of Defense (DoD) login banner.",
      "description": "Failure to display the DoD logon banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.\n\nThe SSH service must be configured to display the DoD logon warning banner through the SSH daemon configuration.\n\nThe SSH daemon may also be used to provide SFTP service.  The warning banner configuration for SSH will apply to SFTP.",
      "severity": "medium"
    },
    {
      "id": "V-22490",
      "title": "The system must be configured with a default gateway for IPv6 if the system uses IPv6, unless the system is a router.",
      "description": "If a system has no default gateway defined, the system is at increased risk of man-in-the-middle, monitoring, and Denial of Service attacks.",
      "severity": "medium"
    },
    {
      "id": "V-22491",
      "title": "The system must not have IP forwarding for IPv6 enabled, unless the system is an IPv6 router.",
      "description": "If the system is configured for IP forwarding and is not a designated router, it could be used to bypass network security by providing a path for communication not filtered by network devices.",
      "severity": "medium"
    },
    {
      "id": "V-22492",
      "title": "The NFS export configuration file must be group-owned by root, bin, or sys.",
      "description": "Failure to give group ownership of the NFS export configuration file to root or system groups provides the designated group owner and possible unauthorized users with the potential to change system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-22493",
      "title": "The NFS exports configuration file must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.  Excessive permissions on the NFS export configuration file could allow unauthorized modification of the file, which could result in Denial of Service to authorized NFS exports and the creation of additional unauthorized exports.",
      "severity": "low"
    },
    {
      "id": "V-22496",
      "title": "All NFS exported system files and system directories must be group-owned by root, bin, or sys.",
      "description": "Failure to give group ownership of sensitive files or directories to root provides the members of the owning group with the potential to access sensitive information or change system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-22497",
      "title": "The smb.conf file must not have an extended ACL.",
      "description": "Excessive permissions could endanger the security of the Samba configuration file and, ultimately, the system and network.",
      "severity": "medium"
    },
    {
      "id": "V-22498",
      "title": "The smbpasswd file must not have an extended ACL.",
      "description": "If the permissions of the smbpasswd file are too permissive, the smbpasswd file may be maliciously accessed or modified, potentially resulting in the compromise of Samba accounts.",
      "severity": "medium"
    },
    {
      "id": "V-22499",
      "title": "Samba must be configured to use an authentication mechanism other than \"share.\"",
      "description": "Samba share authentication does not provide for individual user identification and must not be used.",
      "severity": "medium"
    },
    {
      "id": "V-22500",
      "title": "Samba must be configured to use encrypted passwords.",
      "description": "Samba must be configured to protect authenticators.  If Samba passwords are not encrypted for storage, plain-text user passwords may be read by those with access to the Samba password file.",
      "severity": "medium"
    },
    {
      "id": "V-22501",
      "title": "Samba must be configured to not allow guest access to shares.",
      "description": "Guest access to shares permits anonymous access and is not permitted.",
      "severity": "medium"
    },
    {
      "id": "V-22502",
      "title": "The /etc/news/hosts.nntp file must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.  Excessive permissions on the hosts.nntp file may allow unauthorized modification which could lead to Denial of Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22503",
      "title": "The /etc/news/hosts.nntp.nolimit file must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.  Excessive permissions on the hosts.nntp.nolimit file may allow unauthorized modification which could lead to Denial of Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22504",
      "title": "The /etc/news/nnrp.access file must not have an extended ACL.",
      "description": "File system extended ACLs provide access to files beyond what is allowed by the mode numbers of the files.  Excessive permissions on the nnrp.access file may allow unauthorized modification which could lead to Denial of Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-22505",
      "title": "The /etc/news/passwd.nntp file must not have an extended ACL.",
      "description": "Extended ACLs may provide excessive permissions on the  /etc/news/passwd.nntp file, which may permit unauthorized  access or modification to the NNTP configuration.",
      "severity": "medium"
    },
    {
      "id": "V-22506",
      "title": "The system package management tool must be used to verify system software periodically.",
      "description": "Verification using the system package management tool can be used to determine that system software has not been tampered with.\n\nThis requirement is not applicable to systems not using package management tools.",
      "severity": "medium"
    },
    {
      "id": "V-22507",
      "title": "The file integrity tool must be configured to verify ACLs.",
      "description": "ACLs can provide permissions beyond those permitted through the file mode and must be verified by file integrity tools.",
      "severity": "low"
    },
    {
      "id": "V-22508",
      "title": "The file integrity tool must be configured to verify extended attributes.",
      "description": "Extended attributes in file systems are used to contain arbitrary data and file metadata with security implications.",
      "severity": "low"
    },
    {
      "id": "V-22509",
      "title": "The file integrity tool must use FIPS 140-2 approved cryptographic hashes for validating file contents.",
      "description": "File integrity tools often use cryptographic hashes for verifying that file contents have not been altered.  These hashes must be FIPS 140-2 approved.",
      "severity": "low"
    },
    {
      "id": "V-22530",
      "title": "The Reliable Datagram Sockets (RDS) protocol must be disabled or not installed unless required.",
      "description": "The Reliable Datagram Sockets (RDS) protocol is a relatively new protocol developed by Oracle for communication between the nodes of a cluster.  Binding this protocol to the network stack increases the attack surface of the host.  Unprivileged local processes may be able to cause the system to dynamically load a protocol handler by opening a socket using the protocol.",
      "severity": "medium"
    },
    {
      "id": "V-22533",
      "title": "The Transparent Inter-Process Communication (TIPC) protocol must be disabled or not installed.",
      "description": "The Transparent Inter-Process Communication (TIPC) protocol is a relatively new cluster communications protocol developed by Ericsson.  Binding this protocol to the network stack increases the attack surface of the host.   Unprivileged local processes may be able to cause the kernel to dynamically load a protocol handler by opening a socket using the protocol.",
      "severity": "medium"
    },
    {
      "id": "V-22545",
      "title": "The system must not have 6to4 enabled.",
      "description": "6to4 is an IPv6 transition mechanism that involves tunneling IPv6 packets encapsulated in IPv4 packets on an ad-hoc basis.  This is not a preferred transition strategy and increases the attack surface of the system.",
      "severity": "medium"
    },
    {
      "id": "V-22547",
      "title": "The system must not have IP tunnels configured.",
      "description": "IP tunneling mechanisms can be used to bypass network filtering.",
      "severity": "medium"
    },
    {
      "id": "V-22548",
      "title": "The DHCP client must be disabled if not needed.",
      "description": "DHCP allows for the unauthenticated configuration of network parameters on the system by exchanging information with a DHCP server.",
      "severity": "medium"
    },
    {
      "id": "V-22550",
      "title": "The system must ignore IPv6 ICMP redirect messages.",
      "description": "ICMP redirect messages are used by routers to inform hosts that a more direct route exists for a particular destination. These messages modify the host's route table and are unauthenticated. An illicit ICMP redirect message could result in a man-in-the-middle attack.",
      "severity": "medium"
    },
    {
      "id": "V-22551",
      "title": "The system must not send IPv6 ICMP redirects.",
      "description": "ICMP redirect messages are used by routers to inform hosts that a more direct route exists for a particular destination. These messages contain information from the system's route table revealing  portions of the network topology.",
      "severity": "medium"
    },
    {
      "id": "V-22552",
      "title": "The system must use an appropriate reverse-path filter for IPv6 network traffic, if the system uses IPv6.",
      "description": "Reverse-path filtering provides protection against spoofed source addresses by causing the system to discard packets with source addresses for which the system has no route or if the route does not point towards the interface on which the packet arrived. Depending on the role of the system, reverse-path filtering may cause legitimate traffic to be discarded and, therefore, should be used with a more permissive mode or filter, or not at all. Whenever possible, reverse-path filtering should be used.",
      "severity": "medium"
    },
    {
      "id": "V-22553",
      "title": "The system must not forward IPv6 source-routed packets.",
      "description": "Source-routed packets allow the source of the packet to suggest that routers forward the packet along a different path than configured on the router, which can be used to bypass network security measures.  This requirement applies only to the forwarding of source-routed traffic, such as when IPv6 forwarding is enabled and the system is functioning as a router.  ",
      "severity": "medium"
    },
    {
      "id": "V-22555",
      "title": "If the system is using LDAP for authentication or account information, the system must use a TLS connection using FIPS 140-2 approved cryptographic algorithms.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security. Communication between an LDAP server and a host using LDAP requires protection.",
      "severity": "medium"
    },
    {
      "id": "V-22559",
      "title": "If the system is using LDAP for authentication or account information the LDAP client configuration file must have mode 0600 or less permissive.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22560",
      "title": "If the system is using LDAP for authentication or account information, the LDAP configuration file must be owned by root.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22561",
      "title": "If the system is using LDAP for authentication or account information, the LDAP configuration file must be group-owned by root, bin, or sys.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22562",
      "title": "If the system is using LDAP for authentication or account information, the /etc/ldap.conf (or equivalent) file must not have an extended ACL.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22563",
      "title": "If the system is using LDAP for authentication or account information, the TLS certificate authority file and/or directory (as appropriate) must be owned by root.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22564",
      "title": "If the system is using LDAP for authentication or account information, the TLS certificate authority file and/or directory (as appropriate) must be group-owned by root, bin, or sys.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification",
      "severity": "medium"
    },
    {
      "id": "V-22565",
      "title": "If the system is using LDAP for authentication or account information, the TLS certificate authority file and/or directory (as appropriate) must have mode 0644 (0755 for directories) or less permissive.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22566",
      "title": "If the system is using LDAP for authentication or account information, the LDAP TLS certificate authority file and/or directory (as appropriate) must not have an extended ACL.",
      "description": "LDAP can be used to provide user authentication and account information, which are vital to system security.  The LDAP client configuration must be protected from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-22577",
      "title": "Automated file system mounting tools must not be enabled unless needed.",
      "description": "Automated file system mounting tools may provide unprivileged users with the ability to access local media and network shares.  If this access is not necessary for the system’s operation, it must be disabled to reduce the risk of unauthorized access to these resources.",
      "severity": "low"
    },
    {
      "id": "V-22578",
      "title": "The system must have USB disabled unless needed.",
      "description": "USB is a common computer peripheral interface.  USB devices may include storage devices that could be used to install malicious software on a system or exfiltrate data.\n",
      "severity": "low"
    },
    {
      "id": "V-22579",
      "title": "The system must have USB Mass Storage disabled unless needed.",
      "description": "USB is a common computer peripheral interface.  USB devices may include storage devices that could be used to install malicious software on a system or exfiltrate data.",
      "severity": "low"
    },
    {
      "id": "V-22580",
      "title": "The system must have IEEE 1394 (Firewire) disabled unless needed.",
      "description": "Firewire is a common computer peripheral interface.  Firewire devices may include storage devices that could be used to install malicious software on a system or exfiltrate data.",
      "severity": "low"
    },
    {
      "id": "V-22582",
      "title": "The system must employ a local firewall.",
      "description": "A local firewall protects the system from exposing unnecessary or undocumented network services to the local enclave.  If a system within the enclave is compromised, firewall protection on an individual system continues to protect it from attack.",
      "severity": "medium"
    },
    {
      "id": "V-22583",
      "title": "The system's local firewall must implement a deny-all, allow-by-exception policy.",
      "description": "A local firewall protects the system from exposing unnecessary or undocumented network services to the local enclave.  If a system within the enclave is compromised, firewall protection on an individual system continues to protect it from attack.",
      "severity": "medium"
    },
    {
      "id": "V-22588",
      "title": "The system package management tool must cryptographically verify the authenticity of software packages during installation.",
      "description": "To prevent the installation of software from unauthorized sources, the system package management tool must use cryptographic algorithms to verify the packages are authentic.",
      "severity": "low"
    },
    {
      "id": "V-22589",
      "title": "The system package management tool must not automatically obtain updates.",
      "description": "System package management tools can obtain a list of updates and patches from a package repository and make this information available to the SA for review and action. Using a package repository outside of the organization's control, presents a risk that malicious packages could be introduced.",
      "severity": "low"
    },
    {
      "id": "V-22599",
      "title": "The /etc/security/audit_user file must not have an extended ACL.",
      "description": "Audit_user is a sensitive file that, if compromised, would allow a malicious user to select auditing parameters to ignore their sessions.  This would allow malicious operations the auditing subsystem would not detect for that user.  It could also result in long-term system compromise possibly leading to the compromise of other systems and networks.",
      "severity": "medium"
    },
    {
      "id": "V-22600",
      "title": "The /usr/aset/userlist file must be group-owned by root.",
      "description": "The /usr/aset/userlist file is critical to system security and must be protected from unauthorized access.",
      "severity": "medium"
    },
    {
      "id": "V-22601",
      "title": "The /usr/aset/userlist file must not have an extended ACL.",
      "description": "File system ACLs can provide access to files beyond what is allowed by the mode numbers of the files.",
      "severity": "medium"
    },
    {
      "id": "V-22603",
      "title": "The /etc/zones directory, and its contents, must be owned by root.",
      "description": "Solaris zones configuration files must be protected against illicit creation, modification, and deletion.",
      "severity": "medium"
    },
    {
      "id": "V-22604",
      "title": "The /etc/zones directory, and its contents, must be group-owned by root, sys, or bin.",
      "description": "Solaris zones configuration files must be protected against illicit creation, modification, and deletion.",
      "severity": "medium"
    },
    {
      "id": "V-22605",
      "title": "The /etc/zones directory, and its contents, must not be group- or world-writable.",
      "description": "Solaris zones configuration files must be protected against illicit creation, modification, and deletion.",
      "severity": "medium"
    },
    {
      "id": "V-22606",
      "title": "The /etc/zones directory, and its contents, must not have an extended ACL.",
      "description": "Solaris zones configuration files must be protected against illicit creation, modification, and deletion.",
      "severity": "medium"
    },
    {
      "id": "V-22607",
      "title": "The inherit-pkg-dir zone option must be set to none or the system default list defined for sparse root zones.",
      "description": "Solaris zones have the capability to inherit elements of the global zone's filesystem, which reduces the amount storage required for a zone, but also limits the flexibility of the zone.  The inherit-pkg-dir option defines which paths are shared between the zones.  If set incorrectly, private information from the global zone could be made available to the non-global zone.  This option must be set to none (for a whole-root non-global zone), the vendor-specified list of paths for sparse-root non-global zones, or a list specified by the SA for operational reasons which has been justified and documented with the IAO.",
      "severity": "medium"
    },
    {
      "id": "V-22608",
      "title": "The limitpriv zone option must be set to the vendor default or less permissive.",
      "description": "Solaris zones can be assigned privileges generally reserved for the global zone using the limitpriv zone option.  Any privilege assignments in excess of the vendor defaults may provide the ability for a non-global zone to compromise the global zone.",
      "severity": "medium"
    },
    {
      "id": "V-22609",
      "title": "The physical devices must not be assigned to non-global zones.",
      "description": "Solaris non-global zones can be assigned physical hardware devices.  This increases the risk of such a non-global zone having the capability to compromise the global zone.",
      "severity": "medium"
    },
    {
      "id": "V-22665",
      "title": "The system must not be running any routing protocol daemons, unless the system is a router.",
      "description": "Routing protocol daemons are typically used on routers to exchange network topology information with other routers.  If this software is used when not required, system network information may be unnecessarily transmitted across the network.",
      "severity": "medium"
    },
    {
      "id": "V-22702",
      "title": "System audit logs must be group-owned by root, bin, or sys.",
      "description": "Sensitive system and user information could provide a malicious user with enough information to penetrate further into the system.",
      "severity": "medium"
    },
    {
      "id": "V-23732",
      "title": "The FTPS/FTP service on the system must be configured with the Department of Defense (DoD) login banner.",
      "description": "Failure to display the logon banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.\n\nNOTE: SFTP and FTPS are encrypted alternatives to FTP that should be used in place of FTP. SFTP is implemented by the SSH service and uses its banner configuration.\n",
      "severity": "medium"
    },
    {
      "id": "V-23738",
      "title": "The system must use a separate file system for the system audit data path.",
      "description": "The use of separate file systems for different paths can protect the system from failures resulting from a file system becoming full or failing.",
      "severity": "low"
    },
    {
      "id": "V-23739",
      "title": "The system must use a separate filesystem for /tmp (or equivalent).",
      "description": "The use of separate filesystems for different paths can protect the system from failures resulting from a filesystem becoming full or failing.",
      "severity": "low"
    },
    {
      "id": "V-23741",
      "title": "TCP backlog queue sizes must be set appropriately.",
      "description": "To provide some mitigation to TCP DoS attacks, the TCP backlog queue sizes must be set to at least 1280 or in accordance with product-specific guidelines.",
      "severity": "medium"
    },
    {
      "id": "V-23952",
      "title": "Mail relaying must be restricted.",
      "description": "If unrestricted mail relaying is permitted, unauthorized senders could use this host as a mail relay for the purpose of sending SPAM or other unauthorized activity.",
      "severity": "medium"
    },
    {
      "id": "V-23972",
      "title": "The system must not respond to ICMPv6 echo requests sent to a broadcast address.",
      "description": "Responding to broadcast ICMP echo requests facilitates network mapping and provides a vector for amplification attacks.",
      "severity": "medium"
    },
    {
      "id": "V-24331",
      "title": "The Department of Defense (DoD) login banner must be displayed immediately prior to, or as part of, graphical desktop environment login prompts.",
      "description": "Failure to display the login banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.\n\nThis requirement applies to graphical desktop environments provided by the system to locally attached displays and input devices as well as to graphical desktop environments provided to remote systems, including thin clients.",
      "severity": "medium"
    },
    {
      "id": "V-24347",
      "title": "The system, if capable, must be configured to require the use of a CAC, PIV compliant hardware token, or Alternate Logon Token (ALT) for authentication.",
      "description": "In accordance with CTO 07-015 PKI authentication is required. This provides stronger, two-factor authentication than using a username/password.\n\nNOTE: The following are exempt from this, however, they must meet all password requirements and must be documented with the IAO:\n\n- Stand-alone systems.\n- Application Accounts.\n- Students or unpaid employees (such as, interns) who are not eligible to receive or not in receipt of a CAC, PIV, or ALT.\n- Warfighters and support personnel located at operational tactical locations conducting wartime operations that are not collocated with RAPIDS workstations to issue CAC; are not eligible for CAC or do not have the capability to use ALT.\n- Test systems that have an Interim Approval to Test (IATT) and provide protection via separate VPN, firewall, or security measures preventing access to network and system components from outside the protection boundary documented in the IATT.",
      "severity": "medium"
    },
    {
      "id": "V-24357",
      "title": "The system must be configured to send audit records to a remote audit server.",
      "description": "Audit records contain evidence that can be used in the investigation of compromised systems.  To prevent this evidence from compromise, it must be sent to a separate system continuously. Methods for sending audit records include, but are not limited to, system audit tools used to send logs directly to another host or through the system's syslog service to another host.",
      "severity": "low"
    },
    {
      "id": "V-24386",
      "title": "The telnet daemon must not be running.",
      "description": "The telnet daemon provides a typically unencrypted remote access service which does not provide for the confidentiality and integrity of user passwords or the remote session.  If a privileged user were to log on using this service, the privileged user password could be compromised.",
      "severity": "high"
    },
    {
      "id": "V-4083",
      "title": "Graphical desktop environments provided by the system must automatically lock after 15 minutes of inactivity and the system must require users to re-authenticate to unlock the environment.",
      "description": "If graphical desktop sessions do not lock the session after 15 minutes of inactivity, requiring re-authentication to resume operations, the system or individual data could be compromised by an alert intruder who could exploit the oversight. This requirement applies to graphical desktop environments provided by the system to locally attached displays and input devices as well as to graphical desktop environments provided to remote systems, including thin clients.",
      "severity": "medium"
    },
    {
      "id": "V-4084",
      "title": "The system must prohibit the reuse of passwords within five iterations.",
      "description": "If a user, or root, used the same password continuously or was allowed to change it back shortly after being forced to change it to something else, it would provide a potential intruder with the opportunity to keep guessing at one user's password until it was guessed correctly.\n",
      "severity": "medium"
    },
    {
      "id": "V-4087",
      "title": "User start-up files must not execute world-writable programs.",
      "description": "If start-up files execute world-writable programs, especially in unprotected directories, they could be maliciously modified to become Trojans destroying user files or otherwise compromising the system at the user, or higher, level.  If the system is compromised at the user level, it is much easier to eventually compromise the system at the root and network level.",
      "severity": "medium"
    },
    {
      "id": "V-4089",
      "title": "All system start-up files must be owned by root.",
      "description": "System start-up files not owned by root could lead to system compromise by allowing malicious users or applications to modify them for unauthorized purposes.  This could lead to system and network compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-4090",
      "title": "All system start-up files must be group-owned by root, sys, or bin.",
      "description": "If system start-up files do not have a group owner of root or a system group, the files may be modified by malicious users or intruders.",
      "severity": "medium"
    },
    {
      "id": "V-4091",
      "title": "System start-up files must only execute programs owned by a privileged UID or an application.",
      "description": "System start-up files executing programs owned by other than root (or another privileged user) or an application indicates the system may have been compromised.",
      "severity": "medium"
    },
    {
      "id": "V-4245",
      "title": "The /etc/security/audit_user file must have mode 0640 or less permissive.",
      "description": "Audit_user is a sensitive file that, if compromised, would allow a malicious user to select auditing parameters to ignore his sessions.  This would allow malicious operations the auditing subsystem would not log for that user.",
      "severity": "medium"
    },
    {
      "id": "V-4246",
      "title": "System BIOS or system controllers supporting password protection must have administrator accounts/passwords configured, and no others.",
      "description": "A system's BIOS or system controller handles the initial startup of a system and its configuration must be protected from unauthorized modification. When the BIOS or system controller supports the creation of user accounts or passwords, such protections must be used and accounts/passwords only assigned to system administrators. Failure to protect BIOS or system controller settings could result in Denial-of-Service or compromise of the system resulting from unauthorized configuration changes.",
      "severity": "medium"
    },
    {
      "id": "V-4247",
      "title": "The system must not use removable media as the boot loader.",
      "description": "Malicious users with removable boot media can gain access to a system configured to use removable media as the boot loader.",
      "severity": "high"
    },
    {
      "id": "V-4255",
      "title": "If the system boots from removable media, it must be stored in a safe or similarly secured container.",
      "description": "Storing the boot loader on removable media in an insecure location could allow a malicious user to modify the systems boot instructions or boot to an insecure operating system.",
      "severity": "high"
    },
    {
      "id": "V-4269",
      "title": "The system must not have unnecessary accounts.",
      "description": "Accounts providing no operational purpose provide additional opportunities for system compromise.  Unnecessary accounts include user accounts for individuals not requiring access to the system and application accounts for applications not installed on the system.",
      "severity": "medium"
    },
    {
      "id": "V-4273",
      "title": "The /etc/news/hosts.nntp (or equivalent) must have mode 0600 or less permissive.",
      "description": "Excessive permissions on the hosts.nntp file may allow unauthorized modification which could lead to Denial-of-Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-4274",
      "title": "The /etc/news/hosts.nntp.nolimit (or equivalent) must have mode 0600 or less permissive.",
      "description": "Excessive permissions on the hosts.nntp.nolimit file may allow unauthorized modification which could lead to Denial-of-Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-4275",
      "title": "The /etc/news/nnrp.access (or equivalent) must have mode 0600 or less permissive.",
      "description": "Excessive permissions on the nnrp.access file may allow unauthorized modification which could lead to Denial-of-Service to authorized users or provide access to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-4276",
      "title": "The /etc/news/passwd.nntp file (or equivalent) must have mode 0600 or less permissive.",
      "description": "File permissions more permissive than 0600 for /etc/news/passwd.nntp may allow access to privileged information by system intruders or malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-4277",
      "title": "Files in /etc/news must be owned by root.",
      "description": "If critical system files are not owned by a privileged user, system integrity could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-4278",
      "title": "The files in /etc/news must be group-owned by root.",
      "description": "If critical system files do not have a privileged group owner, system integrity could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-4295",
      "title": "The SSH daemon must be configured to only use the SSHv2 protocol.",
      "description": "SSHv1 is not a DoD-approved protocol and has many well-known vulnerability exploits.  Exploits of the SSH daemon could provide immediate root access to the system.",
      "severity": "high"
    },
    {
      "id": "V-4298",
      "title": "Remote consoles must be disabled or protected from unauthorized access.",
      "description": "The remote console feature provides an additional means of access to the system which could allow unauthorized access if not disabled or properly secured.  With virtualization technologies, remote console access is essential as there is no physical console for virtual machines.  Remote console access must be protected in the same manner as any other remote privileged access method.",
      "severity": "medium"
    },
    {
      "id": "V-4300",
      "title": "The NFS server must have logging implemented.",
      "description": "Filesystem logging, especially for NFS exported file systems, can be critical to detecting data misuse and possible hardware/system errors that may, otherwise, go unnoticed.",
      "severity": "medium"
    },
    {
      "id": "V-4301",
      "title": "The system clock must be synchronized to an authoritative DoD time source.",
      "description": "To assure the accuracy of the system clock, it must be synchronized with an authoritative time source within DoD. Many system functions, including time-based login and activity restrictions, automated reports, system logs, and audit records depend on an accurate system clock. If there is no confidence in the correctness of the system clock, time-based functions may not operate as intended and records may be of diminished value.\n\nAuthoritative time sources include authorized time servers within the enclave that synchronize with upstream authoritative sources. Specific requirements for the upstream synchronization of Network Time Protocol (NTP) servers are covered in the Network Other Devices STIG.\n\nFor systems located on isolated or closed networks, it is not necessary to synchronize with a global authoritative time source. If a global authoritative time source is not available to systems on an isolated network, a local authoritative time source must be established on this network and used by the systems connected to this network. This is necessary to provide the ability to correlate events and allow for the correct operation of time-dependent protocols between systems on the isolated network.\n\nIf the system is completely isolated (no connections to networks or other systems), time synchronization is not required as no correlation of events between systems will be necessary. If the system is completely isolated, this requirement is not applicable.\n",
      "severity": "medium"
    },
    {
      "id": "V-4304",
      "title": "The root file system must employ journaling or another mechanism ensuring file system consistency.",
      "description": "File system journaling, or logging, can allow reconstruction of file system data after a system crash, thus, preserving the integrity of data that may have otherwise been lost.  Journaling file systems typically do not require consistent checks upon booting after a crash, which can improve system availability.  Some file systems employ other mechanisms to ensure consistency which also satisfy this requirement.",
      "severity": "medium"
    },
    {
      "id": "V-4309",
      "title": "If the system is a firewall, ASET must be used on the system, and the firewall parameters must be set in /usr/aset/asetenv.",
      "description": "ASET will not perform firewall tasks if it is not listed as a parameter in /usr/aset/asetenv.",
      "severity": "medium"
    },
    {
      "id": "V-4312",
      "title": "The /usr/aset/masters/uid_aliases must be empty.",
      "description": "If uid_aliases has entries, users may not be properly identified in ASET records.",
      "severity": "medium"
    },
    {
      "id": "V-4313",
      "title": "The ASET master files must be located in the /usr/aset/masters directory.",
      "description": "If ASET is used and the master files (tune.high, tune.med, tune.low, and uid_aliases) are not located in the proper place, ASET cannot operate correctly and valuable security findings could be lost. ",
      "severity": "medium"
    },
    {
      "id": "V-4321",
      "title": "The system must not run Samba unless needed.",
      "description": "Samba is a tool used for the sharing of files and printers between Windows and UNIX operating systems.  It provides access to sensitive files and, therefore, poses a security risk if compromised.",
      "severity": "medium"
    },
    {
      "id": "V-4351",
      "title": "The /etc/security/audit_user file must be group-owned by root, sys, or bin.",
      "description": "The Solaris audit_user file allows for selective auditing or non-auditing of features for certain users.  If it is not protected, it could be compromised and used to mask audit events.  This could cause the loss of valuable forensics data in the case of a system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4352",
      "title": "The /etc/security/audit_user file must be owned by root.",
      "description": "The /etc/security/audit_user is a sensitive file and must be owned by root to prevent possible system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4353",
      "title": "The /etc/security/audit_user file must not define a different auditing level for specific users.",
      "description": "The audit_user file may be used to selectively audit more, or fewer, auditing features for specific individuals.  If used this way it could subject the activity to a lawsuit and could cause the loss of valuable auditing data in the case of a system compromise.  If an item is audited for one individual (other than for root and administrative users - who have more auditing features) it must be audited for all.",
      "severity": "medium"
    },
    {
      "id": "V-4357",
      "title": "Audit logs must be rotated daily.",
      "description": "Rotate audit logs daily to preserve audit file system space and to conform to the DoD/DISA requirement.  If it is not rotated daily and moved to another location, then there is more of a chance for the compromise of audit data by malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-4358",
      "title": "The cron.deny file must have mode 0600 or less permissive.",
      "description": "If file permissions for cron.deny are more permissive than 0600, sensitive information could be viewed or edited by unauthorized users.\n",
      "severity": "medium"
    },
    {
      "id": "V-4360",
      "title": "Cron programs must not set the umask to a value less restrictive than 077.",
      "description": "The umask controls the default access mode assigned to newly created files.  An umask of 077 limits new files to mode 700 or less permissive.  Although umask is often represented as a 4-digit octal number, the first digit representing special access modes is typically ignored or required to be 0.",
      "severity": "low"
    },
    {
      "id": "V-4361",
      "title": "The cron.allow file must be owned by root, bin, or sys.",
      "description": "If the owner of the cron.allow file is not set to root, bin, or sys, the possibility exists for an unauthorized user to view or to edit sensitive information.",
      "severity": "medium"
    },
    {
      "id": "V-4364",
      "title": "The \"at\" directory must have mode 0755 or less permissive.",
      "description": "If the \"at\" directory has a mode more permissive than 0755, unauthorized users could be allowed to view or to edit files containing sensitive information within the \"at\" directory.  Unauthorized modifications could result in Denial of Service to authorized \"at\" jobs.",
      "severity": "medium"
    },
    {
      "id": "V-4365",
      "title": "The \"at\"  directory must be owned by root, bin, or sys.",
      "description": "If the owner of the \"at\" directory is not root, bin, or sys, unauthorized users could be allowed to view or edit files containing sensitive information within the directory.",
      "severity": "medium"
    },
    {
      "id": "V-4366",
      "title": "\"At\" jobs must not set the umask to a value less restrictive than 077.",
      "description": "The umask controls the default access mode assigned to newly created files.  An umask of 077 limits new files to mode 700 or less permissive.  Although umask is often represented as a 4-digit number, the first digit representing special access modes is typically ignored or required to be 0.",
      "severity": "medium"
    },
    {
      "id": "V-4367",
      "title": "The at.allow file must be owned by root, bin, or sys.",
      "description": "If the owner of the at.allow file is not set to root, bin, or sys, unauthorized users could be allowed to view or edit sensitive information contained within the file.",
      "severity": "medium"
    },
    {
      "id": "V-4368",
      "title": "The at.deny file must be owned by root, bin, or sys.",
      "description": "If the owner of the at.deny file is not set to root, bin, or sys, unauthorized users could be allowed to view or edit sensitive information contained within the file.",
      "severity": "medium"
    },
    {
      "id": "V-4369",
      "title": "The traceroute command owner must be root.",
      "description": "If the traceroute command owner has not been set to root, an unauthorized user could use this command to obtain knowledge of the network topology inside the firewall.  This information may allow an attacker to determine trusted routers and other network information possibly leading to system and network compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4370",
      "title": "The traceroute command must be group-owned by sys, bin, or root.",
      "description": "If the group owner of the traceroute command has not been set to a system group, unauthorized users could have access to the command and use it to gain information regarding a network's topology inside of the firewall.  This information may allow an attacker to determine trusted routers and other network information possibly leading to system and network compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4371",
      "title": "The traceroute file must have mode 0700 or less permissive.",
      "description": "If the mode of the traceroute executable is more permissive than 0700, malicious code could be inserted by an attacker and triggered whenever the traceroute command is executed by authorized users.  Additionally, if an unauthorized user is granted executable permissions to the traceroute command, it could be used to gain information about the network topology behind the firewall.  This information may allow an attacker to determine trusted routers and other network information that may lead to system and network compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4382",
      "title": "Administrative accounts must not run a web browser, except as needed for local service administration.",
      "description": "If a web browser flaw is exploited while running as a privileged user, the entire system could be compromised.\n\nSpecific exceptions for local service administration should be documented in site-defined policy.  These exceptions may include HTTP(S)-based tools used for the administration of the local system, services, or attached devices.  Examples of possible exceptions are HP’s System Management Homepage (SMH), the CUPS administrative interface, and Sun's StorageTek Common Array Manager (CAM) when these services are running on the local system.",
      "severity": "high"
    },
    {
      "id": "V-4384",
      "title": "The SMTP services SMTP greeting must not provide version information.",
      "description": "The version of the SMTP service can be used by attackers to plan an attack based on vulnerabilities present in the specific version.",
      "severity": "low"
    },
    {
      "id": "V-4385",
      "title": "The system must not use .forward files.",
      "description": "The .forward file allows users to automatically forward mail to another system. Use of .forward files could allow the unauthorized forwarding of mail and could potentially create mail loops which could degrade system performance.",
      "severity": "medium"
    },
    {
      "id": "V-4387",
      "title": "Anonymous FTP accounts must not have a functional shell.",
      "description": "If an anonymous FTP account has been configured to use a functional shell, attackers could gain access to the shell if the account is compromised.",
      "severity": "high"
    },
    {
      "id": "V-4388",
      "title": "The anonymous FTP account must be configured to use chroot or a similarly isolated environment.",
      "description": "If an anonymous FTP account does not use a chroot or similarly isolated environment,  the system may be more vulnerable to exploits against the FTP service.  Such exploits could allow an attacker to gain shell access to the system and view, edit, or remove sensitive files.",
      "severity": "medium"
    },
    {
      "id": "V-4392",
      "title": "If the system is a Network Management System (NMS) server, it must only run the NMS and any software required by the NMS.",
      "description": "Installing extraneous software on a system designated as a dedicated Network Management System (NMS) server poses a security threat to the system and the network. Should an attacker gain access to the NMS through unauthorized software, the entire network may be susceptible to malicious activity.",
      "severity": "medium"
    },
    {
      "id": "V-4393",
      "title": "The /etc/syslog.conf file must be owned by root.",
      "description": "If the /etc/syslog.conf file is not owned by root, unauthorized users could be allowed to view, edit, or delete important system messages handled by the syslog facility.",
      "severity": "medium"
    },
    {
      "id": "V-4394",
      "title": "The /etc/syslog.conf file must be group-owned by root, bin, or sys.",
      "description": "If the group owner of /etc/syslog.conf is not root, bin, or sys, unauthorized users could be permitted to view, edit, or delete important system messages handled by the syslog facility.",
      "severity": "medium"
    },
    {
      "id": "V-4395",
      "title": "The system must only use remote syslog servers (log hosts) justified and documented using site-defined procedures.",
      "description": "If a remote log host is in use and it has not been justified and documented with the IAO, sensitive information could be obtained by unauthorized users without the SA's knowledge.  A remote log host is any host to which the system is sending syslog messages over a network.",
      "severity": "medium"
    },
    {
      "id": "V-4397",
      "title": "The system must be configured with a default gateway for IPv4 if the system uses IPv4, unless the system is a router.",
      "description": "If a system has no default gateway defined, the system is at increased risk of man-in-the-middle, monitoring, and Denial of Service attacks.",
      "severity": "medium"
    },
    {
      "id": "V-4398",
      "title": "A system used for routing must not run other network services or applications.",
      "description": "Installing extraneous software on a system designated as a dedicated router poses a security threat to the system and the network. Should an attacker gain access to the router through the unauthorized software, the entire network is susceptible to malicious activity.",
      "severity": "medium"
    },
    {
      "id": "V-4399",
      "title": "The system must not use UDP for NIS/NIS+.",
      "description": "Implementing NIS or NIS+ under UDP may make the system more susceptible to a Denial of Service attack and does not provide the same quality of service as TCP.",
      "severity": "high"
    },
    {
      "id": "V-4427",
      "title": "All .rhosts, .shosts, or host.equiv files must only contain trusted host-user pairs.",
      "description": "If these files are not properly configured, they could allow malicious access by unknown malicious users from untrusted hosts who could compromise the system.",
      "severity": "medium"
    },
    {
      "id": "V-4428",
      "title": "All .rhosts, .shosts, .netrc, or hosts.equiv files must be accessible by only root or the owner.",
      "description": "If these files are accessible by users other than root or the owner, they could be used by a malicious user to set up a system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-4430",
      "title": "The cron.deny file must be owned by root, bin, or sys.",
      "description": "Cron daemon control files restrict the scheduling of automated tasks and must be protected.\n",
      "severity": "medium"
    },
    {
      "id": "V-4687",
      "title": "The rsh daemon must not be running.",
      "description": "The rshd process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.\n",
      "severity": "high"
    },
    {
      "id": "V-4688",
      "title": "The rexec daemon must not be running.",
      "description": "The rexecd process provides a typically unencrypted, host-authenticated remote access service.  SSH should be used in place of this service.\n",
      "severity": "high"
    },
    {
      "id": "V-4689",
      "title": "The SMTP service must be an up-to-date version.",
      "description": "The SMTP service version on the system must be current to avoid exposing vulnerabilities present in unpatched versions.",
      "severity": "high"
    },
    {
      "id": "V-4690",
      "title": "The Sendmail server must have the debug feature disabled.",
      "description": "Debug mode is a feature present in older versions of Sendmail which, if not disabled, may allow an attacker to gain access to a system through the Sendmail service.\n",
      "severity": "high"
    },
    {
      "id": "V-4691",
      "title": "The SMTP service must not have a uudecode alias active.",
      "description": "A common configuration for older Mail Transfer Agents (MTAs) includes an alias for the decode user. All mail sent to this user is sent to the uudecode program, which automatically converts and stores files. By sending mail to decode or uudecode aliases present on some systems, a remote attacker may be able to create or overwrite files on the remote host. This could possibly be used to gain remote access.",
      "severity": "high"
    },
    {
      "id": "V-4692",
      "title": "The SMTP service must not have the EXPN feature active.",
      "description": "The SMTP EXPN function allows an attacker to determine if an account exists on a system, providing significant assistance to a brute-force attack on user accounts. EXPN may also provide additional information concerning users on the system, such as the full names of account owners.",
      "severity": "low"
    },
    {
      "id": "V-4693",
      "title": "The SMTP service must not have the VRFY feature active.",
      "description": "The VRFY (Verify) command allows an attacker to determine if an account exists on a system, providing significant assistance to a brute-force attack on user accounts. VRFY may provide additional information about users on the system, such as the full names of account owners.",
      "severity": "low"
    },
    {
      "id": "V-4694",
      "title": "The Sendmail service must not have the wizard backdoor active.",
      "description": "Very old installations of the Sendmail mailing system contained a feature whereby a remote user connecting to the SMTP port can enter the WIZ command and be given an interactive shell with root privileges.",
      "severity": "low"
    },
    {
      "id": "V-4695",
      "title": "Any active TFTP daemon must be authorized and approved in the system accreditation package.",
      "description": "TFTP is a file transfer protocol often used by embedded systems to obtain configuration data or software.    The service is unencrypted and does not require authentication of requests.  Data available using this service may be subject to unauthorized access or interception.",
      "severity": "high"
    },
    {
      "id": "V-4696",
      "title": "The system must not have the UUCP service active.",
      "description": "The UUCP utility is designed to assist in transferring files, executing remote commands, and sending email between UNIX systems over phone lines and direct connections between systems. The UUCP utility is a primitive and arcane system with many security issues. There are alternate data transfer utilities/products that can be configured to more securely transfer data by providing for authentication,  as well as encryption.",
      "severity": "medium"
    },
    {
      "id": "V-4697",
      "title": "X displays must not be exported to the world.",
      "description": "Open X displays allow an attacker to capture keystrokes and to execute commands remotely. Many users have their X Server set to xhost +, permitting access to the X Server by anyone, from anywhere.",
      "severity": "high"
    },
    {
      "id": "V-4701",
      "title": "The system must not have the finger service active.",
      "description": "The finger service provides information about the system's users to network clients.  This information could expose information that could be used in subsequent attacks.\n",
      "severity": "low"
    },
    {
      "id": "V-4702",
      "title": "If the system is an anonymous FTP server, it must be isolated to the DMZ network.",
      "description": "Anonymous FTP is a public data service which is only permitted in a server capacity when located on the DMZ network.",
      "severity": "medium"
    },
    {
      "id": "V-72771",
      "title": "Wireless network adapters must be disabled.",
      "description": "The use of wireless networking can introduce many different attack vectors into the organization’s network. Common attack vectors such as malicious association and ad hoc networks will allow an attacker to spoof a wireless access point (AP), allowing validated systems to connect to the malicious AP and enabling the attacker to monitor and record network traffic. These malicious APs can also serve to create a man-in-the-middle attack or be used to create a denial of service to valid network resources.",
      "severity": "medium"
    },
    {
      "id": "V-756",
      "title": "The system must require authentication upon booting into single-user and maintenance modes.",
      "description": "If the system does not require valid root authentication before it boots into single-user or maintenance mode, anyone who invokes single-user or maintenance mode is granted privileged access to all files on the system.",
      "severity": "medium"
    },
    {
      "id": "V-760",
      "title": "Direct logins must not be permitted to shared, default, application, or utility accounts.",
      "description": "Shared accounts (accounts where two or more people log in with the same user identification) do not provide identification and authentication.  There is no way to provide for non-repudiation or individual accountability.",
      "severity": "medium"
    },
    {
      "id": "V-761",
      "title": "All accounts on the system must have unique user or account names.",
      "description": "A unique user name is the first part of the identification and authentication process.  If user names are not unique, there can be no accountability on the system for auditing purposes.  Multiple accounts sharing the same name could result in the Denial of Service to one or both of the accounts or unauthorized access to files or privileges.",
      "severity": "medium"
    },
    {
      "id": "V-762",
      "title": "All accounts must be assigned unique User Identification Numbers (UIDs).",
      "description": "Accounts sharing a UID have full access to each others' files.  This has the same effect as sharing a login.  There is no way to assure identification, authentication, and accountability because the system sees them as the same user. If the duplicate UID is 0, this gives potential intruders another privileged account to attack.",
      "severity": "medium"
    },
    {
      "id": "V-763",
      "title": "The Department of Defense (DoD) login banner must be displayed immediately prior to, or as part of, console login prompts.",
      "description": "Failure to display the login banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.",
      "severity": "medium"
    },
    {
      "id": "V-765",
      "title": "Successful and unsuccessful logins and logouts must be logged.",
      "description": "Monitoring and recording successful and unsuccessful logins assist in tracking unauthorized access to the system.  Without this logging, the ability to track unauthorized activity to specific user accounts may be diminished.",
      "severity": "medium"
    },
    {
      "id": "V-766",
      "title": "The system must disable accounts after three consecutive unsuccessful login attempts.",
      "description": "Disabling accounts after a limited number of unsuccessful login attempts improves protection against password guessing attacks.",
      "severity": "medium"
    },
    {
      "id": "V-768",
      "title": "The delay between login prompts following a failed login attempt must be at least 4 seconds.",
      "description": "Enforcing a delay between successive failed login attempts increases protection against automated password guessing attacks.\n",
      "severity": "medium"
    },
    {
      "id": "V-769",
      "title": "The root user must not own the logon session for an application requiring a continuous display.",
      "description": "If an application is providing a continuous display and is running with root privileges, unauthorized users could interrupt the process and gain root access to the system.",
      "severity": "medium"
    },
    {
      "id": "V-770",
      "title": "The system must not have accounts configured with blank or null passwords.",
      "description": "If an account is configured for password authentication but does not have an assigned password, it may be possible to log into the account without authentication.  If the root user is configured without a password, the entire system may be compromised.  For user accounts not using password authentication, the account must be configured with a password lock value instead of a blank or null value.  ",
      "severity": "high"
    },
    {
      "id": "V-773",
      "title": "The root account must be the only account having an UID of 0.",
      "description": "If an account has an UID of 0, it has root authority. Multiple accounts with an UID of 0 afford more opportunity for potential intruders to guess a password for a privileged account.",
      "severity": "medium"
    },
    {
      "id": "V-774",
      "title": "The root user's home directory must not be the root directory (/).",
      "description": "Changing the root home directory to something other than / and assigning it a 0700 protection makes it more difficult for intruders to manipulate the system by reading the files that root places in its default directory. It also gives root the same discretionary access control for root's home directory as for the other plain user home directories.",
      "severity": "low"
    },
    {
      "id": "V-775",
      "title": "The root account's home directory (other than /) must have mode 0700.",
      "description": "Permissions greater than 0700 could allow unauthorized users access to the root home directory.",
      "severity": "medium"
    },
    {
      "id": "V-776",
      "title": "The root accounts executable search path must contain only authorized paths.",
      "description": "The executable search path (typically the PATH environment variable) contains a list of directories for the shell to search to find executables. If this path includes the current working directory or other relative paths, executables in these directories may be executed instead of system commands. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Entries starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-777",
      "title": "The root account must not have world-writable directories in its executable search path.",
      "description": "If the root search path contains a world-writable directory, malicious software could be placed in the path by intruders and/or malicious users and inadvertently run by root with all of root's privileges.\n",
      "severity": "medium"
    },
    {
      "id": "V-778",
      "title": "The system must prevent the root account from directly logging in except from the system console.",
      "description": "Limiting the root account direct logins to only system consoles protects the root account from direct unauthorized access from a non-console device.\n",
      "severity": "medium"
    },
    {
      "id": "V-780",
      "title": "GIDs reserved for system accounts must not be assigned to non-system groups.",
      "description": "Reserved GIDs are typically used by system software packages.  If non-system groups have GIDs in this range, they may conflict with system software, possibly leading to the group having permissions to modify system files.",
      "severity": "medium"
    },
    {
      "id": "V-781",
      "title": "All GIDs referenced in the /etc/passwd file must be defined in the /etc/group file.",
      "description": "If a user is assigned the GID of a group not existing on the system, and a group with the same GID is subsequently created, the user may have unintended rights to the group.\n",
      "severity": "low"
    },
    {
      "id": "V-782",
      "title": "The system must have a host-based intrusion detection tool installed.",
      "description": "Without a host-based intrusion detection tool, there is no system-level defense when an intruder gains access to a system or network.  Additionally, a host-based intrusion detection tool can provide methods to immediately lock out detected intrusion attempts.",
      "severity": "medium"
    },
    {
      "id": "V-783",
      "title": "System security patches and updates must be installed and up-to-date.",
      "description": "Timely patching is critical for maintaining the operational availability, confidentiality, and integrity of Information Technology (IT) systems. However, failure to keep operating system and application software patched is a common mistake made by IT professionals. New patches are released daily, and it is often difficult for even experienced system administrators to keep abreast of all the new patches. When new weaknesses in an operating system exist, patches are usually made available by the vendor to resolve the problems. If the most recent security patches and updates are not installed, unauthorized users may take advantage of weaknesses present in the unpatched software. The lack of prompt attention to patching could result in a system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-784",
      "title": "System files and directories must not have uneven access permissions.",
      "description": "Discretionary access control is undermined if users, other than a file owner, have greater access permissions to system files and directories than the owner.",
      "severity": "medium"
    },
    {
      "id": "V-785",
      "title": "All files and directories must have a valid owner.",
      "description": "Unowned files and directories may be unintentionally inherited if a user is assigned the same UID as the UID of the unowned files.",
      "severity": "medium"
    },
    {
      "id": "V-786",
      "title": "All network services daemon files must have mode 0755 or less permissive.",
      "description": "Restricting permission on daemons will protect them from unauthorized modification and possible system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-787",
      "title": "System log files must have mode 0640 or less permissive.",
      "description": "If the system log files are not protected, unauthorized users could change the logged data, eliminating its forensic value.",
      "severity": "medium"
    },
    {
      "id": "V-788",
      "title": "All skeleton files (typically those in /etc/skel) must have mode 0644 or less permissive.",
      "description": "If the skeleton files are not protected, unauthorized personnel could change user startup parameters and possibly jeopardize user files.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-789",
      "title": "NIS/NIS+/yp files must be owned by root, sys, or bin.",
      "description": "NIS/NIS+/yp files are part of the system's identification and authentication processes and are, therefore, critical to system security.  Failure to give ownership of sensitive files or utilities to root or bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.\n",
      "severity": "medium"
    },
    {
      "id": "V-790",
      "title": "NIS/NIS+/yp files must be group-owned by root, sys, or bin.",
      "description": "NIS/NIS+/yp files are part of the system's identification and authentication processes and are, therefore, critical to system security.  Failure to give ownership of sensitive files or utilities to root or bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.\n",
      "severity": "medium"
    },
    {
      "id": "V-791",
      "title": "The NIS/NIS+/yp command files must have mode 0755 or less permissive.",
      "description": "NIS/NIS+/yp files are part of the system's identification and authentication processes and are, therefore, critical to system security.  Unauthorized modification of these files could compromise these processes and the system.",
      "severity": "medium"
    },
    {
      "id": "V-792",
      "title": "Manual page files must have mode 0644 or less permissive.",
      "description": "If manual pages are compromised, misleading information could be inserted, causing actions that may compromise the system.",
      "severity": "low"
    },
    {
      "id": "V-793",
      "title": "Library files must have mode 0755 or less permissive.",
      "description": "Unauthorized access could destroy the integrity of the library files.",
      "severity": "medium"
    },
    {
      "id": "V-794",
      "title": "All system command files must have mode 755 or less permissive.",
      "description": "Restricting permissions will protect system command files from unauthorized modification. System command files include files present in directories used by the operating system for storing default system executables and files present in directories included in the system's default executable search paths.",
      "severity": "medium"
    },
    {
      "id": "V-795",
      "title": "All system files, programs, and directories must be owned by a system account.",
      "description": "Restricting permissions will protect the files from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-796",
      "title": "System files, programs, and directories must be group-owned by a system group.",
      "description": "Restricting permissions will protect the files from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-797",
      "title": "The /etc/shadow (or equivalent) file must be owned by root.",
      "description": "The /etc/shadow file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.  Failure to give ownership of sensitive files or utilities to root provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-798",
      "title": "The /etc/passwd file must have mode 0644 or less permissive.",
      "description": "If the password file is writable by a group owner or the world, the risk of password file compromise is increased.  The password file contains the list of accounts on the system and associated information.",
      "severity": "medium"
    },
    {
      "id": "V-800",
      "title": "The /etc/shadow (or equivalent) file must have mode 0400.",
      "description": "The /etc/shadow file contains the list of local system accounts.  It is vital to system security and must be protected from unauthorized modification.  The file also contains password hashes which must not be accessible to users other than root.",
      "severity": "medium"
    },
    {
      "id": "V-801",
      "title": "The owner, group owner, mode, ACL, and location of files with the setuid bit set must be documented using site-defined procedures.",
      "description": "All files with the setuid bit set will allow anyone running these files to be temporarily assigned the UID of the file. While many system files depend on these attributes for proper operation, security problems can result if setuid is assigned to programs that allow reading and writing of files, or shell escapes.  Only default vendor-supplied executables should have the setuid bit set.",
      "severity": "medium"
    },
    {
      "id": "V-802",
      "title": "The owner, group-owner, mode, ACL, and location of files with the setgid bit set must be documented using site-defined procedures.",
      "description": "All files with the setgid bit set will allow anyone running these files to be temporarily assigned the GID of the file. While many system files depend on these attributes for proper operation, security problems can result if setgid is assigned to programs that allow reading and writing of files, or shell escapes.",
      "severity": "medium"
    },
    {
      "id": "V-803",
      "title": "The system must be checked weekly for unauthorized setuid files, as well as, unauthorized modification to authorized setuid files.",
      "description": "Files with the setuid bit set will allow anyone running these files to be temporarily assigned the UID of the file. While many system files depend on these attributes for proper operation, security problems can result if setuid is assigned to programs that allow reading and writing of files, or shell escapes.",
      "severity": "medium"
    },
    {
      "id": "V-804",
      "title": "The system must be checked weekly for unauthorized setgid files, as well as, unauthorized modification to authorized setgid files.",
      "description": "Files with the setgid bit set will allow anyone running these files to be temporarily assigned the group id of the file. While many system files depend on these attributes for proper operation, security problems can result if setgid is assigned to programs that allow reading and writing of files, or shell escapes.",
      "severity": "medium"
    },
    {
      "id": "V-805",
      "title": "Removable media, remote file systems, and any file system that does not contain approved setuid files must be mounted with the \"nosuid\" option.",
      "description": "The \"nosuid\" mount option causes the system to not execute setuid files with owner privileges.  This option must be used for mounting any file system that does not contain approved setuid files.  Executing setuid files from untrusted file systems, or file systems that do not contain approved setuid files, increases the opportunity for unprivileged users to attain unauthorized administrative access.",
      "severity": "medium"
    },
    {
      "id": "V-806",
      "title": "The sticky bit must be set on all public directories.",
      "description": "Failing to set the sticky bit on the public directories allows unauthorized users to delete files in the directory structure.\n\nThe only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage (e.g., /tmp) and for directories requiring global read/write access.",
      "severity": "low"
    },
    {
      "id": "V-807",
      "title": "All public directories must be owned by root or an application account.",
      "description": "If a public directory has the sticky bit set and is not owned by a privileged UID, unauthorized users may be able to modify files created by others.\n\nThe only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage (e.g., /tmp) and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-808",
      "title": "The system and user default umask must be 077.",
      "description": "The umask controls the default access mode assigned to newly created files.  An umask of 077 limits new files to mode 700 or less permissive.  Although umask can be represented as a 4-digit number, the first digit representing special access modes is typically ignored or required to be 0.  This requirement applies to the globally configured system defaults and the user defaults for each account on the system.",
      "severity": "medium"
    },
    {
      "id": "V-810",
      "title": "Default system accounts must be disabled or removed.",
      "description": "Vendor accounts and software may contain backdoors allowing unauthorized access to the system.  These backdoors are common knowledge and present a threat to system security if the account is not disabled.",
      "severity": "medium"
    },
    {
      "id": "V-811",
      "title": "Auditing must be implemented.",
      "description": "Without auditing, individual system accesses cannot be tracked and malicious activity cannot be detected and traced back to an individual account. ",
      "severity": "medium"
    },
    {
      "id": "V-812",
      "title": "System audit logs must be owned by root.",
      "description": "Failure to give ownership of system audit log files to root provides the designated owner and unauthorized users with the potential to access sensitive information.",
      "severity": "medium"
    },
    {
      "id": "V-813",
      "title": "System audit logs must have mode 0640 or less permissive.",
      "description": "If a user can write to the audit logs, audit trails can be modified or destroyed and system intrusion may not be detected.  System audit logs are those files generated from the audit system and do not include activity, error, or other log files created by application software.",
      "severity": "medium"
    },
    {
      "id": "V-814",
      "title": "The audit system must be configured to audit failed attempts to access files and programs.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-815",
      "title": "The audit system must be configured to audit file deletions.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-816",
      "title": "The audit system must be configured to audit all administrative, privileged, and security actions.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-818",
      "title": "The audit system must be configured to audit login, logout, and session initiation.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-819",
      "title": "The audit system must be configured to audit all discretionary access control permission modifications.",
      "description": "If the system is not configured to audit certain activities and write them to an audit log, it is more difficult to detect and track system compromises and damages incurred during a system compromise.\n",
      "severity": "medium"
    },
    {
      "id": "V-821",
      "title": "The inetd.conf file must be owned by root or bin.",
      "description": "Failure to give ownership of sensitive files or utilities to root provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-822",
      "title": "The inetd.conf file must have mode 0440 or less permissive.",
      "description": "The Internet service daemon configuration files must be protected as malicious modification could cause Denial of Service or increase the attack surface of the system.",
      "severity": "medium"
    },
    {
      "id": "V-823",
      "title": "The services file must be owned by root or bin.",
      "description": "Failure to give ownership of sensitive files or utilities to root or bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-824",
      "title": "The services file must have mode 0444 or less permissive.",
      "description": "The services file is critical to the proper operation of network services and must be protected from unauthorized modification.  Unauthorized modification could result in the failure of network services.",
      "severity": "medium"
    },
    {
      "id": "V-825",
      "title": "Global initialization files must contain the mesg -n or mesg n commands.",
      "description": "If the mesg -n or mesg n command is not placed into the system profile, messaging can be used to cause a Denial of Service attack.",
      "severity": "low"
    },
    {
      "id": "V-827",
      "title": "The hosts.lpd file (or equivalent) must not contain a \"+\" character.",
      "description": "Having the \"+\" character in the hosts.lpd (or equivalent) file allows all hosts to use local system print resources.",
      "severity": "medium"
    },
    {
      "id": "V-828",
      "title": "The hosts.lpd (or equivalent) file must be owned by root.",
      "description": "Failure to give ownership of the hosts.lpd file to root provides the designated owner, and possible unauthorized users, with the potential to modify the hosts.lpd file.  Unauthorized modifications could disrupt access to local printers from authorized remote hosts or permit unauthorized remote access to local printers.",
      "severity": "medium"
    },
    {
      "id": "V-829",
      "title": "The hosts.lpd (or equivalent) must have mode 0644 or less permissive.",
      "description": "Excessive permissions on the hosts.lpd (or equivalent) file may permit unauthorized modification.  Unauthorized modifications could disrupt access to local printers from authorized remote hosts or permit unauthorized remote access to local printers.",
      "severity": "medium"
    },
    {
      "id": "V-831",
      "title": "The alias file must be owned by root.",
      "description": "If the alias file is not owned by root, an unauthorized user may modify the file to add aliases to run malicious code or redirect email.",
      "severity": "medium"
    },
    {
      "id": "V-832",
      "title": "The alias file must have mode 0644 or less permissive.",
      "description": "Excessive permissions on the aliases file may permit unauthorized modification.  If the alias file is modified by an unauthorized user, they may modify the file to run malicious code or redirect email.",
      "severity": "medium"
    },
    {
      "id": "V-836",
      "title": "The system syslog service must log informational and more severe SMTP service messages.",
      "description": "If informational and more severe SMTP service messages are not logged, malicious activity on the system may go unnoticed.",
      "severity": "medium"
    },
    {
      "id": "V-837",
      "title": "The SMTP service log file must be owned by root.",
      "description": "If the SMTP service log file is not owned by root, then unauthorized personnel may modify or delete the file to hide a system compromise.",
      "severity": "medium"
    },
    {
      "id": "V-838",
      "title": "The SMTP service log file must have mode 0644 or less permissive.",
      "description": "If the SMTP service log file is more permissive than 0644, unauthorized users may be allowed to change the log file.",
      "severity": "medium"
    },
    {
      "id": "V-840",
      "title": "The ftpusers file must exist.",
      "description": "The ftpusers file contains a list of accounts not allowed to use FTP to transfer files. If this file does not exist, then unauthorized accounts can utilize FTP.\n",
      "severity": "medium"
    },
    {
      "id": "V-841",
      "title": "The ftpusers file must contain account names not allowed to use FTP.",
      "description": "The ftpusers file contains a list of accounts that are not allowed to use FTP to transfer files. If the file does not contain the names of all accounts not authorized to use FTP, then unauthorized use of FTP may take place.\n",
      "severity": "medium"
    },
    {
      "id": "V-842",
      "title": "The ftpusers file must be owned by root.",
      "description": "If the file ftpusers is not owned by root, an unauthorized user may modify the file to allow unauthorized accounts to use FTP.\n",
      "severity": "medium"
    },
    {
      "id": "V-843",
      "title": "The ftpusers file must have mode 0640 or less permissive.",
      "description": "Excessive permissions on the ftpusers file could permit unauthorized modification.  Unauthorized modification could result in Denial of Service to authorized FTP users or permit unauthorized users to access the FTP service.",
      "severity": "medium"
    },
    {
      "id": "V-845",
      "title": "The FTP daemon must be configured for logging or verbose mode.",
      "description": "The -l option allows basic logging of connections.  The verbose (on HP) and the debug (on Solaris) allow logging of what files the FTP session transferred.  This extra logging makes it possible to easily track which files are being transferred onto or from a system.  If they are not configured, the only option for tracking is the audit files.  The audit files are much harder to read.  If auditing is not properly configured, then there would be no record at all of the file transfer transactions.",
      "severity": "low"
    },
    {
      "id": "V-846",
      "title": "Anonymous FTP must not be active on the system unless authorized.",
      "description": "Due to the numerous vulnerabilities inherent in anonymous FTP, it is recommended that it not be used. If anonymous FTP must be used on a system, the requirement must be authorized and approved in the system accreditation package.",
      "severity": "medium"
    },
    {
      "id": "V-847",
      "title": "The TFTP daemon must operate in secure mode which provides access only to a single directory on the host file system.",
      "description": "Secure mode limits TFTP requests to a specific directory.  If TFTP is not running in secure mode, it may be able to write to any file or directory and may seriously impair system integrity, confidentiality, and availability.\n",
      "severity": "high"
    },
    {
      "id": "V-848",
      "title": "The TFTP daemon must have mode 0755 or less permissive.",
      "description": "If TFTP runs with the setuid or setgid bit set, it may be able to write to any file or directory and may seriously impair system integrity, confidentiality, and availability.",
      "severity": "high"
    },
    {
      "id": "V-849",
      "title": "The TFTP daemon must be configured to vendor specifications, including a dedicated TFTP user account, a non-login shell, such as /bin/false, and a home directory owned by the TFTP user.",
      "description": "If TFTP has a valid shell, it increases the likelihood of someone logging to the TFTP account and compromising the system.",
      "severity": "medium"
    },
    {
      "id": "V-850",
      "title": "Any X Windows host must write .Xauthority files.",
      "description": ".Xauthority files ensure the user is authorized to access the specific X Windows host.  If .Xauthority files are not used, it may be possible to obtain unauthorized access to the X Windows host.",
      "severity": "medium"
    },
    {
      "id": "V-867",
      "title": "The Network Information System (NIS) protocol must not be used.",
      "description": "Due to numerous security vulnerabilities existing within NIS, it must not be used.  Possible alternative directory services are NIS+ and LDAP.",
      "severity": "medium"
    },
    {
      "id": "V-899",
      "title": "All interactive users must be assigned a home directory in the /etc/passwd file.",
      "description": "If users do not have a valid home directory, there is no place for the storage and control of files they own.",
      "severity": "low"
    },
    {
      "id": "V-900",
      "title": "All interactive user home directories defined in the /etc/passwd file must exist.",
      "description": "If a user has a home directory defined that does not exist, the user may be given the / directory, by default, as the current working directory upon logon.  This could create a Denial of Service because the user would not be able to perform useful tasks in this location.",
      "severity": "low"
    },
    {
      "id": "V-901",
      "title": "All users' home directories must have mode 0750 or less permissive.",
      "description": "Excessive permissions on home directories allow unauthorized access to user's files.",
      "severity": "medium"
    },
    {
      "id": "V-902",
      "title": "All interactive user's home directories must be owned by their respective users.",
      "description": "If users do not own their home directories, unauthorized users could access user files.",
      "severity": "medium"
    },
    {
      "id": "V-903",
      "title": "All interactive user's home directories must be group-owned by the home directory owner's primary group.",
      "description": "If the GID of the home directory is not the same as the GID of the user, this would allow unauthorized access to files.",
      "severity": "medium"
    },
    {
      "id": "V-904",
      "title": "All local initialization files must be owned by the user or root.",
      "description": "Local initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-905",
      "title": "All local initialization files must have mode 0740 or less permissive.",
      "description": "Local initialization files are used to configure the user's shell environment upon login.  Malicious modification of these files could compromise accounts upon logon.",
      "severity": "medium"
    },
    {
      "id": "V-906",
      "title": "All run control scripts must have mode 0755 or less permissive.",
      "description": "If the startup files are writable by other users, they could modify the startup files to insert malicious commands into the startup files.\n",
      "severity": "medium"
    },
    {
      "id": "V-907",
      "title": "Run control scripts executable search paths must contain only authorized paths.",
      "description": "The executable search path (typically the PATH environment variable) contains a list of directories for the shell to search to find executables. If this path includes the current working directory or other relative paths, executables in these directories may be executed instead of system commands. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, two consecutive colons, or a single period, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-910",
      "title": "Run control scripts must not execute world-writable programs or scripts.\n",
      "description": "World-writable files could be modified accidentally or maliciously to compromise system integrity.",
      "severity": "high"
    },
    {
      "id": "V-913",
      "title": "There must be no .netrc files on the system.\n",
      "description": "Unencrypted passwords for remote FTP servers may be stored in .netrc files.  Policy requires passwords be encrypted in storage and not used in access scripts.",
      "severity": "medium"
    },
    {
      "id": "V-914",
      "title": "All files and directories contained in interactive user's home directories must be owned by the home directory's owner.",
      "description": "If users do not own the files in their directories, unauthorized users may be able to access them. Additionally, if files are not owned by the user, this could be an indication of system compromise.",
      "severity": "low"
    },
    {
      "id": "V-915",
      "title": "All files and directories contained in user's home directories must have mode 0750 or less permissive.",
      "description": "Excessive permissions allow unauthorized access to user's files.\n",
      "severity": "low"
    },
    {
      "id": "V-916",
      "title": "The /etc/shells (or equivalent) file must exist.",
      "description": "The shells file (or equivalent) lists approved default shells.  It helps provide layered defense to the security approach by ensuring users cannot change their default shell to an unauthorized shell that may not be secure.",
      "severity": "medium"
    },
    {
      "id": "V-917",
      "title": "All shells referenced in /etc/passwd must be listed in the /etc/shells file, except any shells specified for the purpose of preventing logins.",
      "description": "The shells file lists approved default shells.  It helps provide layered defense to the security approach by ensuring users cannot change their default shell to an unauthorized shell that may not be secure.",
      "severity": "medium"
    },
    {
      "id": "V-918",
      "title": "Accounts must be locked upon 35 days of inactivity.",
      "description": "On some systems, accounts with disabled passwords still allow access using rcp, remsh, or rlogin through equivalent remote hosts. All that is required is the remote host name and the user name match an entry in a hosts.equiv file and have a .rhosts file in the user directory. Using a shell called /bin/false or /dev/null (or an equivalent) will add a layered defense.\n\nNon-interactive accounts on the system, such as application accounts, may be documented exceptions.\n",
      "severity": "medium"
    },
    {
      "id": "V-921",
      "title": "All shell files must be owned by root or bin.",
      "description": "If shell files are owned by users other than root or bin, they could be modified by intruders or malicious users to perform unauthorized actions.",
      "severity": "medium"
    },
    {
      "id": "V-922",
      "title": "All shell files must have mode 0755 or less permissive.",
      "description": "Shells with world/group-write permissions give the ability to maliciously modify the shell to obtain unauthorized access.",
      "severity": "high"
    },
    {
      "id": "V-923",
      "title": "The system must be checked for extraneous device files at least weekly.",
      "description": "If an unauthorized device is allowed to exist on the system, there is the possibility the system may perform unauthorized operations.",
      "severity": "low"
    },
    {
      "id": "V-924",
      "title": "Device files and directories must only be writable by users with a system account or as configured by the vendor.",
      "description": "System device files in writable directories could be modified, removed, or used by an unprivileged user to control system hardware.",
      "severity": "medium"
    },
    {
      "id": "V-925",
      "title": "Device files used for backup must only be readable and/or writable by root or the backup user.",
      "description": "System backups could be accidentally or maliciously overwritten and destroy the ability to recover the system if a compromise should occur.  Unauthorized users could also copy system files.",
      "severity": "medium"
    },
    {
      "id": "V-926",
      "title": "Any NIS+ server must be operating at security level 2.",
      "description": "If the NIS+ server is not operating in, at least, security level 2, there is no encryption and the system could be penetrated by intruders and/or malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-928",
      "title": "The NFS export configuration file must be owned by root.",
      "description": "Failure to give ownership of the NFS export configuration file to root provides the designated owner and possible unauthorized users with the potential to change system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-929",
      "title": "The NFS export configuration file must have mode 0644 or less permissive.",
      "description": "Excessive permissions on the NFS export configuration file could allow unauthorized modification of the file, which could result in Denial of Service to authorized NFS exports and the creation of additional unauthorized exports.",
      "severity": "low"
    },
    {
      "id": "V-931",
      "title": "All NFS-exported system files and system directories must be owned by root.",
      "description": "Failure to give ownership of sensitive files or directories  to root provides the designated owner and possible unauthorized users with the potential to access sensitive information or change system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-932",
      "title": "The NFS anonymous UID and GID must be configured to values that have no permissions.",
      "description": "When an NFS server is configured to deny remote root access, a selected UID and GID are used to handle requests from the remote root user.  The UID and GID should be chosen from the system to provide the appropriate level of non-privileged access.",
      "severity": "medium"
    },
    {
      "id": "V-933",
      "title": "The NFS server must be configured to restrict file system access to local hosts.",
      "description": "The NFS access option limits user access to the specified level. This assists in protecting exported file systems.  If access is not restricted, unauthorized hosts may be able to access the system's NFS exports.",
      "severity": "medium"
    },
    {
      "id": "V-934",
      "title": "The system's NFS export configuration must not have the sec option set to none (or equivalent); additionally, the default authentication must not to be set to none.",
      "description": "If sec=none on Solaris, all NFS requests are mapped to an unknown/common user instead of being processed according to the provided UID.",
      "severity": "medium"
    },
    {
      "id": "V-935",
      "title": "The NFS server must not allow remote root access.",
      "description": "If the NFS server allows root access to local file systems from remote hosts, this access could be used to compromise the system.",
      "severity": "medium"
    },
    {
      "id": "V-936",
      "title": "The nosuid option must be enabled on all NFS client mounts.",
      "description": "Enabling the nosuid mount option prevents the system from granting owner or group-owner privileges to programs with the setuid or setgid bit set.  If the system does not restrict this access, users with unprivileged access to the local system may be able to acquire privileged access by executing setuid or setgid files located on the mounted NFS file system.",
      "severity": "medium"
    },
    {
      "id": "V-940",
      "title": "The system must use an access control program.",
      "description": "Access control programs (such as TCP_WRAPPERS) provide the ability to enhance system security posture.\n",
      "severity": "medium"
    },
    {
      "id": "V-941",
      "title": "The system's access control program must log each system access attempt.",
      "description": "If access attempts are not logged, then multiple attempts to log on to the system by an unauthorized user may go undetected.",
      "severity": "medium"
    },
    {
      "id": "V-953",
      "title": "The Solaris system Automated Security Enhancement Tool (ASET) configurable parameters in the asetenv file must be correct.",
      "description": "If settings in the asetenv file have been modified, then system vulnerabilities may not be detected.",
      "severity": "medium"
    },
    {
      "id": "V-954",
      "title": "The asetenv file YPCHECK variable must be set to true when NIS+ is configured.",
      "description": "If YPCHECK is not set to true in asetenv, then ypfiles may not be checked.",
      "severity": "medium"
    },
    {
      "id": "V-955",
      "title": "The /usr/aset/userlist file must exist.",
      "description": "If the userlist file does not exist, then an unauthorized user may exist in the /etc/passwd file.",
      "severity": "medium"
    },
    {
      "id": "V-956",
      "title": "The /usr/aset/userlist file must be owned by root.",
      "description": "If the userlist file is not owned by root, then an unauthorized user can modify the file and enter an unauthorized user.",
      "severity": "medium"
    },
    {
      "id": "V-957",
      "title": "The /usr/aset/userlist file must have mode 0600 or less permissive.",
      "description": "A permission mask not set to the required level could allow unauthorized access to sensitive system files and resources.",
      "severity": "medium"
    },
    {
      "id": "V-958",
      "title": "The Solaris system EEPROM security-mode parameter must be set to full or command mode.",
      "description": "If the EEPROM security-mode parameter is not set to full or command, then unauthorized access to system EEPROM can take place.  In normal situations, when the system is in a controlled access area and it is desirable to have it automatically reboot upon loss of and restoring of power, for instance, then command mode with the autoboot parameter set to true is recommended.",
      "severity": "medium"
    },
    {
      "id": "V-974",
      "title": "Access to the cron utility must be controlled using the cron.allow and/or cron.deny file(s).",
      "description": "The cron facility allows users to execute recurring jobs on a regular and unattended basis.  The cron.allow file designates accounts allowed to enter and execute jobs using the cron facility.  If neither cron.allow nor cron.deny exists, then any account may use the cron facility.  This may open the facility up for abuse by system intruders and malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-975",
      "title": "The cron.allow file must have mode 0600 or less permissive.",
      "description": "A cron.allow file that is readable and/or writable by other than root could allow potential intruders and malicious users to use the file contents to help discern information, such as who is allowed to execute cron programs, which could be harmful to overall system and network security.",
      "severity": "medium"
    },
    {
      "id": "V-976",
      "title": "Cron must not execute group-writable or world-writable programs.",
      "description": "If cron executes group-writable or world-writable programs, there is a possibility that unauthorized users could manipulate the programs with malicious intent.  This could compromise system and network security.\n",
      "severity": "medium"
    },
    {
      "id": "V-977",
      "title": "Cron must not execute programs in, or subordinate to, world-writable directories.",
      "description": "If cron programs are located in or subordinate to world-writable directories, they become vulnerable to removal and replacement by malicious users or system intruders.",
      "severity": "medium"
    },
    {
      "id": "V-978",
      "title": "Crontab files must have mode 0600 or less permissive.",
      "description": "To protect the integrity of scheduled system jobs and prevent malicious modification to these jobs, crontab files must be secured.\n",
      "severity": "medium"
    },
    {
      "id": "V-979",
      "title": "Cron and crontab directories must have mode 0755 or less permissive.",
      "description": "To protect the integrity of scheduled system jobs and to prevent malicious modification to these jobs, crontab files must be secured.\n",
      "severity": "medium"
    },
    {
      "id": "V-980",
      "title": "Cron and crontab directories must be owned by root or bin.",
      "description": "Incorrect ownership of the cron or crontab directories could permit unauthorized users the ability to alter cron jobs and run automated jobs as privileged users.  Failure to give ownership of cron or crontab directories to root or to bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-981",
      "title": "Cron and crontab directories must be group-owned by root, sys, or bin.",
      "description": "To protect the integrity of scheduled system jobs and to prevent malicious modification to these jobs, crontab files must be secured.  Failure to give group-ownership of cron or crontab directories to a system group provides the designated group and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-982",
      "title": "Cron logging must be implemented.",
      "description": "Cron logging can be used to trace the successful or unsuccessful execution of cron jobs.  It can also be used to spot intrusions into the use of the cron facility by unauthorized and malicious users.\n",
      "severity": "medium"
    },
    {
      "id": "V-983",
      "title": "The cronlog file must have mode 0600 or less permissive.",
      "description": "Cron logs contain reports of scheduled system activities and must be protected from unauthorized access or manipulation.\n",
      "severity": "medium"
    },
    {
      "id": "V-984",
      "title": "Access to the at utility must be controlled via the at.allow and/or at.deny file(s).",
      "description": "The at facility selectively allows users to execute jobs at deferred times.  It is usually used for one-time jobs. The at.allow file selectively allows access to the at facility.  If there is no at.allow file, there is no ready documentation of who is allowed to submit at jobs.",
      "severity": "medium"
    },
    {
      "id": "V-985",
      "title": "The at.deny file must not be empty if it exists.",
      "description": "On some systems, if there is no at.allow file and there is an empty at.deny file, then the system assumes everyone has permission to use the at facility.  This could create an insecure setting in the case of malicious users or system intruders.",
      "severity": "medium"
    },
    {
      "id": "V-986",
      "title": "Default system accounts (with the exception of root) must not be listed in the at.allow file or must be included in the at.deny file if the at.allow file does not exist.",
      "description": "Default accounts, such as bin, sys, adm, uucp, daemon, and others, should never have access to the at facility.  This would create a possible vulnerability open to intruders or malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-987",
      "title": "The at.allow file must have mode 0600 or less permissive.",
      "description": "Permissions more permissive than 0600 (read and write for the owner) may allow unauthorized or malicious access to the at.allow and/or at.deny files.",
      "severity": "medium"
    },
    {
      "id": "V-988",
      "title": "The \"at\" daemon must not execute group-writable or world-writable programs.",
      "description": "If the \"at\" facility executes world-writable or group-writable programs, it is possible for the programs to be accidentally or maliciously changed or replaced without the owner's intent or knowledge.  This would cause a system security breach.",
      "severity": "medium"
    },
    {
      "id": "V-989",
      "title": "The \"at\" daemon must not execute programs in, or subordinate to, world-writable directories.",
      "description": "If \"at\" programs are located in or subordinate to world-writable directories, they become vulnerable to removal and replacement by malicious users or system intruders.",
      "severity": "medium"
    },
    {
      "id": "V-993",
      "title": "SNMP communities, users, and passphrases must be changed from the default.",
      "description": "Whether active or not, default SNMP passwords, users, and passphrases must be changed to maintain security. If the service is running with the default authenticators, then anyone can gather data about the system and the network and use the information to potentially compromise the integrity of the system or network(s).",
      "severity": "high"
    },
    {
      "id": "V-994",
      "title": "The snmpd.conf file must have mode 0600 or less permissive.",
      "description": "The snmpd.conf file contains authenticators and must be protected from unauthorized access and modification.",
      "severity": "medium"
    },
    {
      "id": "V-995",
      "title": "Management Information Base (MIB) files must have mode 0640 or less permissive.",
      "description": "The ability to read the MIB file could impart special knowledge to an intruder or malicious user about the ability to extract compromising information about the system or network.",
      "severity": "medium"
    }
  ]
}