{
  "name": "stig_windows_phone_6.5_with_good_mobility_suite",
  "date": "2011-10-04",
  "description": "This STIG contains technical security controls required for the use of Windows Phone 6.5 devices in the DoD environment when managed by the Good Mobility Suite.\n\n",
  "title": "Windows Phone 6.5 (with Good Mobility Suite) Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-18627",
      "title": "The VPN client on wireless clients (PDAs, smartphones) used for remote access to DoD networks must be FIPS 140-2 validated.  This check is not applicable if the installed VPN client is not used for remote access to DoD networks.  ",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.  FIPS validation provides a level of assurance that the encryption of the device has been securely implemented.",
      "severity": "medium"
    },
    {
      "id": "V-19897",
      "title": "All wireless PDA clients used for remote access to DoD networks must have a VPN that supports AES encryption.  This check is not applicable if the installed VPN client is not used for remote access to DoD networks.\n\n",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-19898",
      "title": "All wireless PDA clients used for remote access to DoD networks must have a VPN supporting CAC authentication.  This check is not applicable if the installed VPN client is not used for remote access to DoD networks.\n",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.",
      "severity": "medium"
    },
    {
      "id": "V-19899",
      "title": "All wireless PDA client VPNs must have split tunneling disabled.   This check is not applicable if the installed VPN client is not used for remote access to DoD networks.\n",
      "description": "DoD data could be compromised if transmitted data is not secured with a compliant VPN.  Split tunneling could allow connections from non-secure Internet sites to access data on the DoD network.",
      "severity": "medium"
    },
    {
      "id": "V-24981",
      "title": "Smartphone devices must have required operating system software versions installed.",
      "description": "Required security features are not available in earlier OS versions. In addition, there are known vulnerabilities in earlier versions.",
      "severity": "medium"
    },
    {
      "id": "V-24982",
      "title": "Smart Card Readers (SCRs) used with smartphone must have required software version installed.",
      "description": "Required security features are not available in earlier software versions. In addition, there may be known vulnerabilities in earlier versions.",
      "severity": "low"
    },
    {
      "id": "V-24984",
      "title": "If smartphone email auto signatures are used, the signature message must not disclose that the email originated from a smartphone (e.g., “Sent From My Wireless Handheld”). ",
      "description": "The disclaimer message may give information which may key an attacker in on the device. This is primarily an OPSEC issue. This setting was directed by the CYBERCOM.",
      "severity": "low"
    },
    {
      "id": "V-24986",
      "title": "All non-core applications on the smartphone must be approved by the DAA or Command IT Configuration Control Board. ",
      "description": "Non-approved applications can contain malware.  Approved applications should be reviewed and tested by the approving authority to ensure they do not contain malware, spyware, or have unexpected features (e.g., send private information to a web site, track user actions, connect to a non-DoD management server).",
      "severity": "low"
    },
    {
      "id": "V-25022",
      "title": "All smartphones must display the required banner during device unlock/ logon. ",
      "description": "DoD CIO memo requires all PDAs, BlackBerrys, and smartphones to have a consent banner displayed during logon/device unlock to ensure users understand their responsibilities to safeguard DoD data. ",
      "severity": "medium"
    }
  ]
}