{
  "name": "stig_microsoft_exchange_2010_mailbox_server_role",
  "date": "2012-05-31",
  "description": "The Microsoft Exchange Server 2010 STIGs cover four of the five roles available with Microsoft Exchange Server 2010, plus core Exchange Server 2010 global requirements. The Email Services Policy STIG must also be reviewed for each site hosting email services. The core Exchange Server guidance must be reviewed on each server role prior to the role-specific guidance. Also, for the Client Access server, the IIS guidance must be reviewed prior to the OWA checks.",
  "title": "Microsoft Exchange 2010 Mailbox Server Role",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "EXCH-MB-400",
      "title": "Mail quota settings must not restrict receiving mail.",
      "description": "Mail quota settings control the maximum sizes of a user's mailbox and the system's response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   There are three controls, which supply graduated levels of opportunity to respond before risking data loss.  \n\nThis control impedes users in their ability to work, and is not recommended, as mail interruption is not acceptable.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-401",
      "title": "Mail Store storage quota must be limited.",
      "description": "Mail quota settings control the maximum sizes of a user's mailbox and the system's response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   There are multiple controls, which supply graduated levels of opportunity to respond before risking data loss.  \n\nThis control prohibits the user from sending an email when the mailbox limit reaches the prohibit send quota value.\n\nNote: Best practice for this setting is to prohibit the user from sending email when the mailbox reaches 90 percent of capacity.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-402",
      "title": "Mail Store storage quota must issue a warning.",
      "description": "Mail quota settings control the maximum sizes of a user's mailbox and the system's response if these limits are exceeded.   Mailbox data that is not monitored against a quota increases the risk of mail loss due to filled disk space, which can also render the system unavailable.   There are multiple controls, which supply graduated levels of opportunity to respond before risking data loss.  \n\nThis control sends the user a warning message that the mailbox is reaching its limit. The user at this point can still send and receive email.\n  \nNote: Best practice is to send this warning when the mailbox reaches 75 percent of capacity.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-403",
      "title": "Public Store storage quota must be limited.",
      "description": "This setting controls the maximum sizes of a Public Folder and the system's response if these limits are exceeded. There are two available controls and the system response when the quota has been exceeded. \n\nThe first control sends an email warning to Folder Owners roles alerting them that the folder has exceeded its quota.  The second level prevents posting any additional items to the folder.  \n\nAs a practical matter, level 1 serves the purpose of prompting owners to manage their folders.  Level 2 impedes users in their ability to work, and is not required where folder use interruption is not acceptable.   Public Folder Storage Quota Limitations are not a substitute for overall disk space monitoring.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-404",
      "title": "The Mailbox Stores must mount at startup.",
      "description": "Administrator responsibilities include the ability to react to unplanned maintenance tasks or emergency situations that may require Mailbox data manipulation.  Occasionally, there may be a need to start the server with 'unmounted' data stores,  if manual maintenance is being performed on them.  Failure to uncheck the 'do not mount on startup' condition will result in unavailability of mail services.  \n\nCorrect configuration of this control will prevent unplanned outages due to being enabled.  On occasions when it is needed, care should be taken in process steps to clear the check box upon task completion, so that mail stores are available to users (unmounted mailbox stores are not available to users).",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-405",
      "title": "The Public Folder Stores must mount at startup.",
      "description": "Administrator responsibilities include the ability to react to unplanned maintenance tasks or emergency situations that may require Public Folder Store data manipulation.  Occasionally, there may be a need to start the server with 'unmounted' data stores, if manual maintenance is being performed on them.  Failure to uncheck the 'do not mount on startup' condition will result in unavailability of Public Folder services.  \n\nCorrect configuration of this control will prevent unplanned outages due to being enabled.  On occasions when it is needed, care should be taken in process steps to clear the checkbox task completion, so that public folder stores are available to users  (unmounted public folder stores are not available to users).",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-406",
      "title": "The email server Circular Logging must be disabled.",
      "description": "Logging provides a history of events performed, and can also provide evidence of tampering or attack.  Failure to create and preserve logs adds to the risk that suspicious events may go unnoticed, or the raise the potential that insufficient history will be available to investigate them.  \n\nThis setting controls how log files are written. If circular logging is enabled, there is one log file for this storage group with a maximum size of (for example, 5MB). Once the size limit has been reached, additional log entries begin overwriting the oldest log entries.  If circular logging is disabled, once a log file reaches the size limit, a new log file is created. \n\nBack-End Servers should not use circular logging.  Logs should be written to a partition separate from the operating system, with log protection and backups being incorporated into the overall System Security plan. \n\nFront-End Servers may opt to use circular logging, as message content is significantly less, and not of a critical nature.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-407",
      "title": "Email \"Subject Line\" logging must be enabled.",
      "description": "Log files help establish a history of activities, and can be useful in detecting attack attempts or determining tuning adjustments to improve availability.  When \"message tracking\" is enabled, only the sender, recipients, time, and other delivery information are included by default.   Information such as the subject and message body is not included.  \n\nHowever, the absence of the message subject line can make it difficult to locate a specific message in the log unless one knows roughly what time the message was sent.  To simplify searches through these logs, Exchange offers the ability to include the message \"subject line\" in the log files and in the Message Tracking Center display.  This can make it significantly easier to locate a specific Message.  \n\nThis feature creates larger log files and will contain information that may raise privacy and legal concerns - enterprise policy should be consulted before this feature is enabled. Also, since the log files may contain sensitive information in the form of the subject line, the log files will need to be protected, commensurate with the sensitivity level, as the content may be of interest to an attacker.  \n\nFor these reasons, it is recommended that subject logging not be enabled during regular production operations, but instead treat this feature as a diagnostic that can be used if needed. The tradeoff of this is that finding the correct message in the message tracking logs will become more difficult since the administrator will need to search using only the time the message was sent and the message's sender.  This control will have no effect unless Message Tracking is enabled. That said, the setting should be disabled in case message tracking is perchance enabled at a future time.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-408",
      "title": "Message Tracking Logging must be disabled.",
      "description": "A message tracking log provides a detailed log of all message activity as messages are transferred to and from a computer running Exchange. Message tracking is available on Hub Transport servers, Edge Transport servers, and Mailbox servers. By default, message tracking is enabled.\nIf events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-409",
      "title": "Queue monitoring must be configured with threshold and action.",
      "description": "Monitors are automated \"process watchers\" that respond to performance changes, and can be useful in detecting outages and alerting administrators where attention is needed.   Exchange has built-in monitors that enable the administrator to generate alerts if thresholds are reached, better enabling them to react in a timely fashion.  \n\nThis field offers choices of alerts when a 'warning' or 'critical' threshold is reached on the SMTP queue.  A good rule of thumb (default) is to issue warnings when SMTP queue growth exceeds 10 minutes and critical messages when it exceeds 20 minutes, which should only exist occasionally.  Frequent alerts against this counter may indicate a network or other issue (such as inbound SPAMMER traffic) that directly impacts email delivery.   \n\nNotification choices include email alert to an email enabled account, for example, an email Administrator, or invoke a script to take other action, for example, to add an Event to the Microsoft Application Event Log, where external monitors might detect it.\n   \n\nNote: If a third party application is performing monitoring functions, the reviewer should verify the  application is monitoring correctly and mark the vulnerability N/A.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-410",
      "title": "Mail must be retained until backups are complete.",
      "description": "Backup and recovery procedures are an important part of overall system availability and integrity.   Complete backups reduce the chance of accidental deletion of important information, and ensure that complete recoveries are possible.  \n  \nIt is not uncommon for users to receive and delete messages in the scope of a single backup cycle.   This setting ensures at least one backup has been run on the mailbox store before the message physically disappears.  By enabling this setting, all messages written to recipients who have accounts on this store will reside in backups even if they have been deleted by the user before the backup has run.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-411",
      "title": "Public Folder stores must be retained until backups are complete.",
      "description": "Backup and recovery procedures are an important part of overall system availability and integrity.   Complete backups reduce the chance of accidental deletion of important information, and ensure that complete recoveries are possible.  \n  \nIt is not uncommon for users to receive and delete documents in the scope of a single backup cycle.   This setting ensures at least one backup has been run on the folder store before the message physically disappears.  By enabling this setting, all messages written to recipients who have accounts on this store will reside in backups even if they have been deleted by the user before the backup has run.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-412",
      "title": "Mailbox database must not be overwritten by a restore.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.    Unauthorized or accidental restoration of mailbox data risks data loss or corruption.   \n\nThis setting controls whether the mailbox store can be overwritten by a backup, which will cause loss of all information added after the backup was created.  It should only be enabled during maintenance windows or following an outage (immediately before a restore is to be made), and cleared again immediately afterwards.  \n\nDuring production windows, this setting must be disabled.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-413",
      "title": "Public Folder database must not be overwritten by a restore.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.  Unauthorized or accidental restoration of public folder data risks data loss or corruption.  \n\nThis setting controls whether the public folder store can be overwritten by a restore from backup, which will cause loss of all information added after the backup was created.  It should only be enabled during maintenance windows or following an outage (immediately before a restore is to be made), and cleared again immediately afterwards.  \n\nDuring production windows, this setting must be disabled.",
      "severity": "low"
    },
    {
      "id": "EXCH-MB-414",
      "title": "Mailbox databases must reside on a dedicated partition.",
      "description": "In the same way that added security layers can provide a cumulative positive effect on security posture, multiple applications can provide a cumulative negative effect. A vulnerability and subsequent exploit to one application can lead to an exploit of other applications sharing the same security context. For example, an exploit to a web server process that leads to unauthorized administrative access to the host system can most likely lead to a compromise of all applications hosted by the same system.\n\nEmail services should be installed to a discrete set of directories, on a partition that does not host other applications.   Email services should never be installed on a Domain Controller / Directory Services server.",
      "severity": "medium"
    },
    {
      "id": "EXCH-MB-415",
      "title": "Email SMTP forwarding must be restricted.",
      "description": "Auto-forwarding email to external email accounts is prohibited.  Auto-forwarded e-mail to non-CAC enabled e-mail accounts does not meet requirement for digital signature and encryption of CUI and PII IAW DODI 8520.2 (reference ee) and DOD Director for Administration and Management memorandum, \"Safeguarding Against and Responding to the Breach of Personally Identifiable Information\" (reference ttt). ",
      "severity": "medium"
    }
  ]
}