{
  "name": "stig_wireless_remote_access_policy_security_implementation_guide",
  "date": "2013-03-12",
  "description": "This STIG contains the policy, training, and operating procedure security controls for the use of wireless LAN clients in the DoD environment.",
  "title": "Wireless Remote Access Policy Security Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-25034",
      "title": "Users must receive training on required topics before they are authorized to access a DoD network via a wireless remote access device. ",
      "description": "Improper use of wireless remote access to a DoD network can compromise both the wireless client and the network, as well as, expose DoD data to unauthorized people. Without adequate training remote access users are more likely to engage in behaviors that make DoD networks and information more vulnerable to security exploits.",
      "severity": "low"
    },
    {
      "id": "V-25035",
      "title": "The site must have a Wireless Remote Access Policy signed by the site DAA, Commander, Director, or other appropriate authority. ",
      "description": "Wireless clients, DoD data, and the DoD network could be compromised if operational policies for the use of wireless remote access are not documented by the site.",
      "severity": "low"
    },
    {
      "id": "V-25036",
      "title": "The site physical security policy must include a statement if CMDs with digital cameras (still and video) are permitted or prohibited on or in the DoD facility.",
      "description": "Wireless client, networks, and data could be compromised if unapproved wireless remote access is used.  In most cases, unapproved devices are not managed and configured as required by the appropriate STIG and the site’s overall network security controls are not configured to provide adequate security for unapproved devices.  When listed in the SSP, the site has shown that security controls have been designed to account for the wireless devices.",
      "severity": "low"
    }
  ]
}