{
  "name": "stig_vmware_vcenter_server_version_5",
  "date": "2016-02-10",
  "description": "The VMware vCenter Server Version 5 Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "VMware vCenter Server Version 5 Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-39544",
      "title": "The VMware Update Manager must not be configured to manage its own VM or the VM of its vCenter Server.",
      "description": "The VMware Update Manager (vUM) and vCenter Server (vCS) are VM installable on an ESXi hypervisor host. For all ESXi hypervisors and VMs, including those of the vCS and the vUM, software and system security patches must be installed and up-to-date. For the use case where the vUM hypervisor/VM or the vCS hypervisor/VM reboots while undergoing remediation, this will halt that process. Note that for the use case where the vCS hypervisor/VM reboots, the result is a worst case scenario of a temporary, unplanned vCS outage.",
      "severity": "medium"
    },
    {
      "id": "V-39545",
      "title": "Privilege re-assignment must be checked after the vCenter Server restarts.",
      "description": "During a restart of vCenter Server, if the user or user group that is assigned Administrator role on the root folder could not be verified as a valid user/group during the restart, the user/group's permission as Administrator will be removed. In its place, vCenter Server defaults the Administrator role to the local Windows administrators group, to act as a new vCenter Server Administrator. This default administrative assignment must be rectified by re-establishing a legitimate vCenter Server account with an Administrator role.",
      "severity": "medium"
    },
    {
      "id": "V-39546",
      "title": "The Web datastore browser must be disabled, unless required for normal day-to-day operations.",
      "description": "The Web datastore browser enables viewing of all the datastores associated with the vSphere deployment, including all folders and files, such as VM files. This functionality is controlled by the organization-specific, user permissions on vCenter Server.",
      "severity": "low"
    },
    {
      "id": "V-39547",
      "title": "The managed object browser must be disabled, at all times, when not required for the purpose of troubleshooting or maintenance of managed objects.",
      "description": "The managed object browser provides a way to explore the object model used by the vCenter to manage the vSphere environment; it enables configurations to be changed as well. This interface is used primarily for debugging, and might potentially be used to perform malicious configuration changes or actions.",
      "severity": "low"
    },
    {
      "id": "V-39548",
      "title": "The vCenter Server must be installed using a service account instead of a built-in Windows account.",
      "description": "The Microsoft Windows built-in system account or a user account can be used to run vCenter Server. With a user account, the Windows authentication for SQL Server can be enabled; it also provides more security. The user account must be an administrator on the local machine. In the installation wizard, specify the account name as DomainName\\Username. If using SQL Server for the vCenter database, the SQL Server database must be configured to allow the domain account access to SQL Server. The Microsoft Windows built-in system account has more permissions and rights on the server than the vCenter Server system requires, which can contribute to security problems. A local user, administrative level account with limited permissions and rights must be set up for the vCenter Server system. ",
      "severity": "low"
    },
    {
      "id": "V-39549",
      "title": "The connectivity between Update Manager and public patch repositories must be restricted by use of a separate Update Manager Download Server.",
      "description": "The Update Manager Download Service (UMDS) is an optional module of the Update Manager. UMDS downloads upgrades for virtual appliances, patch metadata, patch binaries, and notifications that would not otherwise be available to the Update Manager server. For security reasons and deployment restrictions, the Update Manager must be installed in a secured network that is disconnected from the Internet. The Update Manager requires access to patch information to function properly. UMDS must be installed on a separate system that has Internet access to download upgrades, patch binaries, and patch metadata, and then export the downloads to a portable media drive so that they become accessible to the Update Manager server.\n",
      "severity": "low"
    },
    {
      "id": "V-39550",
      "title": "The vCenter Server administrative users must have the correct roles assigned.",
      "description": "Administrative users must only be assigned privileges they require. Least Privilege requires that these privileges must only be assigned if needed, to reduce risk of confidentiality, availability or integrity loss.",
      "severity": "medium"
    },
    {
      "id": "V-39551",
      "title": "Access to SSL certificates must be monitored.",
      "description": "The directory that contains the SSL certificates only needs to be accessed by the service account user on a regular basis. Occasionally, the vCenter Server system administrator might need to access it for support purposes.  The SSL certificate can be used to impersonate vCenter and decrypt the vCenter database password.",
      "severity": "medium"
    },
    {
      "id": "V-39553",
      "title": "Expired certificates must be removed from the vCenter Server.",
      "description": "If expired certificates are not removed from the vCenter Server, the user can be subject to a MiTM attack, which potentially might enable compromise through impersonation with the user's credentials to the vCenter Server system.",
      "severity": "medium"
    },
    {
      "id": "V-39554",
      "title": "Log files must be cleaned up after failed installations of the vCenter Server.",
      "description": "If the vCenter installation fails, a log file (with a name of the form \"hs_err_pidXXXX\") is created that contains the database password in plain text. An attacker who breaks into the vCenter Server could potentially steal this password and access the vCenter Database.",
      "severity": "medium"
    },
    {
      "id": "V-39555",
      "title": "Revoked certificates must be removed from the vCenter Server.",
      "description": "If revoked certificates are not removed from the vCenter Server, the user can be subject to a MiTM attack, which potentially might enable compromise through impersonation with the user's credentials to the vCenter Server system.",
      "severity": "medium"
    },
    {
      "id": "V-39556",
      "title": "The vCenter Administrator role must be secured and assigned to specific users other than a Windows Administrator.",
      "description": "By default, vCenter Server grants full administrative rights to the local administrator's account, which can be accessed by domain administrators. Separation of duties dictates that full vCenter Administrative rights should be granted only to those administrators who are required to have it. This privilege should not be granted to any group whose membership is not strictly controlled. Therefore, administrative rights should be removed from the local Windows administrator account and instead be given to a special-purpose local vCenter Administrator account. This account should be used to create individual user accounts.",
      "severity": "medium"
    },
    {
      "id": "V-39557",
      "title": "Access to SSL certificates must be restricted.",
      "description": "The SSL certificate can be used to impersonate vCenter and decrypt the vCenter database password. By default, only the service user account and the vCenter Server administrators can access the directory containing the SSL certificates. The directory that contains the SSL certificates only needs to be accessed by the service account user on a regular basis. Occasionally, when collecting data for support purposes, the vCenter Server system administrator might need to access it. The permissions should be checked on a regular basis to ensure they have not been changed to add unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-39558",
      "title": "The system must restrict unauthorized vSphere users from being able to execute commands within the guest virtual machine.",
      "description": "By default, vCenter Server \"Administrator\" role allows users to interact with files and programs inside a virtual machine's guest operating system. Least Privilege requires that this privilege should not be granted to any users who are not authorized, to reduce risk of Guest confidentiality, availability, or integrity loss. To prevent such loss, a non-guest access role must be created without these privileges. This role is for users who need administrator privileges excluding those allowing file and program interaction within the guests.",
      "severity": "medium"
    },
    {
      "id": "V-39559",
      "title": "The use of Linux-based clients must be restricted.",
      "description": "Although SSL-based encryption is used to protect communication between client components and vCenter Server or ESXi, the Linux versions of these components do not perform certificate validation. Even if the self-signed certificates are replaced on vCenter and ESXi with legitimate certificates signed by the local root certificate authority or a third party, communications with Linux clients are still vulnerable to MiTM attacks. ",
      "severity": "low"
    },
    {
      "id": "V-39560",
      "title": "Network access to the vCenter Server system must be restricted.",
      "description": "Restrict access to only those essential components required to communicate with vCenter. Blocking access by unnecessary systems reduces the potential for general attacks on the operating system and minimizes risk.",
      "severity": "low"
    },
    {
      "id": "V-39561",
      "title": "A least-privileges assignment must be used for the vCenter Server database user.",
      "description": "Least-privileges mitigates attacks if the vCenter database account is compromised. vCenter requires very specific privileges on the database. Privileges normally required only for installation and upgrade must be removed for/during normal operation. These privileges may be reinstated if/when any future upgrade must be performed.",
      "severity": "medium"
    },
    {
      "id": "V-39562",
      "title": "A least-privileges assignment must be used for the Update Manager database user.",
      "description": "Least-privileges mitigates attacks if the Update Manager database account is compromised. The VMware Update Manager requires certain privileges for the database user in order to install, and the installer will automatically check for these. The privileges on the VUM database user must be reduced for normal operation.",
      "severity": "medium"
    },
    {
      "id": "V-39563",
      "title": "The system must set a timeout for all thick-client logins without activity.",
      "description": "An inactivity timeout must be set for the vSphere Client (Thick Client). This client-side setting can be changed by users, so this must be set by default and re-audited. Automatic session termination minimizes risk and reduces the potential for unauthorized access to vCenter.",
      "severity": "medium"
    },
    {
      "id": "V-39564",
      "title": "vSphere Client plugins must be verified.",
      "description": "The vCenter Server includes a vSphere Client extensibility framework, which provides the ability to extend the vSphere Client with menu selections or toolbar icons that provide access to vCenter Server add-on components or external, Web-based functionality. vSphere Client plugins or extensions run at the same privilege level as the user. Malicious extensions might masquerade as useful add-ons while compromising the system by stealing credentials or incorrectly configuring the system.",
      "severity": "medium"
    },
    {
      "id": "V-39566",
      "title": "The vCenter Administrator role must be secured by assignment to specific users authorized as vCenter Administrators.",
      "description": "By default, vCenter Server grants full administrative rights to the local administrator's account, which can be accessed by domain administrators. Separation of duties dictates that full vCenter Administrative rights should be granted only to those administrators who are required to have it. This privilege should not be granted to any group whose membership is not strictly controlled. Administrative rights should be removed from the local Windows administrator account and be assigned to a special-purpose local vCenter Administrator account. This account should be used to create individual user accounts.",
      "severity": "high"
    },
    {
      "id": "V-39568",
      "title": "The Update Manager Download Server must be isolated from direct connection to Internet public patch repositories by a proxy server.",
      "description": "In a typical deployment, the Update Manager Download Server connects to public patch repositories on the Internet to download patches. This connection must be restricted as much as possible to prevent access from the outside to the Update Manager Download Server. Any direct channel to the Internet represents a threat.",
      "severity": "medium"
    },
    {
      "id": "V-39569",
      "title": "The Update Manager must not directly connect to public patch repositories on the Internet.",
      "description": "In a typical deployment, the Update Manager connects to public patch repositories on the Internet to download patches. Any channel to the Internet represents a threat. For security reasons and deployment restrictions, the Update Manager must be installed in a secured network that is disconnected from the Internet.",
      "severity": "medium"
    }
  ]
}