{
  "name": "stig_blackberry_10_os",
  "date": "2014-08-27",
  "description": "Developed by BlackBerry Ltd. in coordination with DISA for use in the DoD. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.letterkenny.FSO.mbx.stig-customer-support-mailbox@mail.mil.",
  "title": "BlackBerry 10 OS Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-38290",
      "title": "BlackBerry 10 OS must display the DoD warning banner exactly as specified at startup device unlock.",
      "description": "The operating system is required to display the DoD approved system use notification message or banner before granting access to the system that provides privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. This ensures the legal requirements for auditing and monitoring are met. \n\nSystem use notification messages can be displayed when individuals log in to the information system. The approved DoD text must be used as specified in the DoD CIO memorandum dated 9 May 2008 (see the check text for required wording).",
      "severity": "low"
    },
    {
      "id": "V-38291",
      "title": "BlackBerry 10 OS must retain the work space lock until the user reestablishes access using established identification and authentication procedures.",
      "description": "The device lock function prevents further access to the system by initiating a session lock after a period of inactivity or upon receiving a request from a user. The device lock is retained until the user reestablishes access using established identification and authentication procedures.\n\nA device lock is a temporary action taken when a user stops work, but does not want to log out because of the temporary nature of the hiatus. During the device lock, a publicly viewable pattern is visible on the associated display, hiding what was previously visible on the screen. Once invoked, the device lock shall remain in place until the user reauthenticates. No other system activity aside from reauthentication can unlock the system.\n\nThe operating system must enforce a device lock function. This prevents others from gaining access to the device when not in the user's possession, and from accessing sensitive DoD information. The identification and authentication procedure configuration must be set by a Mobile Device Management (MDM) service and be sufficiently complex to protect sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-38292",
      "title": "BlackBerry 10 OS must retain the device lock until the user reestablishes access using established identification and authentication procedures.",
      "description": "The device lock function prevents further access to the system by initiating a session lock after a period of inactivity or upon receiving a request from a user. The device lock is retained until the user reestablishes access using established identification and authentication procedures.\n\nA device lock is a temporary action taken when a user stops work, but does not want to log out because of the temporary nature of the hiatus. During the device lock, a publicly viewable pattern is visible on the associated display, hiding what was previously visible on the screen. Once invoked, the device lock shall remain in place until the user reauthenticates. No other system activity aside from reauthentication can unlock the system.\n\nThe operating system must enforce a device lock function. This prevents others from gaining access to the device when not in the user's possession, and from accessing sensitive DoD information. The identification and authentication procedure configuration must be set by a Mobile Device Management (MDM) service and be sufficiently complex to protect sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-38293",
      "title": "BlackBerry 10 OS must lock the Work Space after no more than 15 minutes of inactivity.",
      "description": "The device lock function prevents further access to the system by initiating a session lock after a period of inactivity or upon receiving a request from a user. The device lock is retained until the user reestablishes access using established identification and authentication procedures.\n\nA device lock is a temporary action taken when a user stops work, but does not want to shut down because of the temporary nature of the hiatus. During the device lock, a publicly viewable pattern is visible on the associated display, hiding what was previously visible on the screen. Once invoked, the device lock shall remain in place until the user reauthenticates. No other system activity aside from reauthentication can unlock the system.\n\nThe operating system must lock the device after the organization defined time period. This prevents others from gaining access to the device when not in the user's possession, and from accessing sensitive DoD information. A device lock mitigates the risk that an adversary can access data on an unattended mobile device, but only after the maximum of a 15-minute period of inactivity.",
      "severity": "medium"
    },
    {
      "id": "V-38294",
      "title": "BlackBerry 10 OS must prevent applications from extending the Work Space password lock time.",
      "description": "The device lock function prevents further access to the system by initiating a session lock after a period of inactivity or upon receiving a request from a user. The device lock is retained until the user reestablishes access using established identification and authentication procedures.\n\nA device lock is a temporary action taken when a user stops work, but does not want to shut down because of the temporary nature of the hiatus. During the device lock, a publicly viewable pattern is visible on the associated display, hiding what was previously visible on the screen. Once invoked, the device lock shall remain in place until the user reauthenticates. No other system activity aside from reauthentication can unlock the system.\n\nThe operating system must lock the device after the organization defined time period. This prevents others from gaining access to the device when not in the user's possession, and from accessing sensitive DoD information. A device lock mitigates the risk that an adversary can access data on an unattended mobile device, but only after the maximum of a 15-minute period of inactivity.",
      "severity": "medium"
    },
    {
      "id": "V-38295",
      "title": "BlackBerry 10 OS must synchronize the internal clock at least once every 24 hours with an authoritative time server or the Global Positioning System.",
      "description": "Determining the correct time a particular application event occurred on a system is critical when conducting forensic analysis and investigating system events. \n\nPeriodically synchronizing internal clocks with an authoritative time source is needed in order to correctly correlate the timing of events that occur across the enterprise. The two authoritative time sources for mobile operating systems are an authoritative time server which is synchronized with redundant United States Naval Observatory (USNO) time servers as designated for the appropriate DoD network (NIPRNet or SIPRNet) or the Global Positioning System (GPS).\n\nTimestamps generated by the audit system in mobile operating systems shall include both date and time. The time may be expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC.",
      "severity": "low"
    },
    {
      "id": "V-38296",
      "title": "BlackBerry 10 OS must disallow the Work Space unlock password from containing fewer than a specified minimum number of upper case alphabetic characters.",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute force attack. Setting minimum numbers of certain types of characters increases password complexity, and therefore makes it more difficult for an adversary to discover the password. In the DoD, the expectation is that the setting will range from a minimum of 1 to 2 upper case alphabetic characters in the device unlock password. The parameter should be selected based on a risk assessment that weighs factors, such as the environments the device will be located and operational requirements for users to access data in a timely manner.",
      "severity": "medium"
    },
    {
      "id": "V-38297",
      "title": "BlackBerry 10 OS must disallow the Work Space unlock password from containing fewer than a specified minimum number of lower case alphabetic characters.",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute force attack. Setting minimum numbers of certain types of characters increases password complexity, and therefore makes it more difficult for an adversary to discover the password. In the DoD, the expectation is that the setting will range from a minimum of 1 to 2 lower case characters in the device unlock password. The parameter should be selected based on a risk assessment that weighs factors, such as the environments the device will be located and operational requirements for users to access data in a timely manner.",
      "severity": "medium"
    },
    {
      "id": "V-38298",
      "title": "BlackBerry 10 OS must disallow the Work Space unlock password from containing fewer than a specified minimum number of numeric characters.",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute force attack. Setting minimum numbers of certain types of characters increases password complexity, and therefore makes it more difficult for an adversary to discover the password. In the DoD, the expectation is that the setting will range from a minimum of 1 to 2 numeric characters in the device unlock password. The parameter should be selected based on a risk assessment that weighs factors, such as the environments the device will be located and operational requirements for users to access data in a timely manner.",
      "severity": "medium"
    },
    {
      "id": "V-38301",
      "title": "BlackBerry 10 OS must enforce a minimum length for the Work Space unlock password.",
      "description": "Password complexity, or strength, is a measure of the effectiveness of a password in resisting guessing and brute force attacks. The ability to crack a password is a function of how many attempts are made to crack the password, how quickly the adversary can make each attempt, and the size of the password space. The longer the minimum length of the password is, the larger the password space.",
      "severity": "medium"
    },
    {
      "id": "V-38302",
      "title": "BlackBerry 10 OS must prevent a user from installing unapproved applications.",
      "description": "The operating system must enforce software installation by users based upon what types of software installations are permitted (e.g., updates and security patches to existing software) and what types of installations are prohibited (e.g., software whose pedigree with regard to being potentially malicious is unknown or suspect) by the organization. The installation and execution of unauthorized software on an operating system may allow the application to obtain sensitive information or further compromise the system. Preventing a user from installing unapproved applications mitigates this risk.",
      "severity": "high"
    },
    {
      "id": "V-38303",
      "title": "BlackBerry 10 OS must only permit download of software from a DoD approved source (e.g., DoD operated mobile device application store or MDM server).",
      "description": "DoD can perform due diligence on sources of software to mitigate the risk that malicious software is introduced to those sources. Therefore, if software is downloaded from a DoD approved source, then it is less likely to be malicious than if it is downloaded from an unapproved source. To prevent access to unapproved sources, the operating system, in most cases, can be configured to disable user access to public application stores. However, in some cases, DoD may approve downloads directly from the OS vendor.",
      "severity": "medium"
    },
    {
      "id": "V-38304",
      "title": "BlackBerry 10 OSs Wi-Fi module must use EAP-TLS authentication when authenticating to DoD WLAN authentication servers.",
      "description": "Without strong mutual authentication, a mobile device may connect to an unauthorized network. In many cases, the user may falsely believe that the device is connected to an authorized network and then provide authentication credentials and other sensitive information. EAP-TLS is strong mutual authentication, leveraging a public key infrastructure. Its use greatly mitigates risk associated with authentication transactions.",
      "severity": "medium"
    },
    {
      "id": "V-38305",
      "title": "BlackBerry 10 OS VPN client must employ DoD approved PKI mechanisms for authentication when connecting to DoD networks.",
      "description": "VPNs are vulnerable to attack if they are not supported by strong authentication. An adversary may be able to gain access to network resources and sensitive information if they can compromise the authentication process. Common Access Card (CAC) authentication is a strong cryptographic two-factor authentication that greatly mitigates the risk of VPN authentication breaches. Other DoD approved PKI mechanisms provide similar levels of assurance.",
      "severity": "medium"
    },
    {
      "id": "V-38307",
      "title": "BlackBerry 10 OSs VPN client must use either IPSec or SSL/TLS when connecting to DoD networks.",
      "description": "Use of non-standard communications protocols can affect both the availability and confidentiality of communications. IPSec and SSL/TLS are both well-known and tested protocols that provide strong assurance with respect to both IA and interoperability.",
      "severity": "medium"
    },
    {
      "id": "V-38309",
      "title": "BlackBerry 10 OS must prohibit the use of non-DoD authorized instant messaging (IM) systems.",
      "description": "Many instant messaging systems have known vulnerabilities, some of which allow an adversary to install malware on the device. This malware can then be used to obtain sensitive information or further compromise DoD information systems. Restricting IM traffic to DoD authorized IM systems mitigates the risk of using IM technology.",
      "severity": "medium"
    },
    {
      "id": "V-38311",
      "title": "Only DoD PKI issued or DoD approved software authentication certificates may be installed on the Work Space of the BlackBerry 10 OS.",
      "description": "If unauthorized software authentication certificates are installed on the device, then the operating system would not block malware signed by the entity that published these certificates. Such malware could be used to obtain sensitive DoD information or to further breach system security. Eliminating unapproved software authentication certificates greatly mitigates the risk of malware passing authentication controls.",
      "severity": "high"
    },
    {
      "id": "V-38312",
      "title": "Only DoD PKI issued or DoD approved server authentication certificates may be installed on the Work Space of the BlackBerry 10 OS.",
      "description": "If unauthorized device authentication certificates are installed on the device, there is the potential that the device may connect to a rogue device or network. Rogue devices can mimic the behavior of authorized equipment to trick the user into providing authentication credentials, which could then in turn be used to compromise DoD information and networks. Restricting device authentication certificates to an authorized list mitigates the risk of attaching to rogue devices and networks.",
      "severity": "medium"
    },
    {
      "id": "V-38313",
      "title": "BlackBerry 10 OS must prevent a user from using a browser that does not direct its Wi-Fi traffic to a DoD proxy server.",
      "description": "Proxy servers can inspect traffic for malware and other signs of a security attack. Allowing a mobile device to access the public Internet without proxy server inspection forgoes the protection that the proxy server would otherwise provide. Malware downloaded onto the device could have a wide variety of malicious consequences, including loss of sensitive DoD information. Forcing traffic to flow through a proxy server greatly mitigates the risk of access to public Internet resources.",
      "severity": "medium"
    },
    {
      "id": "V-38314",
      "title": "BlackBerry 10 OS must prevent a user from using a browser that does not direct its VPN traffic to a DoD proxy server.",
      "description": "Proxy servers can inspect traffic for malware and other signs of a security attack. Allowing a mobile device to access the public Internet without proxy server inspection forgoes the protection that the proxy server would otherwise provide. Malware downloaded onto the device could have a wide variety of malicious consequences, including loss of sensitive DoD information. Forcing traffic to flow through a proxy server greatly mitigates the risk of access to public Internet resources.",
      "severity": "medium"
    },
    {
      "id": "V-38316",
      "title": "BlackBerry 10 OS must employ mobile device management services to centrally manage IT Policies.",
      "description": "Security related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced, and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large scale environment relative to an environment in which each device must be configured separately.",
      "severity": "medium"
    },
    {
      "id": "V-38317",
      "title": "BlackBerry 10 OS must employ mobile device management services to centrally manage email settings.",
      "description": "Security related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced, and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large scale environment relative to an environment in which each device must be configured separately.",
      "severity": "medium"
    },
    {
      "id": "V-38318",
      "title": "BlackBerry 10 OS must employ mobile device management services to centrally manage Wi-Fi profiles.",
      "description": "Security related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced, and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large scale environment relative to an environment in which each device must be configured separately.",
      "severity": "medium"
    },
    {
      "id": "V-38319",
      "title": "BlackBerry 10 OS must employ mobile device management services to centrally manage VPN profiles.",
      "description": "Security related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced, and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large scale environment relative to an environment in which each device must be configured separately.",
      "severity": "medium"
    },
    {
      "id": "V-38321",
      "title": "BlackBerry 10 OS must prohibit wireless remote access connections for storage.",
      "description": "The device acts as a personal hotspot when it accepts remote connections on a local area network interface for the purposes of routing traffic to a wide area network interface. The most common implementation is to accept local area Wi-Fi connections to reach ISP service provided by a cellular data carrier. The objective is to ensure the remote devices are not able to access any applications, data, or other operating system functionality on the device. A core assumption of the MOS SRG is that mobile devices do not serve applications to remote devices. If remote access to applications and data were feasible, this would open up a wide variety of vulnerabilities in which an adversary with a remote wireless capability could breach system security. Precluding this possibility greatly mitigates the risk of such an attack.",
      "severity": "medium"
    },
    {
      "id": "V-38322",
      "title": "BlackBerry 10 OS must prohibit wireless remote access connections for media sharing",
      "description": "The device acts as a personal hotspot when it accepts remote connections on a local area network interface for the purposes of routing traffic to a wide area network interface. The most common implementation is to accept local area Wi-Fi connections to reach ISP service provided by a cellular data carrier. The objective is to ensure the remote devices are not able to access any applications, data, or other operating system functionality on the device. A core assumption of the MOS SRG is that mobile devices do not serve applications to remote devices. If remote access to applications and data were feasible, this would open up a wide variety of vulnerabilities in which an adversary with a remote wireless capability could breach system security. Precluding this possibility greatly mitigates the risk of such an attack.",
      "severity": "medium"
    },
    {
      "id": "V-38323",
      "title": "BlackBerry 10 OS must enable a system administrator to select which data fields will be available to applications outside of the contact database application.",
      "description": "The contact database often contains a significant amount of information beyond each person's name and phone number. The records may contain addresses and other identifying or sensitive information that should not be revealed. There may be cases in which an organization has determined that it is an acceptable risk to distribute parts of a person's contact record but not others. Enabling the system administrator to select which fields are available outside the contact database application assists with management of the risk.",
      "severity": "low"
    },
    {
      "id": "V-39313",
      "title": "BlackBerry 10 OS must be updated to the latest approved version of the operating system.",
      "description": "Operating system updates contain new security related features and security patches that address known vulnerabilities. Running the latest DoD approved software version improves the security posture of the mobile device.",
      "severity": "medium"
    },
    {
      "id": "V-39314",
      "title": "BlackBerry 10 OS must prevent DoD applications from accessing non-DoD data when the device supports multiple user environments (e.g., work and personal) if such access has not been approved.",
      "description": "When a device is used for more than one purpose (e.g., work and personal) there is the potential for information from one environment to migrate inappropriately over into the other environment. Therefore, it is critical for DoD applications and information be restricted from non-DoD applications and information. In many cases, the presence of non-DoD data on DoD information systems violates either local or department guidelines. \n\nIn the context of this IA control, a DoD application is an application that processes DoD data. The characteristics of being distributed through a DoD application store, or digitally signed or repacked by a DoD entity, do not by themselves make the application a DoD application. For example, a weather or map application signed and distributed from a DoD application store would not be a DoD application unless the weather, map, or other data was considered DoD data. \n\nThe mobile operating system must prevent this occurrence using appropriate technical controls to mitigate the risk of data leakage. The objective is to provide appropriate separation between each environment on the device.",
      "severity": "low"
    },
    {
      "id": "V-39315",
      "title": "BlackBerry 10 OS must enforce complexity requirements for the authentication to access private keys saved in the key certificate stores.",
      "description": "The cornerstone of the PKI is the private key used to encrypt or digitally sign information. If the private key is stolen, this will lead to the compromise of the authentication and non-repudiation gained through PKI because the attacker can use the private key to digitally sign documents and can pretend to be the authorized user. \n\nAllowing unauthenticated access to private keys can enable an adversary in possession of the device to decrypt messages encrypted with the public key and to digitally sign data, thereby potentially enabling an adversary to impersonate the user in any application that uses that private key for user authentication. Requiring complexity requirements for the authentication to access keys saved in the certificate store protects sensitive information. A weak password may enable an adversary to crack it, and give it the ability to use the private key to decrypt sensitive information or improperly impersonate the user of the device.",
      "severity": "medium"
    },
    {
      "id": "V-39316",
      "title": "BlackBerry 10 OS must support both software-based and hardware-based asymmetric key technology (e.g., CAC/PIV).",
      "description": "Software-based certificates are required to authenticate many web sites. Hardware-based tokens are embedded in the DoD Common Access Card (CAC). Without both software and hardware-based asymmetric key technology, there is the potential that critical authentication transactions cannot occur. This will either hinder performance of the mission or degrade the IA posture of one or more applications. If the operating system can support both software and hardware-based asymmetric key technology, this provides assurance that all required certificate-based transactions are supported.",
      "severity": "medium"
    },
    {
      "id": "V-40713",
      "title": "BlackBerry 10 OS must have access to DoD root and intermediate PKI certificates when performing DoD PKI related transactions.",
      "description": "DoD root and intermediate PKI certificates are used to verify the authenticity of PKI certificates of users and web services. If the root and intermediate certificates are not available, an adversary could falsely sign a certificate in such a way that it could not be detected. Providing access to the DoD root and intermediate PKI certificates greatly diminishes the risk of this attack.",
      "severity": "medium"
    },
    {
      "id": "V-40714",
      "title": "BlackBerry 10 OS must grant a downloaded application only the permissions that DoD has authorized for that application.",
      "description": "Mobile operating system applications that are able to perform unintended functions may be able to obtain sensitive information or otherwise compromise system security. The permissions that an application requires to perform its function may be delineated in a permissions manifest or in entitlements that are either bound to the application or embedded in its code. Enforcing these permissions limitations is necessary to ensure the application is not permitted to perform unintended functions.",
      "severity": "high"
    },
    {
      "id": "V-40716",
      "title": "BlackBerry 10 OS maximum number of consecutive unsuccessful unlock attempts must be configurable within a range from 5 to 10.",
      "description": "The recommended setting for the maximum number of consecutive unsuccessful unlock attempts is 10. In some environments, a lower number may be needed to provide greater protection of sensitive information. Allowing for configuration enables the local command to enforce greater protection when it is deemed necessary. If the limit is not configurable, then it is permissible for a site to procure and deploy devices that enforce the limit specified by the organization, so long as that limit does not exceed 10.",
      "severity": "medium"
    },
    {
      "id": "V-40717",
      "title": "BlackBerry 10 OS must use a DoD proxy server.",
      "description": "Proxy servers can inspect traffic for malware and other signs of a security attack. Allowing a mobile device to access the public Internet without proxy server inspection forgoes the protection that the proxy server would otherwise provide. Malware downloaded onto the device could have a wide variety of malicious consequences, including loss of sensitive DoD information. Forcing traffic to flow through a proxy server greatly mitigates the risk of access to public Internet resources.\n\nProxy profiles specify how users use a proxy server to access web services on the Internet or on the DoD network. A proxy profile can be associated with a Wi-Fi profile or VPN profile. For users to use a proxy server when they connect to the Internet or the DoD network using the BlackBerry Infrastructure, associate a proxy profile with a BlackBerry Device Service instance. To add a proxy profile to a BlackBerry Device Service instance, all devices running BlackBerry 10 OS associated with the instance use the proxy profile to access web services on the Internet or DoD's network using the BlackBerry Infrastructure. Devices use the BlackBerry Infrastructure when a VPN or Wi-Fi connection is not available.",
      "severity": "medium"
    },
    {
      "id": "V-53889",
      "title": "BlackBerry 10 OS versions no longer supported by the manufacturer or vendor must not be installed on a device.",
      "description": "Unsupported versions of the operating system do not contain new security-related features and security patches that address known vulnerabilities. Software or hardware no longer supported by the manufacturer or vendor are not maintained or updated for current vulnerabilities leaving them open to potential attack.",
      "severity": "high"
    }
  ]
}