{
  "name": "stig_layer_2_switch_-_cisco",
  "date": "2019-01-09",
  "description": "Layer 2 Switch Security Technical Implementation Guide - Cisco",
  "title": "Layer 2 Switch Security Technical Implementation Guide - Cisco",
  "version": "8",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-14669",
      "title": "The administrator must ensure BSD r command services are disabled. ",
      "description": "Berkeley Software Distribution (BSD) “r” commands allow users to execute commands on remote systems using a variety of protocols.  The BSD \"r\" commands (e.g., rsh, rlogin, rcp, rdump, rrestore, and rdist) are designed to provide convenient remote access without passwords to services such as remote command execution (rsh), remote login (rlogin), and remote file copy (rcp and rdist).  The difficulty with these commands is that they use address-based authentication.  An attacker who convinces a server that he is coming from a \"trusted\" machine can essentially get complete and unrestricted access to a system.  The attacker can convince the server by impersonating a trusted machine and using IP address, by confusing DNS so that DNS thinks that the attacker's IP address maps to a trusted machine's name, or by any of a number of other methods",
      "severity": "medium"
    },
    {
      "id": "V-14671",
      "title": "Network devices must authenticate all NTP messages received from NTP servers and peers.",
      "description": "Since NTP is used to ensure accurate log file time stamp information, NTP could pose a security risk if a malicious user were able to falsify NTP information. To launch an attack on the NTP infrastructure, a hacker could inject time that would be accepted by NTP clients by spoofing the IP address of a valid NTP server. To mitigate this risk, the time messages must be authenticated by the client before accepting them as a time source. \n\nTwo NTP-enabled devices can communicate in either client-server mode or peer-to-peer mode (aka \"symmetric mode\"). The peering mode is configured manually on the device and indicated in the outgoing NTP packets. The fundamental difference is the synchronization behavior: an NTP server can synchronize to a peer with better stratum, whereas it will never synchronize to its client regardless of the client's stratum. From a protocol perspective, NTP clients are no different from the NTP servers. The NTP client can synchronize to multiple NTP servers, select the best server and synchronize with it, or synchronize to the averaged value returned by the servers.\n\nA hierarchical model can be used to improve scalability. With this implementation, an NTP client can also become an NTP server providing time to downstream clients at a higher stratum level and of decreasing accuracy than that of its upstream server. To increase availability, NTP peering can be used between NTP servers. In the event the device loses connectivity to its upstream NTP server, it will be able to choose time from one of its peers. \n\nThe NTP authentication model is opposite of the typical client-server authentication model. NTP authentication enables an NTP client or peer to authenticate time received from their servers and peers. It is not used to authenticate NTP clients because NTP servers do not care about the authenticity of their clients, as they never accept any time from them.",
      "severity": "medium"
    },
    {
      "id": "V-14717",
      "title": "The network element must not use SSH Version 1 for administrative access.",
      "description": "SSH Version 1 is a protocol that has never been defined in a standard.  Since SSH-1 has inherent design flaws which make it vulnerable to, e.g., man-in-the-middle attacks, it is now generally considered obsolete and should be avoided by explicitly disabling fallback to SSH-1. ",
      "severity": "medium"
    },
    {
      "id": "V-15432",
      "title": "Network devices must use two or more authentication servers for the purpose of granting administrative access.",
      "description": "The use of Authentication, Authorization, and Accounting (AAA) affords the best methods for controlling user access, authorization levels, and activity logging.  By enabling AAA on the routers in conjunction with an authentication server such as TACACS+ or RADIUS, the administrators can easily add or remove user accounts, add or remove command authorizations, and maintain a log of user activity.\n\nThe use of an authentication server provides the capability to assign router administrators to tiered groups that contain their privilege level that is used for authorization of specific commands.   For example, user mode would be authorized for all authenticated administrators while configuration or edit mode should only be granted to those administrators that are permitted to implement router configuration changes.",
      "severity": "medium"
    },
    {
      "id": "V-15434",
      "title": "The emergency administration account must be set to an appropriate authorization level to perform necessary administrative functions when the authentication server is not online.",
      "description": "The emergency administration account is to be configured as a local account on the network devices. It is to be used only when the authentication server is offline or not reachable via the network. The emergency account must be set to an appropriate authorization level to perform necessary administrative functions during this time.",
      "severity": "high"
    },
    {
      "id": "V-17820",
      "title": "The OOBM access switch is not physically connected to the managed network element OOBM interface.",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface of the managed network element must be directly connected to the OOBM network to ensure seperation. An OOBM interface does not forward transit traffic; thereby, providing complete separation of production and management traffic. Since all management traffic is immediately forwarded into the management network, it is not exposed to possible tampering.  The separation also ensures that congestion or failures in the managed network do not affect the management of the device. ",
      "severity": "medium"
    },
    {
      "id": "V-17821",
      "title": "Managed NE OOBM interface is not configured with an OOBM network address.",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface of the managed network element will be directly connected to the OOBM network. An OOBM interface does not forward transit traffic; thereby, providing complete separation of production and management traffic. Since all management traffic is immediately forwarded into the management network, it is not exposed to possible tampering.  The separation also ensures that congestion or failures in the managed network do not affect the management of the device. If the OOBM interface does not have an IP address from the managed network address space, it will not have reachability from the NOC using scalable and normal control plane and forwarding mechanisms.",
      "severity": "medium"
    },
    {
      "id": "V-17824",
      "title": "The management interface is an access switchport and has not been assigned to a separate management VLAN. ",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface can be a true OOBM interface or a standard interface functioning as the management interface. In either case, the management interface of the managed network element will be directly connected to the OOBM network. If the device does not have an OOBM port, the interface functioning as the management interface must be configured so that management traffic does not leak into the managed network and that production traffic does not leak into the management network.",
      "severity": "medium"
    },
    {
      "id": "V-17825",
      "title": "An address has not been configured for the management VLAN from space belonging to the OOBM network assigned to that site.",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface can be a true OOBM interface or a standard interface functioning as the management interface. In either case, the management interface of the managed network element will be directly connected to the OOBM network.\n\nAn OOBM interface does not forward transit traffic; thereby, providing complete separation of production and management traffic. Since all management traffic is immediately forwarded into the management network, it is not exposed to possible tampering.  The separation also ensures that congestion or failures in the managed network do not affect the management of the device. ",
      "severity": "low"
    },
    {
      "id": "V-17826",
      "title": "The access switchport connecting to the OOBM access switch is not the only port with membership to the management VLAN.",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface can be a true OOBM interface or a standard interface functioning as the management interface. In either case, the management interface of the managed network element will be directly connected to the OOBM network.\n\nAn OOBM interface does not forward transit traffic; thereby, providing complete separation of production and management traffic. Since all management traffic is immediately forwarded into the management network, it is not exposed to possible tampering.  The separation also ensures that congestion or failures in the managed network do not affect the management of the device. ",
      "severity": "medium"
    },
    {
      "id": "V-17827",
      "title": "The management VLAN is not pruned from any VLAN trunk links belonging to the managed network’s infrastructure. \n\n",
      "description": "The OOBM access switch will connect to the management interface of the managed network elements. The management interface can be a true OOBM interface or a standard interface functioning as the management interface. In either case, the management interface of the managed network element will be directly connected to the OOBM network.\n\nAn OOBM interface does not forward transit traffic; thereby, providing complete separation of production and management traffic. Since all management traffic is immediately forwarded into the management network, it is not exposed to possible tampering.  The separation also ensures that congestion or failures in the managed network do not affect the management of the device. If the device does not have an OOBM port, the interface functioning as the management interface must be configured so that management traffic does not leak into the managed network and that production traffic does not leak into the management network. ISL and 802.1q trunking enables multiple VLANs to traverse the same physical links between layer 2 switches or between a layer 2 switch and a router. If the management VLAN is not pruned from any VLAN trunk links belonging to the managed network’s infrastructure, management traffic has the potential to leak into the production network.\n",
      "severity": "low"
    },
    {
      "id": "V-17832",
      "title": "The management VLAN is not configured with an IP address from the management network address block.",
      "description": "If the management systems reside within the same layer 2 switching domain as the managed network elements, then separate VLANs will be deployed to provide separation at that level. In this case, the management network still has its own subnet while at the same time it is defined as a unique VLAN.  ",
      "severity": "medium"
    },
    {
      "id": "V-18544",
      "title": "Printers must be assigned to a VLAN that is not shared by unlike devices.",
      "description": "Aspects of hardening the network wall plate may include traffic filtering or restrictions on connectivity to enforce a device-, community of interest-, or user-specific security policy. For example, if a printer were plugged into a switch port, it would be prudent to ensure that only printer traffic is allowed on that switch port. If the printer is unplugged and a substitute device other than a printer is plugged into that switch port, the substitute device should not be able to communicate arbitrarily with other devices because only printer traffic is allowed on that switch port.",
      "severity": "low"
    },
    {
      "id": "V-18565",
      "title": "The IAO will ensure that all switchports configured using MAC port security will shutdown upon receiving a frame with a different layer 2 source address than what has been configured or learned for port security.",
      "description": "The Port Security feature remembers the Ethernet MAC address connected to the switch port and allows only that MAC address to communicate on that port. If any other MAC address tries to communicate through the port, port security will disable the port. ",
      "severity": "low"
    },
    {
      "id": "V-18566",
      "title": "The switch must only allow a maximum of one registered MAC address per access port.",
      "description": "Limiting the number of registered MAC addresses on a switch access port can help prevent a CAM table overflow attack.  This type of attack lets an attacker exploit the hardware and memory limitations of a switch.  If there are enough entries stored in a CAM table before the expiration of other entries, no new entries can be accepted into the CAM table. An attacker will able to flood the switch with mostly invalid MAC addresses until the CAM table’s resources have been depleted.  When there are no more resources, the switch has no choice but to flood all ports within the VLAN with all incoming traffic.  This happens because the switch cannot find the switch port number for a corresponding MAC address within the CAM table, allowing the switch to become a hub and traffic to be monitored.",
      "severity": "medium"
    },
    {
      "id": "V-23747",
      "title": "The network element must use two or more NTP servers to synchronize time.",
      "description": "Without synchronized time, accurately correlating information between devices becomes difficult, if not impossible. If you cannot successfully compare logs between each of your routers, switches, and firewalls, it will be very difficult to determine the exact events that resulted in a network breach incident. NTP provides an efficient and scalable method for network elements to synchronize to an accurate time source.",
      "severity": "low"
    },
    {
      "id": "V-28784",
      "title": "A service or feature that calls home to the vendor must be disabled.  \n",
      "description": "Call home services or features will routinely send data such as configuration and diagnostic information to the vendor for routine or emergency analysis and troubleshooting.  The risk that transmission of sensitive data sent to unauthorized persons could result in data loss or downtime due to an attack.",
      "severity": "medium"
    },
    {
      "id": "V-3012",
      "title": "Network devices must be password protected.",
      "description": "Network access control mechanisms interoperate to prevent unauthorized access and to enforce the organization's security policy. Access to the network must be categorized as administrator, user, or guest so the appropriate authorization can be assigned to the user requesting access to the network or a network device. Authorization requires an individual account identifier that has been approved, assigned, and configured on an authentication server. Authentication of user identities is accomplished through the use of passwords, tokens, biometrics, or in the case of multi-factor authentication, some combination thereof. Lack of authentication enables anyone to gain access to the network or possibly a network device providing opportunity for intruders to compromise resources within the network infrastructure.",
      "severity": "high"
    },
    {
      "id": "V-3013",
      "title": "Network devices must display the DoD-approved logon banner warning.",
      "description": "All network devices must present a DoD-approved warning banner prior to a system administrator logging on. The banner should warn any unauthorized user not to proceed. It also should provide clear and unequivocal notice to both authorized and unauthorized personnel that access to the device is subject to monitoring to detect unauthorized usage. Failure to display the required logon warning banner prior to logon attempts will limit DoD's ability to prosecute unauthorized access and also presents the potential to give rise to criminal and civil liability for systems administrators and information systems managers. In addition, DISA's ability to monitor the device's usage is limited unless a proper warning banner is displayed.\n\nDoD CIO has issued new, mandatory policy standardizing the wording of \"notice and consent\" banners and matching user agreements for all Secret and below DoD information systems, including stand-alone systems by releasing DoD CIO Memo, \"Policy on Use of Department of Defense (DoD) Information Systems Standard Consent Banner and User Agreement\", dated 9 May 2008. The banner is mandatory and deviations are not permitted except as authorized in writing by the Deputy Assistant Secretary of Defense for Information and Identity Assurance. Implementation of this banner verbiage is further directed to all DoD components for all DoD assets via USCYBERCOM CTO 08-008A.",
      "severity": "medium"
    },
    {
      "id": "V-3014",
      "title": "The network element must timeout management connections for administrative access after 10 minutes or less of inactivity.",
      "description": "Setting the timeout of the session to 10 minutes or less increases the level of protection afforded critical network components.",
      "severity": "medium"
    },
    {
      "id": "V-3020",
      "title": "The network element must have DNS servers defined if it is configured as a client resolver.",
      "description": "The susceptibility of IP addresses to spoofing translates to DNS host name and IP address mapping vulnerabilities.  For example, suppose a source host wishes to establish a connection with a destination host and queries a DNS server for the IP address of the destination host name.  If the response to this query is the IP address of a host operated by an attacker, the source host will establish a connection with the attackers host, rather than the intended target.  The user on the source host might then provide logon, authentication, and other sensitive data.",
      "severity": "low"
    },
    {
      "id": "V-3021",
      "title": "The network element must only allow SNMP access from addresses belonging to the management network.",
      "description": "Detailed information about the network is sent across the network via SNMP.  If this information is discovered by attackers it could be used to trace the network, show the networks topology, and possibly gain access to network devices.",
      "severity": "medium"
    },
    {
      "id": "V-3043",
      "title": "The network device must use different SNMP community names or groups for various levels of read and write access.",
      "description": "Numerous vulnerabilities exist with SNMP; therefore, without unique SNMP community names, the risk of compromise is dramatically increased. This is especially true with vendors default community names which are widely known by hackers and other networking experts. If a hacker gains access to these devices and can easily guess the name, this could result in denial of service, interception of sensitive information, or other destructive actions.",
      "severity": "medium"
    },
    {
      "id": "V-3056",
      "title": "Group accounts must not be configured for use on the network device.",
      "description": "Group accounts configured for use on a network device do not allow for accountability or repudiation of individuals using the shared account.  If group accounts are not changed when someone leaves the group, that person could possibly gain control of the network device.  Having group accounts does not allow for proper auditing of who is accessing or changing the network.",
      "severity": "high"
    },
    {
      "id": "V-3057",
      "title": "Authorized accounts must be assigned the least privilege level necessary to perform assigned duties.",
      "description": "By not restricting authorized accounts to their proper privilege level, access to restricted functions may be allowed before authorized personnel are trained or experienced enough to use those functions. Network disruptions or outages may occur due to mistakes made by inexperienced persons using accounts with greater privileges than necessary.",
      "severity": "medium"
    },
    {
      "id": "V-3058",
      "title": "Unauthorized accounts must not be configured for access to the network device.",
      "description": "A malicious user attempting to gain access to the network device may compromise an account that may be unauthorized for use.  The unauthorized account may be a temporary or inactive account that is no longer needed to access the device.  Denial of Service, interception of sensitive information, or other destructive actions could potentially take place if an unauthorized account is configured to access the network device.",
      "severity": "medium"
    },
    {
      "id": "V-3062",
      "title": "The network element must be configured to ensure passwords are not viewable when displaying configuration information.  ",
      "description": "Many attacks information systems and network elements are launched from within the network. Hence, it is imperative that all passwords are encrypted so they cannot be intercepted by viewing the console or printout of the configuration. \n",
      "severity": "high"
    },
    {
      "id": "V-3069",
      "title": "Management connections to a network device must be established using secure protocols with FIPS 140-2 validated cryptographic modules.",
      "description": "Administration and management connections performed across a network are inherently dangerous because anyone with a packet sniffer and access to the right LAN segment can acquire the network device account and password information.  With this intercepted information they could gain access to the router and cause denial of service attacks, intercept sensitive information, or perform other destructive actions.\n",
      "severity": "medium"
    },
    {
      "id": "V-3070",
      "title": "The network element must log all attempts to establish a management connection for administrative access.",
      "description": "Audit logs are necessary to provide a trail of evidence in case the network is compromised.  Without an audit trail that provides a when, where, who and how set of information, repeat offenders could continue attacks against the network indefinitely.  With this information, the network administrator can devise ways to block the attack and possibly identify and prosecute the attacker.",
      "severity": "low"
    },
    {
      "id": "V-3072",
      "title": "The running configuration must be synchronized with the startup configuration after changes have been made and implemented.",
      "description": "If the running and startup router configurations are not synchronized properly and a router malfunctions, it will not restart with all of the recent changes incorporated.  If the recent changes were security related, then the routers would be vulnerable to attack.",
      "severity": "low"
    },
    {
      "id": "V-3078",
      "title": "Network devices must have TCP and UDP small servers disabled.",
      "description": "Cisco IOS provides the \"small services\" that include echo, chargen, and discard. These services, especially their User Datagram Protocol (UDP) versions, are infrequently used for legitimate purposes. However, they have been used to launch denial of service attacks that would otherwise be prevented by packet filtering. For example, an attacker might send a DNS packet, falsifying the source address to be a DNS server that would otherwise be unreachable, and falsifying the source port to be the DNS service port (port 53). If such a packet were sent to the Cisco's UDP echo port, the result would be Cisco sending a DNS packet to the server in question. No outgoing access list checks would be applied to this packet, since it would be considered locally generated by the router itself. The small services are disabled by default in Cisco IOS 12.0 and later software. In earlier software, they may be disabled using the commands no service tcp-small-servers and no service udp-small-servers.",
      "severity": "low"
    },
    {
      "id": "V-3079",
      "title": "The network element must have the Finger service disabled.",
      "description": "The finger service supports the UNIX finger protocol, which is used for querying a host about the users that are logged on. This service is not necessary for generic users. If an attacker were to find out who is using the network, they may use social engineering practices to try to elicit classified DoD information.\n\n",
      "severity": "low"
    },
    {
      "id": "V-3085",
      "title": "The network element must have HTTP service for administrative access disabled.",
      "description": "The additional services the router is enabled for increases the risk for an attack since the router will listen for these services. In addition, these services provide an unsecured method for an attacker to gain access to the router. Most recent software versions support remote configuration and monitoring using the World Wide Web's HTTP protocol. In general, HTTP access is equivalent to interactive access to the router. The authentication protocol used for HTTP is equivalent to sending a clear-text password across the network, and, unfortunately, there is no effective provision in HTTP for challenge-based or one-time passwords. This makes HTTP a relatively risky choice for use across the public Internet. Any additional services that are enabled increase the risk for an attack since the router will listen for these services. The HTTPS server may be enabled for administrative access.",
      "severity": "medium"
    },
    {
      "id": "V-3143",
      "title": "Network devices must not have any default manufacturer passwords.",
      "description": "Network devices not protected with strong password schemes provide the opportunity for anyone to crack the password thus gaining access to the device and causing network outage or denial of service. Many default vendor passwords are well-known; hence, not removing them prior to deploying the network devices into production provides an opportunity for a malicious user to gain unauthorized access to the device.",
      "severity": "high"
    },
    {
      "id": "V-3160",
      "title": "The network element must be running a current and supported operating system with all IAVMs addressed.",
      "description": "Network devices that are not running the latest tested and approved versions of software are vulnerable to network attacks. Running the most current, approved version of system and device software helps the site maintain a stable base of security fixes and patches, as well as enhancements to IP security. Viruses, denial of service attacks, system weaknesses, back doors and other potentially harmful situations could render a system vulnerable, allowing unauthorized access to DoD assets.",
      "severity": "medium"
    },
    {
      "id": "V-3175",
      "title": "The network devices must require authentication prior to establishing a management connection for administrative access.",
      "description": "Network devices with no password for administrative access via a management connection provide the opportunity for anyone with network access to the device to make configuration changes enabling them to disrupt network operations resulting in a network outage.",
      "severity": "high"
    },
    {
      "id": "V-3196",
      "title": "The network device must use SNMP Version 3 Security Model with FIPS 140-2 validated cryptography for any SNMP agent configured on the device.",
      "description": "SNMP Versions 1 and 2 are not considered secure. Without the strong authentication and privacy that is provided by the SNMP Version 3 User-based Security Model (USM), an unauthorized user can gain access to network management information used to launch an attack against the network.",
      "severity": "high"
    },
    {
      "id": "V-3210",
      "title": "The network device must not use the default or well-known SNMP community strings public and private.",
      "description": "Network devices may be distributed by the vendor pre-configured with an SNMP agent using the well-known SNMP community strings public for read only and private for read and write authorization. An attacker can obtain information about a network device using the read community string \"public\". In addition, an attacker can change a system configuration using the write community string \"private\".",
      "severity": "high"
    },
    {
      "id": "V-3966",
      "title": "In the event the authentication server is unavailable, the network device must have a single local account of last resort defined.",
      "description": "Authentication for administrative access to the device is required at all times. A single account of last resort can be created on the device's local database for use in an emergency such as when the authentication server is down or connectivity between the device and the authentication server is not operable. The console or local account of last resort logon credentials must be stored in a sealed envelope and kept in a safe.",
      "severity": "medium"
    },
    {
      "id": "V-3967",
      "title": "The network element must time out access to the console port after 10 minutes or less of inactivity.",
      "description": "Terminating an idle session within a short time period reduces the window of opportunity for unauthorized personnel to take control of a management session enabled on the console or console port that has been left unattended. In addition quickly terminating an idle session will also free up resources committed by the managed network element. Setting the timeout of the session to 10 minutes or less increases the level of protection afforded critical network components.",
      "severity": "medium"
    },
    {
      "id": "V-3969",
      "title": "The network device must only allow SNMP read-only access.",
      "description": "Enabling write access to the device via SNMP provides a mechanism that can be exploited by an attacker to set configuration variables that can disrupt network operations.",
      "severity": "medium"
    },
    {
      "id": "V-3971",
      "title": "VLAN 1 must not be used for user VLANs.",
      "description": "In a VLAN-based network, switches use VLAN 1 as the default VLAN for in-band management and to communicate with other networking devices using Spanning-Tree Protocol (STP), Cisco Discovery Protocol (CDP), Dynamic Trunking Protocol (DTP), VLAN Trunking Protocol (VTP), and Port Aggregation Protocol (PAgP)--all untagged traffic. As a consequence, VLAN 1 may unwisely span the entire network if not appropriately pruned. If its scope is large enough, the risk of compromise can increase significantly.",
      "severity": "medium"
    },
    {
      "id": "V-3972",
      "title": "VLAN 1 must be pruned from all trunk and access ports that do not require it.",
      "description": "VLAN 1 is a special VLAN that tags and handles most of the control plane traffic such as Spanning-Tree Protocol (STP), Cisco Discovery Protocol (CDP), Dynamic Trunking Protocol (DTP), VLAN Trunking Protocol (VTP), and Port Aggregation Protocol (PAgP) all VLAN 1 tagged traffic. VLAN 1 is enabled on all trunks and ports by default. With larger campus networks, care needs to be taken about the diameter of the VLAN 1 STP domain; instability in one part of the network could affect VLAN 1, thereby influencing control-plane stability and therefore STP stability for all other VLANs.",
      "severity": "low"
    },
    {
      "id": "V-3973",
      "title": "Disabled switch ports must be placed in an unused VLAN (do not use VLAN1).",
      "description": "It is possible that a disabled port that is assigned to a user or management VLAN becomes enabled by accident or by an attacker and as a result gains access to that VLAN as a member.",
      "severity": "low"
    },
    {
      "id": "V-3984",
      "title": "Access switchports must not be assigned to the native VLAN.",
      "description": "Double encapsulation can be initiated by an attacker who has access to a switch port belonging to the native VLAN of the trunk port. Knowing the victim's MAC address and with the victim attached to a different switch belonging to the same trunk group, thereby requiring the trunk link and frame tagging, the malicious user can begin the attack by sending frames with two sets of tags. The outer tag that will have the attacker's VLAN ID (probably the well-known and omnipresent VLAN 1) is stripped off by the switch, and the inner tag that will have the victim's VLAN ID is used by the switch as the next hop and sent out the trunk port.",
      "severity": "medium"
    },
    {
      "id": "V-4582",
      "title": "The network device must require authentication for console access.",
      "description": "Network devices with no password for administrative access via the console provide the opportunity for anyone with physical access to the device to make configuration changes enabling them to disrupt network operations resulting in a network outage.",
      "severity": "high"
    },
    {
      "id": "V-4584",
      "title": "The network element must log all messages except debugging and send all log data to a syslog server.",
      "description": "Logging is a critical part of router security. Maintaining an audit trail of system activity logs (syslog) can help identify configuration errors, understand past intrusions, troubleshoot service disruptions, and react to probes and scans of the network. Syslog levels 0-6 are the levels required to collect the necessary information to help in the recovery process.",
      "severity": "low"
    },
    {
      "id": "V-5611",
      "title": "The network element must only allow management connections for administrative access from hosts residing in to the management network.",
      "description": "Remote administration is inherently dangerous because anyone with a sniffer and access to the right LAN segment, could acquire the device account and password information. With this intercepted information they could gain access to the infrastructure and cause denial of service attacks, intercept sensitive information, or perform other destructive actions.",
      "severity": "medium"
    },
    {
      "id": "V-5612",
      "title": "The network element must be configured to timeout after 60 seconds or less for incomplete or broken SSH sessions.",
      "description": "An attacker may attempt to connect to the device using SSH by guessing the authentication method, encryption algorithm, and keys. Limiting the amount of time allowed for authenticating and negotiating the SSH session reduces the window of opportunity for the malicious user attempting to make a connection to the network element.",
      "severity": "medium"
    },
    {
      "id": "V-5613",
      "title": "The network element must be configured for a maximum number of unsuccessful SSH login attempts set at 3 before resetting the interface.",
      "description": "An attacker may attempt to connect to the device using SSH by guessing the authentication method and authentication key or shared secret. Setting the authentication retry to 3 or less strengthens against a Brute Force attack.",
      "severity": "medium"
    },
    {
      "id": "V-5614",
      "title": "Network devices must have the PAD service disabled.",
      "description": "Packet Assembler Disassembler (PAD) is an X.25 component seldom used.  It collects the data transmissions from the terminals and gathers them into a X.25 data stream and vice versa.  PAD acts like a multiplexer for the terminals.  If enabled, it can render the device open to attacks. Some voice vendors use PAD on internal routers.",
      "severity": "low"
    },
    {
      "id": "V-5615",
      "title": "Network devices must have TCP Keep-Alives enabled for TCP sessions.",
      "description": "Idle TCP sessions can be susceptible to unauthorized access and hijacking attacks. By default, routers do not continually test whether a previously connected TCP endpoint is still reachable. If one end of a TCP connection idles out or terminates abnormally, the opposite end of the connection may still believe the session is available. These \"orphaned\" sessions use up valuable router resources and can also be hijacked by an attacker. To mitigate this risk, routers must be configured to send periodic keepalive messages to check that the remote end of a session is still connected. If the remote device fails to respond to the keepalive message, the sending router will clear the connection and free resources allocated to the session.",
      "severity": "low"
    },
    {
      "id": "V-5622",
      "title": "The native VLAN must be assigned to a VLAN ID other than the default VLAN for all 802.1q trunk links.",
      "description": "VLAN hopping can be initiated by an attacker who has access to a switch port belonging to the same VLAN as the native VLAN of the trunk link connecting to another switch in which the victim is connected to. If the attacker knows the victim's MAC address, it can forge a frame with two 802.1q tags and a layer 2 header with the destination address of the victim. Since the frame will ingress the switch from a port belonging to its native VLAN, the trunk port connecting to victim's switch will simply remove the outer tag because native VLAN traffic is to be untagged. The switch will forward the frame unto the trunk link unaware of the inner tag with a VLAN ID for which the victim's switchport is a member of.",
      "severity": "medium"
    },
    {
      "id": "V-5623",
      "title": "Port trunking must be disabled on all access ports (do not configure trunk on, desirable, non-negotiate, or auto--only off).",
      "description": "Double encapsulation can be initiated by an attacker who has access to a switch port belonging to the native VLAN of the trunk port. Knowing the victims MAC address and with the victim attached to a different switch belonging to the same trunk group, thereby requiring the trunk link and frame tagging, the malicious user can begin the attack by sending frames with two sets of tags. The outer tag that will have the attackers VLAN ID (probably the well-known and omnipresent VLAN 1) is stripped off by the switch, and the inner tag that will have the victims VLAN ID is used by the switch as the next hop and sent out the trunk port.",
      "severity": "medium"
    },
    {
      "id": "V-5626",
      "title": "The switch must be configured to use 802.1x authentication on host facing access switch ports.",
      "description": "The IEEE 802.1x standard is a client-server based access control and authentication protocol that restricts unauthorized clients from connecting to a local area network through host facing switch ports.  The authentication server authenticates each client connected to to a switch port before making any services available to the client from the LAN.  Unless the client is successfully authenticated, 802.1x access control allows only Extensible Authentication Protocol over LAN (EAPOL) traffic through the port to which the client is connected.  After authentication is successful, normal traffic can pass through the port.  Without the use of 802.1x, a malicious user could use the switch port to connect an unauthorized piece of computer or other network device to inject or steal data from the network without detection.",
      "severity": "high"
    },
    {
      "id": "V-5628",
      "title": "A dedicated management VLAN or VLANs must be configured to keep management traffic separate from user data and control plane traffic.",
      "description": "All ports, including the internal sc0 interface, are configured by default to be members of VLAN 1. In a VLAN-based network, switches use VLAN 1 as the default VLAN for in-band management and to communicate with other networking devices using Spanning-Tree Protocol (STP), Cisco Discovery Protocol (CDP), Dynamic Trunking Protocol (DTP), VLAN Trunking Protocol (VTP), and Port Aggregation Protocol (PAgP) all untagged traffic. As a consequence, VLAN 1 may unwisely span the entire network if not appropriately pruned. If its scope is large enough, the risk of compromise can increase significantly.",
      "severity": "medium"
    },
    {
      "id": "V-7011",
      "title": "The network element’s auxiliary port must be disabled unless it is connected to a secured modem providing encryption and authentication.",
      "description": "The use of POTS lines to modems connecting to network devices provides clear text of authentication traffic over commercial circuits that could be captured and used to compromise the network.  Additional war dial attacks on the device could degrade the device and the production network.\n\nSecured modem devices must be able to authenticate users and must negotiate a key exchange before full encryption takes place.  The modem will provide full encryption capability (Triple DES) or stronger.  The technician who manages these devices will be authenticated using a key fob and granted access to the appropriate maintenance port, thus the technician will gain access to the managed device (router, switch, etc.).  The token provides a method of strong (two-factor) user authentication.  The token works in conjunction with a server to generate one-time user passwords that will change values at second intervals.  The user must know a personal identification number (PIN) and possess the token to be allowed access to the device.\n",
      "severity": "low"
    }
  ]
}