{
  "name": "stig_microsoft_exchange_2010_core_server",
  "date": "2012-05-31",
  "description": "The Microsoft Exchange Server 2010 STIGs cover four of the five roles available with Microsoft Exchange Server 2010, plus core Exchange Server 2010 global requirements. The Email Services Policy STIG must also be reviewed for each site hosting email services. The core Exchange Server guidance must be reviewed on each server role prior to the role-specific guidance. Also, for the Client Access server, the IIS guidance must be reviewed prior to the OWA checks.",
  "title": "Microsoft Exchange 2010 Core Server",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "Exch-110",
      "title": "Exchange application directory must be protected from unauthorized access.",
      "description": "Default product installations may provide more generous access permissions than are necessary to run the application.  By examining and tailoring access permissions to more closely provide the least amount of privilege possible, attack vectors that align with user permissions are less likely to access more highly secured areas. \n\nNote: The default installation directory is \\Program Files\\Microsoft\\Exchange Server\\V14.",
      "severity": "medium"
    },
    {
      "id": "Exch-111",
      "title": "Exchange software must be monitored for change.",
      "description": "Exchange software, as with other application software installed on a host system, must be included in a system baseline record and periodically reviewed; otherwise unauthorized changes to the software may not be discovered.  This effort is a vital step to securing the host and the applications,  as it is the only method that may provide the ability to detect and recover from otherwise undetected changes, such as those that result from worm or bot intrusions.  Comparing system files against a baseline on a regular basis will detect the possibility of introduction of malicious code on the system.\n\nNote: A properly configured HBSS Policy Auditor 5.2 or later, File Integrity Monitor (FIM) module will meet the requirement for file integrity checking. The Asset module within HBSS does not meet this requirement.",
      "severity": "medium"
    },
    {
      "id": "Exch-112",
      "title": "Unnecessary services must be removed or disabled.",
      "description": "Unneeded, but running,  services offer attackers an enhanced attack profile, and attackers are constantly watching to discover open ports with running services.  By analyzing and disabling unneeded services, the associated open ports become unresponsive to outside queries, and servers become more secure as a result.  \n \nExchange Server has role-based server deployment to enable protocol path control and logical separation of network traffic types.   \n\nFor example, a server implemented in the Client Access role (i.e., Outlook Web App [OWA]) is configured and tuned as a web server using web protocols.  A client access server exposes only web protocols (HTTP/HTTPS) enabling System Administrators to optimize the protocol path and disable all services unnecessary for Exchange web services.    Similarly, Back-end servers created to host mailboxes are dedicated to that task, and operate only the services needed for mailbox hosting.  (Back-end servers must also operate some Web services, but only to the degree that Exchange requires the IIS engine in order to function).   \n\nTo restrict attack vectors available with email message access, the protocols on the email servers should match offerings on the DoD standard desktop deployment.  These include Microsoft Outlook using MAPI, S/MIME enabled clients, and secured connections.  It also includes Outlook via VPN for offsite telework.  Browsers may access OWA provided it uses PKI/CAC access brokered through a reverse proxy Application Server.  \n\nBecause NNTP, POP3, and IMAP4 clients are not included in the standard desktop offering, they must be disabled.",
      "severity": "medium"
    },
    {
      "id": "Exch-113",
      "title": "Global inbound message size must be set.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.  Message size limits should be set to 10 megabytes at most, but often are smaller, depending on the organization.  The key point in message size is that it should be set globally, and it should not be set to 'unlimited'.  \n\nNot setting a limit is likely to result in abuse and can lead to rapid filling of server disk space.\n\nNote: Transport configuration settings apply to the organization/global level of Exchange by checking and setting them at the Hub server the setting will apply to both Hub and Edge roles.",
      "severity": "medium"
    },
    {
      "id": "Exch-114",
      "title": "Global outbound message size must be set.",
      "description": "Email system availability depends in part on best practices strategies for setting tuning configurations.   Message size limits should be set to 10 megabytes at most, but often are smaller, depending on the organization.  The key point in message size is that it should be set globally, and it should not be set to 'unlimited'.  \n\nNot setting a limit is likely to result in abuse and can lead to rapid filling of server disk space.\n\nNote: Transport configuration settings apply to the organization/global level of Exchange by checking and setting them at the Hub server the setting will apply to both Hub and Edge roles.",
      "severity": "medium"
    },
    {
      "id": "Exch-115",
      "title": "Global recipient count limit must be set.",
      "description": "The Global Recipient Count limit field is used to control the maximum number of recipients that can be specified in a single message sent from this server. Its primary purpose is to minimize the chance of an internal sender spamming other recipients, since SPAM messages often have a large number of recipients.  SPAM prevention can originate from both outside and inside organizations.  While inbound SPAM is evaluated as it arrives, controls such as this one help prevent SPAM that might originate inside the organization.  \n\nThe Recipient Count Limit is global to the Exchange implementation.  Lower-level refinements are possible; however, in this configuration strategy, setting the value once at the global level ensures a more available system by eliminating potential conflicts among multiple settings.  A value of less than or equal to 5000 is probably larger than is needed for most organizations, but is small enough to minimize usefulness to spammers, and is easily handled by Exchange.  Selecting the \"no limit\" radio button for this item is likely to result in abuse.\n\nNote: Transport configuration settings apply to the organization/global level of Exchange by checking and setting them at the Hub server the setting will apply to both Hub and Edge roles.\n",
      "severity": "low"
    }
  ]
}