{
  "name": "stig_adobe_acrobat_reader_dc_continuous_track",
  "date": "2018-03-14",
  "description": "This Security Technical Implementation Guide is published as a\ntool to improve the security of Department of Defense (DoD) information\nsystems. The requirements are derived from the National Institute of\nStandards and Technology (NIST) 800-53 and related documents. Comments or\nproposed revisions to this document should be sent via e-mail to the\nfollowing address: disa.stig_spt@mail.mil.",
  "title": "Adobe Acrobat Reader DC Continuous Track Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-64919",
      "title": "Adobe Reader DC must enable Enhanced Security in a Standalone Application.",
      "description": "PDFs have evolved from static pages to complex documents with features such as interactive forms, multimedia content, scripting, and other capabilities. These features leave PDFs vulnerable to malicious scripts or actions that can damage the computer or steal data. The Enhanced security feature protects the computer against these threats by blocking or selectively permitting actions for trusted locations and files.\n\nEnhanced Security determines if a PDF is viewed within a standalone application. A threat to users of Adobe Reader DC is opening a PDF file that contains malicious executable content.\n\nEnhanced Security “hardens” the application against risky actions: prevents cross domain access, prohibits script and data injection, blocks stream access to XObjects, silent printing, and execution of high privilege JavaScript.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64921",
      "title": "Adobe Reader DC must enable Enhanced Security in a Browser.",
      "description": "PDFs have evolved from static pages to complex documents with features such as interactive forms, multimedia content, scripting, and other capabilities. These features leave PDFs vulnerable to malicious scripts or actions that can damage the computer or steal data. The Enhanced security feature protects the computer against these threats by blocking or selectively permitting actions for trusted locations and files.\n\nEnhanced Security determines if a PDF is viewed within a browser application. A threat to users of Adobe Reader DC is opening a PDF file that contains malicious executable content.\n\nEnhanced Security “hardens” the application against risky actions: prevents cross domain access, prohibits script and data injection, blocks stream access to XObjects, silent printing, and execution of high privilege JavaScript.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64923",
      "title": "Adobe Reader DC must enable Protected Mode.",
      "description": "A threat to users of Adobe Reader DC is opening a PDF file that contains malicious executable content.\n\nProtected mode provides a sandbox capability that prevents malicious PDF files from launching arbitrary executable files, writing to system directories or the Windows registry.\n\nThis isolation of the PDFs reduces the risk of security breaches in areas outside the sandbox.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64925",
      "title": "Adobe Reader DC must enable Protected View.",
      "description": "A threat to users of Adobe Reader DC is opening a PDF file that contains malicious executable content.\n\nProtected view restricts Adobe Reader DC functionality, within a sandbox, when a PDF is opened from an untrusted source.\n\nThis isolation of the PDFs reduces the risk of security breaches in areas outside the sandbox.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64927",
      "title": "Adobe Reader DC must Block Websites.",
      "description": "Clicking any link to the Internet poses a potential security risk. Malicious websites can transfer harmful content or silently gather data. Acrobat Reader documents can connect to websites which can pose a potential threat to DoD systems and that functionality must be blocked. However, PDF document workflows that are trusted (e.g., DoD-created) can benefit from leveraging legitimate website access with minimal risk. Therefore, the ISSO may approve of website access and accept the risk if the access provides benefit and is a trusted site or the risk associated with accessing the site has been mitigated.\n\nAdobe Reader must block access to all websites that are not specifically allowed by ISSO risk acceptance.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64929",
      "title": "Adobe Reader DC must block access to Unknown Websites.",
      "description": "Because Internet access is a potential security risk, clicking any unknown website link to the Internet poses a potential security risk.\n\nMalicious websites can transfer harmful content or silently gather data.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64931",
      "title": "Adobe Reader DC must prevent opening files other than PDF or FDF.",
      "description": "Attachments represent a potential security risk because they can contain malicious content, open other dangerous files, or launch applications. Certainly file types such as .bin, .exe, .bat, and so on will be recognized as threats.\n\nThis feature prevents users from opening or launching file types other than PDF or FDF and disables the menu option.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64933",
      "title": "Adobe Reader DC must block Flash Content.",
      "description": "Flash content is commonly hosted on a web page, but it can also be embedded in PDF and other documents. Flash could be used to surreptitious install malware on the end-users computer.\n\nFlash Content restricts Adobe Reader DC not to play Flash content within a PDF.\n\nSatisfies: SRG-APP-000112, SRG-APP-000206, SRG-APP-000207, SRG-APP-000209, SRG-APP-000210",
      "severity": "medium"
    },
    {
      "id": "V-64935",
      "title": "Adobe Reader DC must disable the ability to change the Default Handler.",
      "description": "Allowing user to make changes to an application case cause a security risk.\n\nWhen the Default PDF Handler is disabled, the end users will not be able to change the default PDF viewer.",
      "severity": "low"
    },
    {
      "id": "V-64937",
      "title": "Adobe Reader DC must disable the Adobe Send and Track plugin for Outlook.",
      "description": "When enabled, Adobe Send and Track button appears in Outlook. When an email is composed it enables the ability to send large files as public links through Outlook. The attached files can be uploaded to the Adobe Document Cloud and public links to the files are inserted in the email body.",
      "severity": "low"
    },
    {
      "id": "V-64939",
      "title": "Adobe Reader DC must disable all service access to Document Cloud Services.",
      "description": "By default, Adobe online services are tightly integrated in Adobe Reader DC. With the integration of Adobe Document Cloud, disabling this feature prevents the risk of additional attack vectors.\n\nWithin Adobe Reader DC, the Adobe Cloud resources require a paid subscription for each service.",
      "severity": "medium"
    },
    {
      "id": "V-64941",
      "title": "Adobe Reader DC must disable Cloud Synchronization.",
      "description": "By default, Adobe online services are tightly integrated in Adobe Reader DC. When the Adobe Cloud synchronization is disabled it prevents the synchronization of desktop preferences across devices on which the user is signed in with an Adobe ID (including phones).",
      "severity": "medium"
    },
    {
      "id": "V-64943",
      "title": "Adobe Reader DC must disable the Adobe Repair Installation.",
      "description": "When Repair Installation is disabled the user does not have the option (Help Menu) or functional to repair an Adobe Reader DC install.",
      "severity": "low"
    },
    {
      "id": "V-64945",
      "title": "Adobe Reader DC must disable 3rd Party Web Connectors.",
      "description": "When 3rd Party Web Connectors are disabled it prevents the configuration of Adobe Reader DC access to third party services for file storage.",
      "severity": "medium"
    },
    {
      "id": "V-64947",
      "title": "Adobe Reader DC must disable Adobe Send for Signature.",
      "description": "The Adobe Document Cloud sign service allows users to send documents online for signature and sign from anywhere or any device. The signed documents are stored in the Adobe Cloud. The Adobe Document Cloud sign service is a paid subscription.\n\nWhen Adobe Send for Signature is disabled users will not be allowed to utilize the Adobe Document Cloud sign function.",
      "severity": "low"
    },
    {
      "id": "V-64949",
      "title": "Adobe Reader DC must disable access to Webmail.",
      "description": "When Webmail is disabled the user cannot configure a webmail account to send an open PDF document as an attachment. Users should have the ability to send documents as Microsoft Outlook attachments. The difference is that Outlook must be configured by the administrator on the local machine.",
      "severity": "medium"
    },
    {
      "id": "V-64951",
      "title": "Adobe Reader DC must disable Online SharePoint Access.",
      "description": "Disabling SharePoint disables or removes the user’s ability to add a SharePoint account access controls the application's ability to detect that a file came from a SharePoint server, and disables the check-out prompt.",
      "severity": "medium"
    },
    {
      "id": "V-64953",
      "title": "Adobe Reader DC must disable the Adobe Welcome Screen.",
      "description": "The Adobe Reader DC Welcome screen can be distracting and also has online links to the Adobe quick tips website, tutorials, blogs and community forums.\n\nWhen the Adobe Reader DC Welcome screen is disabled the Welcome screen will not be populated on application startup.",
      "severity": "low"
    },
    {
      "id": "V-64955",
      "title": "Adobe Reader DC must disable Service Upgrades.",
      "description": "By default, Adobe online services are tightly integrated into Adobe Reader DC. Disabling Service Upgrades disables both updates to the product's web-plugin components as well as all services without exception, including any online sign-in screen.",
      "severity": "low"
    },
    {
      "id": "V-65665",
      "title": "Adobe Reader DC must disable the ability to specify Host-Based Privileged Locations.",
      "description": "Privileged Locations allow the user to selectively trust files, folders, and hosts to bypass some security restrictions, such as enhanced security and protected view. By default, the user can create privileged locations through the GUI.\n\nDisabling Host-Based Privileged Locations disables and locks the end user's ability to add hosts as a privileged location prevents them from assigning trust and thereby exempting that location from enhanced security restrictions.",
      "severity": "medium"
    },
    {
      "id": "V-65667",
      "title": "Adobe Reader DC must disable the ability to add Trusted Files and Folders.",
      "description": "Privileged Locations allow the user to selectively trust files, folders, and hosts to bypass some security restrictions, such as enhanced security and protected view. By default, the user can create privileged locations through the GUI.\n\nDisabling Trusted Files and Folders disables and locks the end user's ability to add folders and files as a privileged location prevents them from assigning trust and thereby exempting that location from enhanced security restrictions.",
      "severity": "medium"
    },
    {
      "id": "V-65669",
      "title": "Adobe Reader DC must disable the ability to elevate IE Trusts to Privileged Locations.",
      "description": "Privileged Locations allow the user to selectively trust files, folders, and hosts to bypass some security restrictions, such as enhanced security and protected view. By default, the user can create privileged locations through the GUI.\n\nDisabling IE Trusts to Privileged Locations disables and locks the end user's ability to treat IE trusted sites as a privileged location prevents them from assigning trust and thereby exempting that location from enhanced security restrictions.",
      "severity": "medium"
    },
    {
      "id": "V-65671",
      "title": "Adobe Reader DC must disable the ability to elevate (trusts) certified documents as a Privileged Location.",
      "description": "Privileged Locations allow the user to selectively trust files, folders, and hosts to bypass some security restrictions, such as enhanced security and protected view. By default, the user can create privileged locations through the GUI.\n\nDisabling certified documents disables and locks the end user's ability to elevate certified documents as a privileged location.",
      "severity": "medium"
    },
    {
      "id": "V-65673",
      "title": "Adobe Reader DC must disable periodical uploading of European certificates.",
      "description": "By default, the user can update European certificates from an Adobe server through the GUI.\n\nWhen uploading European certificates is disabled, it prevents the automatic download and installation of certificates and disables and locks the end user's ability to upload those certificates.",
      "severity": "low"
    },
    {
      "id": "V-65675",
      "title": "Adobe Reader DC must disable periodical uploading of Adobe certificates.",
      "description": "By default, the user can update Adobe certificates from an Adobe server through the GUI.\n\nWhen uploading Adobe certificates is disabled, it prevents the automatic download and installation of certificates and disables and locks the end user's ability to upload those certificates.",
      "severity": "low"
    },
    {
      "id": "V-65677",
      "title": "Adobe Reader DC must have the latest Security-related Software Updates installed.",
      "description": "Security flaws with software applications are discovered daily. Vendors are constantly updating and patching their products to address newly discovered security vulnerabilities. Organizations (including any contractor to the organization) are required to promptly install security-relevant software updates (e.g., patches, service packs, and hot fixes). Flaws discovered during security assessments, continuous monitoring, incident response activities, or information system error handling must also be addressed expeditiously.\n\nOrganization-defined time periods for updating security-relevant software may vary based on a variety of factors including, for example, the security category of the information system or the criticality of the update (i.e., severity of the vulnerability related to the discovered flaw).\n\nThis requirement will apply to software patch management solutions that are used to install patches across the enclave and also to applications that are not part of that patch management solution. For example, many browsers today provide the capability to install their own patch software. Patch criticality, as well as system criticality, will vary. Therefore, the tactical situations regarding the patch management process will also vary. This means that the time period utilized must be a configurable parameter. Time frames for application of security-relevant software updates may be dependent upon the Information Assurance Vulnerability Management (IAVM) process.\n\nThe application will be configured to check for and install security-relevant software updates within an identified time period from the availability of the update. The specific time period will be defined by an authoritative source (e.g., IAVM, CTOs, DTMs, and STIGs).",
      "severity": "high"
    },
    {
      "id": "V-65679",
      "title": "Adobe Reader DC must enable FIPS mode.",
      "description": "Use of weak or untested encryption algorithms undermines the purposes of utilizing encryption to protect data. The application must implement cryptographic modules adhering to the higher standards approved by the federal government since this provides assurance they have been tested and validated.",
      "severity": "medium"
    },
    {
      "id": "V-66049",
      "title": "Adobe Reader DC must disable Acrobat Upsell.",
      "description": "Products that don't provide the full set of features by default provide the user the opportunity to upgrade. Acrobat Upsell displays message which encourage the user to upgrade the product. For example, Reader users can purchase additional tools and features, and Acrobat Reader users can upgrade to Acrobat Professional.",
      "severity": "low"
    }
  ]
}