{
  "name": "stig_microsoft_office_system_2016",
  "date": "2016-12-21",
  "description": "The Microsoft Office System 2016 STIG is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the NIST 800-53 and related documents. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "Microsoft Office System 2016 STIG",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-70855",
      "title": "The Help Improve Proofing Tools feature for Office must be configured.",
      "description": "The \"Help Improve Proofing Tools\" feature collects data about use of the Proofing Tools, such as additions to the custom dictionary, and sends it to Microsoft. After about six months, the feature stops sending data to Microsoft and deletes the data collection file from the user's computer. Although this feature does not intentionally collect personal information, some of the content sent could include items that were marked as spelling or grammar errors, such as proper names and account numbers. However, any numbers such as account numbers, street addresses, and phone numbers are converted to zeroes when the data is collected. Microsoft uses this information solely to improve the effectiveness of the Office Proofing Tools, not to identify users.\nBy default, this feature is enabled, if users choose to participate in the Customer Experience Improvement Program (CEIP). If an organization has policies that govern the use of external resources such as the CEIP, allowing the use of the \"Help Improve Proofing Tools\" feature might cause them to violate these policies.",
      "severity": "medium"
    },
    {
      "id": "V-70859",
      "title": "Trust Bar notifications for Security messages must be enforced.",
      "description": "The Message Bar in Office applications is used to identify security issues, such as unsigned macros or potentially unsafe add-ins. When such issues are detected, the application disables the unsafe feature or content and displays the Message Bar at the top of the active window. The Message Bar informs the users about the nature of the security issue and, in some cases, provides the users with an option to enable the potentially unsafe feature or content, which could harm the user's computer.\nBy default, if an Office application detects a security issue, the Message Bar is displayed. However, this configuration can be modified by users in the Trust Center.\n",
      "severity": "medium"
    },
    {
      "id": "V-70861",
      "title": "Rights managed Office Open XML files must be protected.",
      "description": "When Information Rights Management (IRM) is used to restrict access to an Office Open XML document, any metadata associated with the document is not encrypted. This configuration could allow potentially sensitive information such as the document author and hyperlink references to be exposed to unauthorized individuals.",
      "severity": "medium"
    },
    {
      "id": "V-70863",
      "title": "Document metadata for password protected files must be protected.",
      "description": "When an Office Open XML document is protected with a password and saved, any metadata associated with the document is encrypted along with the rest of the document's contents. If this configuration is changed, potentially sensitive information such as the document author and hyperlink references could be exposed to unauthorized people. ",
      "severity": "medium"
    },
    {
      "id": "V-70865",
      "title": "The encryption type for password protected Open XML files must be set.",
      "description": "If unencrypted files are intercepted, sensitive information in the files can be compromised. To protect information confidentiality, Microsoft Office application files can be encrypted and password protected. Only users who know the correct password will be able to decrypt such files. Since some encryption types are less secure and easier to breach, Microsoft Enhanced RSA and AES Cryptographic Provider, AES-256, 256-bit should be used when encrypting documents.",
      "severity": "medium"
    },
    {
      "id": "V-70867",
      "title": "The encryption type for password protected Office 97 thru Office 2003 must be set.",
      "description": "If unencrypted files are intercepted, sensitive information in the files can be compromised. To protect information confidentiality, Microsoft Office application files can be encrypted and password protected. Only users who know the correct password will be able to decrypt such files. Since some encryption types are less secure and easier to breach, Microsoft Enhanced RSA and AES Cryptographic Provider, AES-256, 256-bit should be used when encrypting documents.",
      "severity": "medium"
    },
    {
      "id": "V-70869",
      "title": "ActiveX control initialization must be disabled.",
      "description": "ActiveX controls can adversely affect a computer directly. In addition, malicious code can be used to compromise an ActiveX control and attack a computer. To indicate the safety of an ActiveX control, developers can denote them as Safe For Initialization (SFI). SFI indicates a control is safe to open and run, and it is not capable of causing a problem for any computer, regardless of whether it has persisted data values or not. \nIf a control is not marked SFI, it is possible the control could adversely affect a computer—or it could mean the developers did not test the control in all situations and are not sure whether it might be compromised in the future.\nBy default, if a control is marked SFI, the application loads the control in safe mode and uses persisted values (if any). If the control is not marked SFI, the application loads the control in unsafe mode with persisted values (if any), or uses the default (first-time initialization) settings. In both situations, the Message Bar informs users the controls have been disabled and prompts them to respond.",
      "severity": "medium"
    },
    {
      "id": "V-70871",
      "title": "Load controls in forms3 must be disabled from loading.",
      "description": "ActiveX controls are Component Object Model (COM) objects and have unrestricted access to users' computers. ActiveX controls can access the local file system and change the registry settings of the operating system. If a malicious user repurposes an ActiveX control to take over a user's computer, the effect could be significant.\nTo help improve security, ActiveX developers can mark controls as Safe For Initialization (SFI), which means that the developer states that the controls are safe to open and run and not capable of causing harm to any computers. If a control is not marked SFI, the control could adversely affect a computer--or it could mean the developers did not test the control in all situations and are not sure whether their control might be compromised at some future date.\nSFI controls run in safe mode, which limits their access to the computer. For example, a worksheet control can both read and write files when it is in unsafe mode, but perhaps only read from files when it is in safe mode. This functionality allows the control to be used in very powerful ways when safety is not important, but the control would still be safe for use in a Web page.\nIf a control is not marked as SFI, it is marked Unsafe For Initialization (UFI), which means that it is capable of affecting a user's computer. If UFI ActiveX controls are loaded, they are always loaded in unsafe mode.",
      "severity": "medium"
    },
    {
      "id": "V-70873",
      "title": "Automation Security to enforce macro level security in Office documents must be configured.",
      "description": "When a separate program is used to launch Microsoft Office Excel, PowerPoint, or Word programmatically, any macros can run in the programmatically opened application without being blocked. This functionality could allow an attacker to use automation to run malicious code in Excel, PowerPoint, or Word.",
      "severity": "medium"
    },
    {
      "id": "V-70875",
      "title": "A mix of policy and user locations for Office Products must be disallowed.",
      "description": "When Microsoft Office files are opened from trusted locations, all the content in the files is enabled and active. Users are not notified about any potential risks that might be contained in the files, such as unsigned macros, ActiveX controls, or links to content on the Internet.\nBy default, users can specify any location as a trusted location, and a computer can have a combination of user-created, OCT-created, and Group Policy–created trusted locations.",
      "severity": "medium"
    },
    {
      "id": "V-70877",
      "title": "Smart Documents use of Manifests in Office must be disallowed.",
      "description": "An XML expansion pack is the group of files that constitutes a Smart Document in Excel and Word. One or more components that provide the logic needed for a Smart Document are packaged by using an XML expansion pack. These components can include any type of file, including XML schemas, Extensible Stylesheet Language Transforms (XSLTs), dynamic-link libraries (DLLs), and image files, as well as additional XML files, HTML files, Word files, Excel files, and text files.\nThe key component to building an XML expansion pack is creating an XML expansion pack manifest file. By creating this file, the locations of all files that make up the XML expansion pack are specified, as well as information that instructs Office 2016 how to set up the files for the Smart Document. The XML expansion pack can also contain information about how to set up other files, such as how to install and register a COM object required by the XML expansion pack.\nXML expansion packs can be used to initialize and load malicious code, which might affect the stability of a computer and lead to data loss. Office applications can load an XML expansion pack manifest file with a Smart Document.",
      "severity": "medium"
    },
    {
      "id": "V-70881",
      "title": "Connection verification of permissions must be enforced.",
      "description": "Users are not required to connect to the network to verify permissions. If users do not need their licenses confirmed when attempting to open Office documents, they might be able to access documents after their licenses have been revoked. Also, it is not possible to log the usage of files with restricted permissions if users' licenses are not confirmed.",
      "severity": "medium"
    },
    {
      "id": "V-70883",
      "title": "Inclusion of document properties for PDF and XPS output must be disallowed.",
      "description": "If the Microsoft Save as PDF or XPS Add-in for Microsoft Office Programs is installed, document properties are saved as metadata when users save or publish files using the PDF or XPS commands in Access 2016, Excel 2016, PowerPoint 2016, and Word 2016 using the PDF or XPS or Publish. If this metadata contains sensitive information, saving it with the file could compromise security.",
      "severity": "medium"
    },
    {
      "id": "V-70885",
      "title": "Encrypt document properties must be configured for OLE documents.\n",
      "description": "This policy setting allows a document's properties to be encrypted.  This applies to OLE documents (Office 97-2003 compatible) if the application is configured for CAPI RC4.  Disabling this setting will prevent the encryption of document properties, which may expose sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-70889",
      "title": "Office Presentation Service must be removed as an option for presenting PowerPoint and Word online.",
      "description": "The Office Presentation Service is a free, public service that allows others to  follow along in a web browser. Allowing this feature could result in presentations with DoD FOUO, PII and other protected data to be viewed in a nonsecure location. By disabling this policy, the user will not have the ability to deliver a presentation online.",
      "severity": "medium"
    },
    {
      "id": "V-70891",
      "title": "The ability to create an online presentation programmatically must be disabled.",
      "description": "Allowing online presentations to be created programmatically allows for the capability of malicious content to become imbedded in those programmatically created presentations.",
      "severity": "medium"
    },
    {
      "id": "V-70893",
      "title": "When using the Office Feedback tool, the ability to include a screenshot must be disabled.",
      "description": "The \"Office Feedback\" tool, also called \"Send-a-Smile\", allows a user to click on an icon and send feedback to Microsoft. The \"Office Feedback\" Tool must be configured to be disabled. In the event that the Office Feedback Tool has not been configured correctly as disabled, this policy configures whether the uploading of screenshots via the tool is allowed and should also be disabled. Uploading screenshots to a commercial vendor from a DoD computer may unintentionally reveal configuration and/or FOUO content.",
      "severity": "medium"
    },
    {
      "id": "V-70895",
      "title": "The ability to run unsecure Office apps must be disabled.",
      "description": "Unsecure apps for Office, which are apps that have web page or catalog locations that are not SSL-secured (https://), and/or are not in users' Internet zones may allow data to be transmitted/accessed via clear text to outside sources. By configuring this policy to be disabled, users will be prevented from transmitting/accessing data in a nonsecure manner.",
      "severity": "medium"
    },
    {
      "id": "V-70897",
      "title": "The Office Telemetry Agent must be configured to obfuscate the file name, file path, and title of Office documents before uploading telemetry data to the shared folder.",
      "description": "This policy setting configures the Office Telemetry Agent to disguise, or obfuscate, certain file properties that are reported in telemetry data. If this policy setting is enabled, Office Telemetry Agent obfuscates the file name, file path, and title of Office documents before uploading telemetry data to the shared folder. If this policy setting is disabled or not configured, the Office Telemetry Agent uploads telemetry data that shows the full file name, file path, and title of all Office documents.",
      "severity": "medium"
    },
    {
      "id": "V-70899",
      "title": "The ability to send personal information to Office must be disabled.",
      "description": "This policy setting controls whether users can send personal information to Office. When users choose to send information Office 2016 applications automatically send information to Office. If you enable this policy setting, users will opt into sending personal information to Office.  If your organization has policies that govern the use of external resources, opting users into the program might cause them to violate these policies.  If you disable this policy setting, Office 2016 users cannot send personal information to Office.  If you do not configure this policy setting, the behavior is the equivalent of setting the policy to \"Enabled\".",
      "severity": "medium"
    }
  ]
}