{
  "name": "stig_lg_android_5.x_interim_security_configuration_guide",
  "date": "2015-09-22",
  "description": "This Interim Security Configuration Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "LG Android 5.x Interim Security Configuration Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-58769",
      "title": "The LG Android 5.0 platform must be configured to enforce a minimum password length of 6 characters.",
      "description": "Password strength is a measure of the effectiveness of a password in resisting guessing and brute force attacks. The ability to crack a password is a function of how many attempts an adversary is permitted, how quickly an adversary can do each attempt, and the size of the password space. The longer the minimum length of the password is, the larger the password space. Having a too-short minimum password length significantly reduces password strength, increasing the chance of password compromise and resulting device and data compromise.\n\nSFR ID: FMT_SMF.1.1 #01",
      "severity": "low"
    },
    {
      "id": "V-58771",
      "title": "The LG Android 5.0 platform must be configured to lock the display after 15 minutes (or less) of inactivity.",
      "description": "The screen lock timeout must be set to a value that helps protect the device from unauthorized access. Having a too-long timeout would increase the window of opportunity for adversaries who gain physical access to the mobile device through loss, theft, etc. Such devices are much more likely to be in an unlocked state when acquired by an adversary, thus granting immediate access to the data on the mobile device. The maximum timeout period of 15 minutes has been selected to balance functionality and security; shorter timeout periods may be appropriate, depending on the risks posed to the mobile device.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "medium"
    },
    {
      "id": "V-58773",
      "title": "The LG Android 5.0 platform must be configured to prohibit more than 10 consecutive failed authentication attempts.",
      "description": "Users must not be able to override the system policy on the maximum number of consecutive failed authentication attempts because this could allow them to raise the maximum, thus giving adversaries more chances to guess/brute-force passwords, which increases the risk of the mobile device being compromised. Therefore, only administrators should have the authority to set consecutive failed authentication attempt policies.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "low"
    },
    {
      "id": "V-58775",
      "title": "The LG Android 5.0 platform must be configured to enforce an application installation policy by specifying one or more authorized application repositories: disable Google Play.",
      "description": "Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DoD data accessible by these unauthorized/malicious applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-58777",
      "title": "The LG Android 5.0 platform must be configured to enforce an application installation policy by specifying one or more authorized application repositories: disable unknown source.",
      "description": "Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DoD data accessible by these unauthorized/malicious applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-58779",
      "title": "The LG Android 5.0 platform must be configured to enforce an application installation policy through an application whitelist specifying a set of allowed applications and versions.",
      "description": "Requiring all authorized applications to be in an application whitelist prevents the execution of any applications (e.g., unauthorized, malicious) that are not part of the whitelist. Failure to configure an application whitelist properly could allow unauthorized and malicious applications to be downloaded, installed, and executed on the mobile device, causing a compromise of DoD data accessible by these applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-58781",
      "title": "The LG Android 5.0 platform must be configured to disable developer modes.",
      "description": "Developer modes circumvent certain security measures, so their use for standard operation is not recommended. Developer modes may increase the likelihood of compromise of confidentiality, integrity, and availability.\n\nSFR ID: FMT_SMF.1.1 #20",
      "severity": "medium"
    },
    {
      "id": "V-58783",
      "title": "The LG Android 5.0 platform must be configured to enable data-at-rest protection for on-device storage.",
      "description": "The operating system must ensure the data being written to the mobile device's built-in storage media is protected from unauthorized access. If data at rest is unencrypted, it is vulnerable to disclosure. Even if the operating system enforces permissions on data access, an adversary can read storage media directly, thereby circumventing operating system controls. Encrypting the data ensures confidentiality is protected even when the operating system is not running.\n\nSFR ID: FMT_SMF.1.1 #21",
      "severity": "high"
    },
    {
      "id": "V-58785",
      "title": "The LG Android 5.0 platform must be configured to enable data-at-rest protection for removable storage media.",
      "description": "The operating system must ensure the data being written to the mobile device's removable media is protected from unauthorized access. If data at rest is unencrypted, it is vulnerable to disclosure. Even if the operating system enforces permissions on data access, an adversary can read removable media directly, thereby circumventing operating system controls. Encrypting the data ensures confidentiality is protected even when the operating system is not running.\n\nSFR ID: FMT_SMF.1.1 #22",
      "severity": "high"
    },
    {
      "id": "V-58787",
      "title": "The LG Android 5.0 platform must be configured to require the user to manifest consent to the terms of the DoD-specified warning banner each time the user boots the device.",
      "description": "The mobile operating system is required to display the DoD-approved system use notification message or banner before granting access to the system that provides privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. Required banners help ensure that DoD can audit and monitor the activities of mobile device users without legal restriction.  \n\nSystem use notification messages can be displayed when individuals first access or unlock the mobile device.   The banner shall be implemented as a \"click-through\" banner at device unlock (to the extent permitted by the operating system).  A \"click through\" banner prevents further activity on the information system unless and until the user executes a positive action to manifest agreement by clicking on a box indicating “OK.”\n\nThe approved DoD text must be used exactly as specified in the DoDI 8500.01.  For devices accommodating banners of 1300 characters, the banner text is: \n\nYou are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. \nBy using this IS (which includes any device attached to this IS), you consent to the following conditions: \n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. \n-At any time, the USG may inspect and seize data stored on this IS. \n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. \n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. \n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\n\nFor Blackberries and other PDAs/PEDs with severe character limitations, the banner text is: \n\nI've read & consent to terms in IS user agreem't.\n\nThe administrator must configure the banner text exactly as written without any changes.\n\nSFR ID: FMT_SMF.1.1 #24",
      "severity": "low"
    },
    {
      "id": "V-58789",
      "title": "The LG Android 5.0 platform must be configured to disable USB.",
      "description": "This data transfer capability could allow users to transfer sensitive DoD data onto unauthorized USB storage devices, thus leading to the compromise of this DoD data.\n\nSFR ID: FMT_SMF.1.1 #41",
      "severity": "medium"
    },
    {
      "id": "V-58791",
      "title": "The LG Android 5.0 platform must be configured to fully wipe protected data upon unenrollment from the MDM.",
      "description": "When a mobile device is no longer going to be managed by MDM technologies, its protected/sensitive data must be sanitized because it will no longer be protected by the MDM software, so it is at much greater risk of unauthorized access and disclosure.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58795",
      "title": "The LG Android 5.0 platform must not allow the device unlock password to contain more than two sequential characters (e.g., 456, abc).",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute-force attack. Passwords with sequential or repeating numbers or alphabetic characters (e.g., 456, 987, 222, abc, ddd) are considered easier to crack than random patterns. Therefore, disallowing sequential or repeating numbers or alphabetic characters makes it more difficult for an adversary to discover the password.\n\nSFR ID: FMT_SMF_EXT.1",
      "severity": "medium"
    },
    {
      "id": "V-58797",
      "title": "The LG Android 5.0 platform must not allow the device unlock password to contain more than two repeating characters (e.g., 444, aaa).",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute-force attack. Passwords with sequential or repeating numbers or alphabetic characters (e.g., 456, 987, 222, abc, ddd) are considered easier to crack than random patterns. Therefore, disallowing sequential or repeating numbers or alphabetic characters makes it more difficult for an adversary to discover the password.\n\nSFR ID: FCS",
      "severity": "medium"
    },
    {
      "id": "V-58799",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: disable Google Backup.",
      "description": "A cloud backup feature may gather a user's information, such as PII, or sensitive documents. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FCS_STG_EXT.1.4",
      "severity": "medium"
    },
    {
      "id": "V-58801",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: disable LG Backup.",
      "description": "A cloud backup feature may gather a user's information, such as PII, or sensitive documents. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FIA_AFL_EXT.1.2",
      "severity": "medium"
    },
    {
      "id": "V-58803",
      "title": "The LG Android 5.0 platform must not allow Google crash report.",
      "description": "The sending of diagnostic data back to the manufacturer is prohibited in the DoD. Sending this data to an organization other than DoD is termed a “phone-home” vulnerability. This setting may enable the device manufacturer to gather sensitive location data or other information about the user’s practices. This data will be sent to the manufacturer's servers and database. This data is stored at a location which has unauthorized employees accessing this data. By disabling this feature, the phone-home risk will be mitigated.\n\nSFR ID: FMT_MOF.1.1(2) #08",
      "severity": "medium"
    },
    {
      "id": "V-58805",
      "title": "The LG Android 5.0 platform must not display notifications with sensitive DoD information when the device is locked: disable contact info.",
      "description": "If the mobile operating system were to display notifications or calendar information on the lock screen, an adversary may be able to gather sensitive data without needing to Unlock the device. This adversary may use this gathered intelligence to plan future attacks and possibly a physical attack. By disabling notifications on the lock screen, this prevents sensitive data from being displayed openly on the device’s lock screen.\n\nSFR ID: FMT_MOF.1.1(2) #12",
      "severity": "medium"
    },
    {
      "id": "V-58807",
      "title": "The LG Android 5.0 platform must not display notifications with sensitive DoD information when the device is locked: calendar notifications.",
      "description": "If the mobile operating system were to display notifications or calendar information on the lock screen, an adversary may be able to gather sensitive data without needing to Unlock the device. This adversary may use this gathered intelligence to plan future attacks and possibly a physical attack. By disabling notifications on the lock screen, this prevents sensitive data from being displayed openly on the device’s lock screen.\n\nSFR ID: FMT_MOF.1.1(2) #13",
      "severity": "medium"
    },
    {
      "id": "V-58809",
      "title": "The LG Android 5.0 platform must not allow use of a voice assistant service.",
      "description": "On MOS devices, users (may be able to) access the device's contact database or calendar to obtain phone numbers and other information using a human voice even when the mobile device is locked. Often this information is personally identifiable information (PII), which is considered sensitive. It could also be used by an adversary to profile the user or engage in social engineering to obtain further information from other unsuspecting users. Disabling access to the contact database and calendar in these situations mitigates the risk of this attack. The AO may waive this requirement with written notice if the operational environment requires this capability.\n\nSFR ID: FMT_MOF.1.1(2) #14",
      "severity": "medium"
    },
    {
      "id": "V-58815",
      "title": "The LG Android 5.0 platform must not allow Google Auto sync.",
      "description": "Synchronization of data between devices associated with one user permits a user of an MOS device to transition user activities from one device to another.  This feature passes sufficient information between the devices to describe the activity, but app data synchronization associated with the activity is handled through cloud services, which should be disabled on a compliant MOS device.  If a user associates both DoD and personal devices to the same Apple ID, the user may improperly reveal information about the nature of the user's activities on an unprotected device.  Disabling this service mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58817",
      "title": "The LG Android 5.0 platform must retain the notice and consent banner on the screen until the user executes a positive action to manifest agreement by selecting a box indicating acceptance.",
      "description": "To ensure notice of and consent to the terms of the DoD standard user agreement, an Android app must display a consent banner.  Additionally, the app must prevent further activity in the application unless and until the user executes a positive action to manifest agreement, such as by tapping an acceptance button in the app.  By preventing access to the system until the user accepts the conditions, legal requirements are met to protect the DoD and to remind users the device is designed and implemented for business use. Additional information is found in DoD Instruction 8500.01.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "low"
    },
    {
      "id": "V-58819",
      "title": "The LG Android 5.0 platform must not allow a user to remove security configuration profiles enforcing DoD security requirements.",
      "description": "Configuration profiles define security policies on MOS devices.  If a user is able to remove a configuration profile, the user can then change the configuration that had been enforced by that policy.  Relaxing security policies may introduce vulnerabilities that the profiles had mitigated.  Configuring a profile to never be removed mitigates this risk.\n\nSFR ID: FDP_IFC_EXT.1.1",
      "severity": "medium"
    },
    {
      "id": "V-58821",
      "title": "The LG Android 5.0 platform must disable split-tunneling on the VPN client.",
      "description": "Spilt-tunneling allows multiple simultaneous remote connections to the mobile device.  Without VPN split-tunneling disabled, malicious applications can covertly off-load device data to a third-party server or set up a trusted tunnel between a non-DoD third-party server and a DoD network, providing a vector to attack the network.\n\nSFR ID: FPT_BBD_EXT.1.1",
      "severity": "medium"
    },
    {
      "id": "V-58823",
      "title": "The LG Android 5.0 platform must be configured to implement the management settings: disable NFC.",
      "description": "NFC provides the capability for Android devices to transfer data between them.  Data transfer is not encrypted using FIPS-validated encryption mechanisms.  Sensitive DoD information could be compromised if NFC is enabled.\n\nSFR ID: FPT_TST_EXT.2.2",
      "severity": "medium"
    },
    {
      "id": "V-58825",
      "title": "The LG Android 5.0 platform must be configured to implement the management settings: disable Android Beam.",
      "description": "Android Beam provides the capability for Android devices to transfer data between them.  Data transfer is not encrypted using FIPS-validated encryption mechanisms.  Sensitive DoD information could be compromised if Android beam is enabled.\n\nSFR ID: FPT_TUD_EXT.2.5",
      "severity": "medium"
    },
    {
      "id": "V-58827",
      "title": "The LG Android 5.0 platform must be configured to implement the management settings: disable Wi-Fi Direct.",
      "description": "Wi-Fi Direct allows the device to connect directly to another device via Wi-Fi without accessing a Wi-Fi access point and using DoD-required security mechanisms since Wi-Fi Direct can be used by applications to exchange files between devices. Disabling this feature mitigates the risk of compromising sensitive DoD data.\n\nNote: Disabling Wi-Fi Direct also disables Miracast.\n\nSFR ID: FTA_TAB.1.1",
      "severity": "medium"
    },
    {
      "id": "V-58829",
      "title": "The LG Android 5.0 platform must be configured to implement management setting: disable screen mirroring.",
      "description": "Screen mirroring allows the user to display device content to a compatible device (e.g., TV) over a Wi-Fi connection. Although this feature uses HDCP 2.x protocol and encryption of visual data to transmit data, vulnerabilities in the 2.0 and 2.1 protocol implementation can result in compromise of sensitive DoD data. Disabling this feature will mitigate this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58831",
      "title": "The LG Android 5.0 platform must be configured to enforce an application launching  policy through an  application blacklist specifying a set of disallowed applications:  disable unapproved core and preinstalled applications.",
      "description": "Applications from various sources (including the vendor, the carrier, and Google) are preinstalled on the device at the time of manufacture. Some of the applications can compromise DoD data or upload user's information to non-DoD approved servers. A user must be blocked from using such applications that exhibit behavior that can result in compromise of DoD data or DoD user information. The site administrator must analyze all pre-installed applications on the device and block all applications not approved for DoD use by configuring the application disable list.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58833",
      "title": "The LG Android 5.0 platform must be configured to disable the capability for an operating system update to be automatically downloaded and installed on the mobile device.",
      "description": "FOTA allows the user to download and install firmware updates over-the-air. These updates can include OS upgrades, security patches, bug fixes, new features and applications. Since the updates are controlled by the carriers, DoD will not have an opportunity to review and update policies prior to update availability to end users. Disabling FOTA will mitigate the risk of allowing users access to applications that could compromise DoD sensitive data. After reviewing the update and adjusting any necessary policies (i.e. disabling applications determined to pose risk), the administrator can re-enable FOTA.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58835",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: disable all Bluetooth profiles except for HSP (Headset Profile) and HFP (Hands-Free Profile).",
      "description": "Unsecure Bluetooth profiles may allow either unauthenticated connections to mobile devices or transfer of sensitive DoD data without required DoD information assurance (IA) controls. Only the HSP and HFP profiles are required to meet current DoD Bluetooth needs and DoD data and voice IA controls.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58837",
      "title": "The LG Android 5.0 platform must be configured to disable download mode.",
      "description": "Download mode allows the firmware of the device to be flashed (updated) by the user.  All updates should be controlled by the system administrator to ensure configuration control of the security baseline of the device.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58839",
      "title": "The LG Android 5.0 platform must be managed by an MDM.",
      "description": "Security-related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security-related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large-scale environment relative to an environment in which each device must be configured separately.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58841",
      "title": "The LG Android 5.0 platform must be configured to enable CC Mode.",
      "description": "CC mode implements several security controls required by the Mobile Device Functional Protection Profile (MDFPP).  If CC mode is not implemented, DoD data is more at risk of being compromised, and the MD is more at risk of being compromised if lost or stolen.\n\nCC mode implements the following controls:\n1. Certificate Validation\nLG provides Certificate validation feature for all certificates to protect your secure connection from spoofing and invalid certificates. This capability can be automatically configured by enabling CC Mode. \n\n2. Firmware Update Protection\nExcept secure update verified by RSA (2048bit) algorithm and SHA256 for hash, unsecured firmware update methods is restricted in CC mode. \n\n3. Self-test for crypto libraries\nIf the CC Mode is enabled, self-tests for crypto libraries are automatically started at bootup time. \n\n4. Restriction of TLS cipher suites\nLimited cipher suites can be selectable in the CC mode.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58843",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: disable Allow System Time Changes.",
      "description": "Determining the correct time a particular application event occurred on a system is critical when conducting forensic analysis and investigating system events. \n\nPeriodically synchronizing internal clocks with an authoritative time source is needed in order to correctly correlate the timing of events that occur across the enterprise. The three authoritative time sources for mobile operating systems are an authoritative time server that is synchronized with redundant United States Naval Observatory (USNO) time servers as designated for the appropriate DoD network (NIPRNet or SIPRNet), or the Global Positioning System (GPS), or the wireless carrier.\n\nTime stamps generated by the audit system in mobile operating systems shall include both date and time. The time may be expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-58845",
      "title": "The LG Android 5.0 platform must not allow the user to modify Owner Info on the device screen.",
      "description": "The Owner Info screen may contain required information, including a phone number to call if a device is lost, or the DoD Warning Banner.  The ability of the device user to modify the Set Owner Info screen needs to be disabled so that required info is always displayed on the locked screen.\n\nSFR ID: FMT_MOF.1.1(2) #11",
      "severity": "low"
    },
    {
      "id": "V-58847",
      "title": "The LG Android 5.0 platform must disable Android Smart Lock.",
      "description": "Android Smart Lock provides the capability for the user to unlock the device using non-approved methods, including having a \"trusted\" device nearby, trusted face viewing the screen, or by swiping the device with a specific pattern.  Alternate device authentication methods to using the device unlock password have not been approved for use in the DoD.\n\nSFR ID: FMT_MOF.1.1(2) #13",
      "severity": "medium"
    },
    {
      "id": "V-58849",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: Disable native Android browser.",
      "description": "The native browser includes encryption modules that are not FIPS 140-2 validated.  DoD policy requires all encryption modules used in DoD IT systems be FIPS 140-2 validated.\n\nSFR ID: FMT_MOF.1.1(2) #13",
      "severity": "medium"
    },
    {
      "id": "V-58851",
      "title": "The LG Android 5.0 platform must be configured to implement the management setting: Disable native Android email client.",
      "description": "The native email client includes encryption modules that are not FIPS 140-2 validated.  DoD policy requires all encryption modules used in DoD IT systems be FIPS 140-2 validated.\n\nSFR ID: FMT_MOF.1.1(2) #13",
      "severity": "medium"
    }
  ]
}