{
  "name": "stig_ibm_maas360_v2.3.x_mdm",
  "date": "2018-09-13",
  "description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "IBM MaaS360 v2.3.x MDM Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-65631",
      "title": "Before establishing a user session, the MaaS360 Server must display an administrator-specified advisory notice and consent warning message regarding use of the MaaS360 Server.",
      "description": "Note:  The advisory notice and consent warning message is not required if the General Purpose OS or Network Device displays an advisory notice and consent warning message when the administrator logs on to  the General Purpose OS or Network Device prior to accessing the MaaS360 Server or MaaS360 Server platform.\n\nThe MaaS360 Server/server platform is required to display the DoD-approved system use notification message or banner before granting access to the system that provides privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. This ensures the legal requirements for auditing and monitoring are met. \n\nThe approved DoD text must be used as specified in KS referenced in DoDI 8500.01.\n\nThe non-bracketed text below must be used without any changes as the warning banner.  \n \n[A. Use this banner for desktops, laptops, and other devices accommodating banners of 1300 characters. The banner shall be implemented as a click-through banner at logon (to the extent permitted by the operating system), meaning it prevents further activity on the information system unless and until the user executes a positive action to manifest agreement by clicking on a box indicating “OK.”]\n \nYou are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. \nBy using this IS (which includes any device attached to this IS), you consent to the following conditions: \n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. \n-At any time, the USG may inspect and seize data stored on this IS. \n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. \n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. \n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\n\nSFR ID: FMT_SMF_EXT.1.1(2) Refinement",
      "severity": "low"
    },
    {
      "id": "V-65633",
      "title": "The MaaS360 Server must be configured with the Administrator roles:\n\na. MD user;\nb. Server primary administrator;\nc. Security configuration administrator;\nd. Device user group administrator;\ne. Auditor.",
      "description": "Having several roles for the MaaS360 Server supports separation of duties. This allows administrator-level privileges to be granted granularly, such as giving application management privileges to one group and security policy privileges to another group. This helps prevent administrators from intentionally or inadvertently altering other settings and configurations they may not understand or approve of, which can weaken overall security and increase the risk of compromise.\n\nRoles\na. MD user:  able to log into the application store and request approved applications\nb. Server primary administrator: primary administrator for the server, including server installation, configuration, patching, and setting up admin accounts.\nc. Security configuration administrator:  Has the ability to define new policies but not to push them to managed mobile devices.\nd. Device user group administrator:  Has the ability to set up new user accounts, add devices, and push security policies and issue administrative commands to managed mobile devices or MDM agents.  \ne. Auditor:  Has the ability to set audit configuration parameters and delete or modify the content of logs.\n\nSFR ID: FMT_SMR.1.1(1) Refinement",
      "severity": "medium"
    },
    {
      "id": "V-65635",
      "title": "The MaaS360 Server must be configured to enable all required audit events: Failure to push a new application on a managed mobile device.",
      "description": "Failure to generate these audit records makes it more difficult to identify or investigate attempted or successful compromises, potentially causing incidents to last longer than necessary.\n\nSFR ID: FAU_GEN.1.1(2) Refinement",
      "severity": "medium"
    },
    {
      "id": "V-65637",
      "title": "The MaaS360 Server must be configured to enable all required audit events: Failure to update an existing application on a managed mobile device.",
      "description": "Failure to generate these audit records makes it more difficult to identify or investigate attempted or successful compromises, potentially causing incidents to last longer than necessary.\n\nSFR ID: FAU_GEN.1.1(2) Refinement",
      "severity": "medium"
    },
    {
      "id": "V-65639",
      "title": "The MaaS360 Server must leverage the MDM Platform user accounts and groups for MaaS360 Server user identification and authentication.",
      "description": "A comprehensive account management process that includes automation helps to ensure the accounts designated as requiring attention are consistently and promptly addressed. If an attacker compromises an account, the entire MaaS360 Server infrastructure is at risk. Providing automated support functions for the management of accounts will ensure only active accounts will be granted access with the proper authorization levels.  These objectives are best achieved by configuring the MaaS360 Server to leverage an enterprise authentication mechanism (e.g., Microsoft Active Directory, Kerberos).\n\nSFR ID: FIA",
      "severity": "medium"
    },
    {
      "id": "V-65641",
      "title": "The MaaS360 server platform must be protected by a DoD-approved firewall.",
      "description": "Most information systems are capable of providing a wide variety of functions and services. Some of the functions and services provided by default may not be necessary to support essential organizational operations. Unneeded services and processes provide additional threat vectors and avenues of attack to the information system. The MDM server is a critical component of the mobility architecture and must be configured to only those ports, protocols, and services (PPS) necessary to support functionality, all others must be expressly disabled or removed. A DoD-approved firewall implements the required network restrictions. A host-based firewall is appropriate where the MDM server runs on a standalone platform. Network firewalls or other architectures may be preferred where the MDM server runs in a cloud or virtualized solution.\n\nSFR ID: FMT_SMF.1.1(1) Refinement",
      "severity": "medium"
    },
    {
      "id": "V-65643",
      "title": "The firewall protecting the MaaS360 server platform must be configured to restrict all network traffic to and from all addresses with the exception of ports, protocols, and IP address ranges required to support MDM server and platform functions.",
      "description": "Most information systems are capable of providing a wide variety of functions and services. Some of the functions and services, provided by default, may not be necessary to support essential organizational operations. Since MDM server is a critical component of the mobility architecture and must be configured to only those ports, protocols, and services (PPS) necessary to support functionality, all others must be expressly disabled or removed. A firewall installed on the MDM server provides a protection mechanism to ensure unwanted service requests do not reach the MDM server and outbound traffic is limited to only MDM server functionality.\n\nSFR ID: FMT_SMF.1.1(1) Refinement",
      "severity": "medium"
    },
    {
      "id": "V-65645",
      "title": "The MaaS360 Agent must be configured to alert via the trusted channel to the MaaS360 Server for the following event: change in enrollment status.",
      "description": "Alerts providing notification of a change in enrollment state facilitate verification of the correct operation of security functions.  When a MaaS360 Server receives such an alert from a MaaS360 Agent, it indicates that the security policy may no longer be enforced on the mobile device.   This enables the MDM administrator to take an appropriate remedial action.\n\nSFR ID: FAU_ALT_EXT.2.1",
      "severity": "medium"
    },
    {
      "id": "V-80971",
      "title": "Only authorized versions of the IBM MaaS360 server must be used.",
      "description": "The IBM MaaS360 V2 server is no longer supported by IBM and therefore, may contain security vulnerabilities.  The IBM MaaS360 V2 server is not authorized within the DoD. ",
      "severity": "high"
    }
  ]
}