{
  "name": "stig_win2k3_audit",
  "date": "2013-06-10",
  "description": "The Windows 2003 Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems.  The requirements were developed from Federal and DoD consensus, as well as the Windows 2003 Security Guide and security templates published by Microsoft Corporation.  Comments or proposed revisions to this document should be sent via e-mail to the following address:  disa.letterkenny.FSO.mbx.stig-customer-support-mailbox@mail.mil.  ",
  "title": "Win2k3 Audit",
  "version": "6",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-1073",
      "title": "Systems must be at supported service packs (SP) or releases levels.",
      "description": "Systems at unsupported service packs or releases will not receive security updates for new vulnerabilities and leaves them subject to exploitation.   Systems must be maintained at a service pack level supported by the vendor with new security updates.",
      "severity": "high"
    },
    {
      "id": "V-1075",
      "title": "The system allows shutdown from the logon dialog box.",
      "description": "Displaying the shutdown button may allow individuals to shut down a system anonymously.  Only authenticated users should be allowed to shut down the system.  Preventing display of this button in the logon dialog box, ensures that individuals who shut down the system are authorized and tracked in the systems Security event log.",
      "severity": "low"
    },
    {
      "id": "V-1080",
      "title": "File-auditing configuration does not meet minimum requirements.",
      "description": "Improper modification of the core system files can render a system inoperable.  Further, modifications to these system files can have a significant impact on the security configuration of the system.  Auditing of significant modifications made to the system files provides a method of determining the responsible party.",
      "severity": "medium"
    },
    {
      "id": "V-1089",
      "title": "The required legal notice must be configured to display before console logon.",
      "description": "Failure to display the logon banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.",
      "severity": "medium"
    },
    {
      "id": "V-1090",
      "title": "Caching of logon credentials is not limited.",
      "description": "The default Windows configuration caches the last logon credentials for users who log on interactively to a system. This feature is provided for system availability reasons such as the user’s machine is disconnected from the network or domain controllers are not available. Even though the credential cache is well-protected, storing encrypted copies of users passwords on systems do not always have the same physical protection required for domain controllers. If a system is attacked, the unauthorized individual may isolate the password to a domain user account using a password-cracking program, and gain access to the domain.",
      "severity": "low"
    },
    {
      "id": "V-1091",
      "title": "System does not halt once an event log has reached its maximum size.",
      "description": "If the security log is full, it becomes possible for some events to not be logged.  Selecting this option will halt the computer when the log is full to prevent losing any events. If the system halts as a result of a full log, an administrator must restart the system and reset the log.  This work-stoppage event can be prevented, provided the IAO periodically archives the event logs.",
      "severity": "low"
    },
    {
      "id": "V-1093",
      "title": "Anonymous shares are not restricted.",
      "description": "This is a Category 1 finding because it allows anonymous logon users (null session connections) to list all account names and enumerate all shared resources, thus providing a map of potential points to attack the system.\n\nBy default, Windows allows anonymous users to list account names and enumerate share names.",
      "severity": "high"
    },
    {
      "id": "V-1097",
      "title": "Number of allowed bad-logon attempts does not meet minimum requirements.",
      "description": "The account lockout feature, when enabled, prevents brute-force password attacks on the system.  The higher this value is, the less effective the account lockout feature will be in protecting the local system.  The number of bad logon attempts should be reasonably small to minimize the possibility of a successful password attack, while allowing for honest errors made during a normal user logon.",
      "severity": "medium"
    },
    {
      "id": "V-1098",
      "title": "Time before bad-logon counter is reset does not meet minimum requirements.",
      "description": "This parameter specifies the amount of time that must pass between two successive login attempts to ensure that a lockout will occur.  The smaller this value is, the less effective the account lockout feature will be in protecting the local system.",
      "severity": "medium"
    },
    {
      "id": "V-1099",
      "title": "Lockout duration does not meet minimum requirements.",
      "description": "This parameter specifies the amount of time that must pass before a locked-out account is automatically unlocked by the system.",
      "severity": "medium"
    },
    {
      "id": "V-1102",
      "title": "Unauthorized users are granted right to Act as part of the operating system.",
      "description": "This is a Category 1 finding because users and user groups that are assigned this right can bypass all security protective mechanisms that apply to all users, including administrators.  Accounts with this right should have passwords with the maximum length and be kept in a locked container accessible only by the IAO and his designated backup. \n\nSome applications require this right to function.  Any exception needs to be documented with the IAO.",
      "severity": "high"
    },
    {
      "id": "V-1103",
      "title": "User rights and advanced user rights settings do not meet minimum requirements.",
      "description": "Inappropriate granting of user and advanced user rights can provide system, administrative, and other high level capabilities not required by the normal user.",
      "severity": "medium"
    },
    {
      "id": "V-1104",
      "title": "Maximum password age does not meet minimum requirements.",
      "description": "The longer a password is in use, the greater the opportunity for someone to gain unauthorized knowledge of the passwords.   Further, scheduled changing of passwords hinders the ability of unauthorized system users to crack passwords and gain access to a system.",
      "severity": "medium"
    },
    {
      "id": "V-1105",
      "title": "Minimum password age does not meet minimum requirements.",
      "description": "Permitting passwords to be changed in immediate succession within the same day, allows users to cycle passwords through their history database.  This enables users to effectively negate the purpose of mandating periodic password changes.",
      "severity": "medium"
    },
    {
      "id": "V-1107",
      "title": "Password uniqueness does not meet minimum requirements.",
      "description": "A system is more vulnerable to unauthorized access when system users recycle the same password several times without being required to change a password to a unique password on a regularly scheduled basis.  This enables users to effectively negate the purpose of mandating periodic password changes.",
      "severity": "medium"
    },
    {
      "id": "V-1113",
      "title": "The built-in guest account is not disabled.",
      "description": "A system faces an increased vulnerability threat if the built-in guest account is not disabled.  This account is a known account that exists on all Windows systems and cannot be deleted.  This account is initialized during the installation of the operating system with no password assigned.  This account is a member of the Everyone user group and has all the rights and permissions associated with that group, which could subsequently provide access to system resources to anonymous users.",
      "severity": "medium"
    },
    {
      "id": "V-1114",
      "title": "The built-in guest account has not been renamed.",
      "description": "A system faces an increased vulnerability threat if the built-in guest account is not renamed or disabled.  The built-in guest account is a known user account on all Windows systems, and as initially installed, does not require a password.  This can allow access to system resources by unauthorized users.  This account is a member of the group Everyone and has all the rights and permissions associated with that group and could provide access to system resources to unauthorized users.",
      "severity": "medium"
    },
    {
      "id": "V-1115",
      "title": "The built-in administrator account has not been renamed.",
      "description": "The built-in administrator account is a well known account.  Renaming the account to an unidentified name improves the protection of this account and the system.",
      "severity": "medium"
    },
    {
      "id": "V-1118",
      "title": "Event log sizes do not meet minimum requirements.",
      "description": "Inadequate log size will cause the log to fill up quickly and require frequent clearing by administrative personnel.",
      "severity": "medium"
    },
    {
      "id": "V-1136",
      "title": "Users are not forcibly disconnected when logon hours expire.",
      "description": "Users should not be permitted to remain logged on to the network after they have exceeded their permitted logon hours.  In many cases, this indicates that a user forgot to log off before leaving for the day.  However, it may also indicate that a user is attempting unauthorized access at a time when the system may be less closely monitored.  This protects critical and sensitive network data from exposure to unauthorized personnel with physical access to the computer.",
      "severity": "low"
    },
    {
      "id": "V-1139",
      "title": "The option to prevent the password in dial-up networking from being saved is not enabled.",
      "description": "The default Windows configuration enables the option to save the password used to gain access to a remote server using the dial-up networking feature.  With this option enabled, an unauthorized user who gains access to a Windows machine would also have access to remote servers with which the  machine uses dial-up networking to communicate.  Disabling this option will introduce another layer of security and help limit the scope of any security compromise to the local machine.",
      "severity": "medium"
    },
    {
      "id": "V-1141",
      "title": "Unencrypted password is sent to 3rd party SMB Server.",
      "description": "Some non-Microsoft SMB servers only support unencrypted (plain text) password authentication.  Sending plain text passwords across the network, when authenticating to an SMB server, reduces the overall security of the environment.  Check with the Vendor of the SMB server to see if there is a way to support encrypted password authentication.",
      "severity": "medium"
    },
    {
      "id": "V-1145",
      "title": "Administrator automatic logon is enabled.",
      "description": "This is a category 1 finding because it will directly log on to the system with administrator privileges when the machine is rebooted.  This would give full access to any unauthorized individual who reboots the computer.\n\nBy default this setting is not enabled.  If this setting exists, it should be disabled.  If this capability exists, the password may also be present in the registry, and must be removed.",
      "severity": "high"
    },
    {
      "id": "V-1150",
      "title": "The built-in Microsoft password filter is not enabled.",
      "description": "The use of complex passwords increases their strength against guessing.  This policy setting configures the system to verify that newly-created passwords conform to the Windows password complexity policy.",
      "severity": "low"
    },
    {
      "id": "V-1151",
      "title": "Print driver installation privilege is not restricted to administrators.",
      "description": "By default, the print spooler allows any user to add and to delete printer drivers on the local system.  This capability should be restricted to authorized personnel.",
      "severity": "low"
    },
    {
      "id": "V-1153",
      "title": "The Send download LanMan compatible password option is not set to Send NTLMv2 response only\\refuse LM.",
      "description": "The Kerberos v5 authentication protocol is the default for authentication of users who are logging on to domain accounts.  NTLM is retained in later Windows versions  for compatibility with clients and servers that are running earlier versions of Windows.  It is also used to authenticate logons to stand-alone computers that are running later versions.",
      "severity": "high"
    },
    {
      "id": "V-1154",
      "title": "Ctrl+Alt+Del security attention sequence is Disabled.",
      "description": "Disabling the Ctrl+Alt+Del security attention sequence can compromise system security.  Because only Windows responds to the Ctrl+Alt+Del security sequence, you can be assured that any passwords you enter following that sequence are sent only to Windows.  If you eliminate the sequence requirement, malicious programs can request and receive your Windows password.  Disabling this sequence also suppresses a custom logon banner.",
      "severity": "medium"
    },
    {
      "id": "V-1155",
      "title": "The Deny access to this computer from the network user right on domain controllers must be configured to prevent unauthenticated access. ",
      "description": "Inappropriate granting of user rights can provide system, administrative, and other high level capabilities.\n\nThe \"Deny Access from the Network\" right defines the accounts that are prevented from logging on from the network.  \n\nGroups must be assigned this right to prevent unauthenticated access.",
      "severity": "high"
    },
    {
      "id": "V-1157",
      "title": "The Smart Card removal option is set to take no action.",
      "description": "Determines what should happen when the smart card for a logged-on user is removed from the smart card reader.\n\nThe options are:\n- No Action\n- Lock Workstation\n- Force Logoff",
      "severity": "medium"
    },
    {
      "id": "V-1158",
      "title": "The Recovery Console SET command is enabled.",
      "description": "Enabling this option enables the Recovery Console SET command, which allows you to set Recovery Console environment variables.  This permits floppy copy and access to all drives and folders.",
      "severity": "low"
    },
    {
      "id": "V-1159",
      "title": "The Recovery Console option is set to permit automatic logon to the system.",
      "description": "This is a Category 1 finding because if this option is set, the Recovery Console does not require you to provide a password and will automatically log on to the system, giving Administrator access to system files.\n\nBy default, the Recovery Console requires you to provide the password for the Administrator account before accessing the system.",
      "severity": "high"
    },
    {
      "id": "V-1160",
      "title": "The unsigned driver installation behavior is improperly set.",
      "description": "Determines what should happen when an attempt is made to install a device driver (by means of the Windows device installer) that has not been certified by the Windows Hardware Quality Lab (WHQL).\n\nThe options are:\n- Silently succeed\n- Warn but allow installation\n- Do not allow installation",
      "severity": "low"
    },
    {
      "id": "V-1162",
      "title": "The Windows SMB server is not enabled to perform SMB packet signing when possible.",
      "description": "If this policy is enabled, it causes the Windows Server Message Block (SMB) server to perform SMB packet signing.",
      "severity": "medium"
    },
    {
      "id": "V-1163",
      "title": "Outgoing secure channel traffic is not encrypted when possible.",
      "description": "Requests sent on the secure channel are authenticated, and sensitive information (such as passwords) is encrypted, but not all information is encrypted.  If this policy is enabled, outgoing secure channel traffic should be encrypted.",
      "severity": "medium"
    },
    {
      "id": "V-1164",
      "title": "Outgoing secure channel traffic is not signed when possible.",
      "description": "Requests sent on the secure channel are authenticated, and sensitive information (such as passwords) is encrypted, but the channel is not integrity checked.  If this policy is enabled, all outgoing secure channel traffic should be signed.",
      "severity": "medium"
    },
    {
      "id": "V-1165",
      "title": "The computer account password is prevented from being reset.",
      "description": "As a part of Windows security, computer account passwords are changed automatically.  Enabling this policy to disable automatic password changes can make the system more vulnerable to malicious access.  Frequent password changes can be a significant safeguard for your system.  If this policy is disabled, a new password for the computer account will be generated every week.",
      "severity": "low"
    },
    {
      "id": "V-1166",
      "title": "The Windows SMB client is not enabled to perform SMB packet signing when possible.",
      "description": "If this policy is enabled, it causes the Windows Server Message Block (SMB) client to perform SMB packet signing when communicating with an SMB server that is enabled or required to perform SMB packet signing.",
      "severity": "medium"
    },
    {
      "id": "V-1171",
      "title": "Ejection of removable NTFS media is not restricted to Administrators.",
      "description": "Removable hard drives can be formatted and ejected by others who are not members of the Administrators Group, if they are not properly configured.  Formatting and ejecting removable NTFS media should only be done by administrators.",
      "severity": "medium"
    },
    {
      "id": "V-1172",
      "title": "Users are not warned in advance that their passwords will expire.",
      "description": "This setting configures the system to display a warning to users telling them how many days are left before their password expires.  By giving the user advanced warning, the user has time to construct a sufficiently strong password.",
      "severity": "low"
    },
    {
      "id": "V-1173",
      "title": "The default permissions of Global system objects are not increased.",
      "description": "Windows system maintains a global list of shared system resources such as DOS device names, mutexes, and semaphores. Each type of object is created with a default DACL that specifies who can access the objects with what permissions. If this policy is enabled, the default DACL is stronger, allowing non-admin users to read shared objects, but not modify shared objects that they did not create.",
      "severity": "low"
    },
    {
      "id": "V-1174",
      "title": "Amount of idle time required before suspending a session is improperly set.",
      "description": "Administrators should use this setting to control when a computer disconnects an inactive SMB session. If client activity resumes, the session is automatically reestablished.  This protects critical and sensitive network data from exposure to unauthorized personnel with physical access to the computer.",
      "severity": "low"
    },
    {
      "id": "V-11806",
      "title": "The system is configured to allow the display of the last user name on the logon screen.",
      "description": "The user name of the last user to log onto a system will not be displayed.  This eliminates half of the Userid/Password equation that an unauthorized person would need to log on.",
      "severity": "low"
    },
    {
      "id": "V-12780",
      "title": "The Synchronize Directory Service Data user right must not be assigned to any account.",
      "description": "A Windows account with the Synchronize Directory Service Data right has the ability to read all information in the AD database. This bypasses the object access permissions that would otherwise restrict access to the data. The scope of access granted by this right is too broad for secure usage. Specific object permissions or other group membership assignments could be used to provide access on an appropriate scale.",
      "severity": "high"
    },
    {
      "id": "V-14247",
      "title": "Terminal Services / Remote Desktop Service - Prevent password saving in the Remote Desktop Client",
      "description": "This check verifies that the system is configured to prevent Users from saving passwords in the Remote Desktop Client.",
      "severity": "medium"
    },
    {
      "id": "V-14262",
      "title": "IPv6 will be disabled until a deliberate transition strategy has been implemented.",
      "description": "Any nodes’ interface with IPv6 enabled by default presents a potential risk of traffic being transmitted or received without proper risk mitigation strategy and therefore a serious security concern.",
      "severity": "medium"
    },
    {
      "id": "V-15823",
      "title": "Remove Software Certificate Installation Files",
      "description": "This check verifies that software certificate installation files have been removed from a system.",
      "severity": "medium"
    },
    {
      "id": "V-17900",
      "title": "Disallow AutoPlay/Autorun from Autorun.inf",
      "description": "This registry key will prevent the autorun.inf from executing commands.",
      "severity": "high"
    },
    {
      "id": "V-18010",
      "title": "Unapproved Users have access to Debug programs.",
      "description": "This is a Category 1 finding as it provides access to the kernel with complete access to sensitive and critical operating system components.",
      "severity": "high"
    },
    {
      "id": "V-2372",
      "title": "Reversible password encryption is not disabled.",
      "description": "Storing passwords using reversible encryption is essentially the same as storing clear-text versions of the passwords. For this reason, this policy should never be enabled.",
      "severity": "medium"
    },
    {
      "id": "V-2373",
      "title": "The Server Operators group must have the ability to schedule jobs by means of the AT command disabled.",
      "description": "This policy controls the ability of members of the local Server Operators group to schedule AT jobs. If disabled, only administrators can schedule jobs that use AT commands. Unlike Scheduled Tasks which require you to specify the credential under which the task will run, AT jobs run under the authority of whatever account the AT service runs (SYSTEM by default). Non administrators who can schedule AT commands, thus have a means to elevate their privileges.  Although this setting is disabled, Server Operators will still be able to schedule jobs using Task Scheduler.",
      "severity": "medium"
    },
    {
      "id": "V-2374",
      "title": "The system is configured to autoplay removable media.",
      "description": "Autoplay begins reading from a drive as soon as you insert media in the drive.  As a result, the setup file of programs and the music on audio media starts immediately.  By default, Autoplay is disabled on removable drives, such as the floppy disk drive (but not the CD-ROM drive), and on network drives.  If you enable this policy, you can also disable Autoplay on all drives.",
      "severity": "high"
    },
    {
      "id": "V-2376",
      "title": "The Kerberos policy option must be configured to enforce user logon restrictions.",
      "description": "This policy setting determines whether the Kerberos Key Distribution Center (KDC) validates every request for a session ticket against the user rights policy of the target computer. The policy is enabled by default which is the most secure setting for validating access to target resources is not circumvented.",
      "severity": "medium"
    },
    {
      "id": "V-2377",
      "title": "The Kerberos service ticket maximum lifetime must meet minimum standards.",
      "description": "This setting determines the maximum amount of time (in minutes) that a granted session ticket can be used to access a particular service.  Session tickets are used only to authenticate new connections with servers.  Ongoing operations are not interrupted if the session ticket used to authenticate the connection expires during the connection.",
      "severity": "medium"
    },
    {
      "id": "V-2378",
      "title": "The Kerberos policy option maximum lifetime for user ticket must be set to a maximum of 10 hours or less.",
      "description": " In Kerberos, there are 2 types of tickets: Ticket Granting Tickets (TGTs) and Service Tickets.  Kerberos tickets have a limited lifetime so the time an attacker has to implement an attack is limited.  This policy controls how long TGTs can be renewed.  With Kerberos, the user’s initial authentication to the domain controller results in a TGT which is then used to request Service Tickets to resources.  Upon startup, each computer gets a TGT before requesting a service ticket to the domain controller and any other computers it needs to access.  For services that startup under a specified user account, users must always get a TGT first, then get Service Tickets to all computers and services accessed. ",
      "severity": "medium"
    },
    {
      "id": "V-2379",
      "title": "The Kerberos policy option Maximum lifetime for user ticket renewal must be configured for a maximum of 7 days or less.",
      "description": "This setting determines the period of time (in days) during which a users TGT may be renewed. This security configuration limits the amount of time an attacker has to crack the TGT and gain access.",
      "severity": "medium"
    },
    {
      "id": "V-2380",
      "title": "The Kerberos policy option Maximum tolerance for computer clock synchronization must be set to a maximum of 5 minutes or less. ",
      "description": "This setting determines the maximum time difference (in minutes) that Kerberos will tolerate between the time on a client's clock and the time on a server's clock while still considering the two clocks synchronous.  In order to prevent replay attacks, Kerberos uses timestamps as part of its protocol definition. For timestamps to work properly, the clocks of the client and the server need to be in sync as much as possible.",
      "severity": "medium"
    },
    {
      "id": "V-26359",
      "title": "The Windows dialog box title for the legal banner must be configured.",
      "description": "Failure to display the logon banner prior to a logon attempt will negate legal proceedings resulting from unauthorized access to system resources.",
      "severity": "low"
    },
    {
      "id": "V-26484",
      "title": "The Deny log on as a service user right will be configured to include no one (blank).",
      "description": "Inappropriate granting of user rights can provide system, administrative, and other high level capabilities.\n\nThe \"Deny log on as a service\" right defines accounts that are denied log on as a service.  Incorrect configurations could prevent services from starting and result in a DoS.\n",
      "severity": "medium"
    },
    {
      "id": "V-26485",
      "title": "The Deny log on locally user right on domain controllers must be configured to prevent unauthenticated access. ",
      "description": "Inappropriate granting of user rights can provide system, administrative, and other high level capabilities.\n\nThe \"Deny log on locally\" right defines accounts that are prevented from logging on interactively.  \n\nThe Guests group and Support_388945a0 account must be assigned this right to prevent unauthenticated access.",
      "severity": "medium"
    },
    {
      "id": "V-3338",
      "title": "Unauthorized named pipes are accessible with anonymous credentials.",
      "description": "This is a Category 1 finding because the potential for gaining unauthorized system access.  Pipes are internal system communications processes.  They are identified internally by ID numbers that vary between systems.  To make access to these processes easier, these pipes are given names that do not vary between systems.  This setting controls which of these pipes anonymous users may access.",
      "severity": "high"
    },
    {
      "id": "V-3339",
      "title": "Unauthorized registry paths are remotely accessible.",
      "description": "This is a Category 1 finding because it could give unauthorized individuals access to the Registry.  \nIt controls which registry paths are accessible from a remote computer.",
      "severity": "high"
    },
    {
      "id": "V-3340",
      "title": "Unauthorized shares can be accessed anonymously.",
      "description": "This is a Category 1 finding because the potential for gaining unauthorized system access. Any shares listed can be accessed by any network user.  This could lead to the exposure or corruption of sensitive data.  Enabling this setting is very dangerous.",
      "severity": "high"
    },
    {
      "id": "V-3341",
      "title": "Remote control of a Terminal Service session is allowed.",
      "description": "This setting is used to control the rules for remote control of Terminal Services user sessions.  This is a Category 1 finding because remote control of sessions could permit an unauthorized user to access sensitive information on the controlled system.",
      "severity": "high"
    },
    {
      "id": "V-3342",
      "title": "The computer does not wait for the network at computer startup.",
      "description": "The setting determines if Windows waits for complete network initialization before allowing the user to log on.  Part of this initialization is the application of Group Policy.  This may permit a User to log on before all GPOs (Group Policy Objects) are obtained and processed and so the user may operate under the incorrect security context for a time.",
      "severity": "medium"
    },
    {
      "id": "V-3343",
      "title": "Solicited Remote Assistance is allowed.",
      "description": "This setting controls whether or not solicited remote assistance is allowed from this computer.  Solicited assistance is help that is specifically requested by the user.  This is a Category 1 finding because it may allow unauthorized parties access to the resources on the computer.",
      "severity": "high"
    },
    {
      "id": "V-3344",
      "title": "The use of local accounts with blank passwords is not restricted to console logons only.",
      "description": "This is a Category 1 finding because no accounts with blank passwords should exist on a system.  The password policy should prevent this from occurring.  However, if a local account with a blank password does exist, enabling this setting will limit the account to local console logon only.",
      "severity": "high"
    },
    {
      "id": "V-3348",
      "title": "The user is allowed to launch Windows Messenger (MSN Messenger, .NET Messenger).",
      "description": "This setting prevents the Windows Messenger client from being run.  \n\nInstant Messaging clients must be in compliance of with the Instant Messaging STIG.  Windows Messenger should not be active on Windows unless the instant messaging system is a Managed Enterprise Service for unclassified data for which the DAA has approved.",
      "severity": "medium"
    },
    {
      "id": "V-3349",
      "title": "Windows Messenger (MSN Messenger, .NET messenger) is run at system startup.",
      "description": "This setting prevents the automatic launch of Windows Messenger at user logon.  \n\nInstant Messaging clients must be in compliance of with the Instant Messaging STIG.  Windows Messenger should not be active on Windows unless the instant messaging system is a Managed Enterprise Service for unclassified data for which the DAA has approved.",
      "severity": "medium"
    },
    {
      "id": "V-3369",
      "title": "Restricted accounts are not disabled.",
      "description": "Several new accounts are created as part of the default installation.  As these accounts are well known they may represent prime attack targets.  To help prevent attacks using the well-known accounts the following accounts should be disabled: HelpAssistant and Support_388945a0.",
      "severity": "medium"
    },
    {
      "id": "V-3372",
      "title": "The system can be removed from the docking station without logging on first.",
      "description": "This setting controls the ability to undock the system without having to log on.  Since the removal of a computer should be controlled, users should have to log on before undocking the computer to ensure that they have the appropriate rights to undock the system.  In addition to software security settings, physical security should be in place to prevent unauthorized removal of computers.",
      "severity": "medium"
    },
    {
      "id": "V-3373",
      "title": "The maximum age for machine account passwords is not set to requirements.",
      "description": "This setting controls the maximum password age that a machine account may have.  This setting should be set to no more than 30 days, ensuring the machine changes its password monthly.",
      "severity": "low"
    },
    {
      "id": "V-3374",
      "title": "The system is not configured to require a strong session key.",
      "description": "This setting controls the required strength of a session key. ",
      "severity": "medium"
    },
    {
      "id": "V-3375",
      "title": "Domain Controller authentication is not required to unlock the workstation.",
      "description": "This setting controls the behavior of the system when you attempt to unlock the workstation.  If this setting is enabled, the system will pass the credentials to the domain controller (if in a domain) for authentication before allowing the system to be unlocked.  This setting should be enabled.",
      "severity": "medium"
    },
    {
      "id": "V-3376",
      "title": "The system is configured to permit storage of credentials or .NET Passports.",
      "description": "This setting controls the storage of authentication credentials or .NET passports on the local system.  Such credentials should never be stored on the local machine as that may lead to account compromise.",
      "severity": "medium"
    },
    {
      "id": "V-3377",
      "title": "The system is configured to give anonymous users Everyone rights.",
      "description": "This setting helps define the permissions that anonymous users have.  If this setting is enabled then anonymous users have the same rights and permissions as the built-in Everyone group.  Anonymous users should not have these permissions or rights.",
      "severity": "medium"
    },
    {
      "id": "V-3378",
      "title": "The system is not configured to use the Classic security model.",
      "description": "Windows includes two network-sharing security models - Classic and Guest only. With the classic model, local accounts must be password protected; otherwise, anyone can use guest user accounts to access shared system resources.",
      "severity": "medium"
    },
    {
      "id": "V-3379",
      "title": "The system is configured to store the LAN Manager hash of the password in the SAM.",
      "description": "This setting controls whether or not a LAN Manager hash of the password is stored in the SAM the next time the password is changed.  The LAN Manager hash is a weak encryption algorithm and there are several tools available that use this hash to retrieve account passwords.",
      "severity": "high"
    },
    {
      "id": "V-3380",
      "title": "The system is not configured to force users to log off when their allowed logon hours expire.",
      "description": "This setting controls whether or not users are forced to log off when their allowed logon hours expire.  If logon hours are set for users, then this should be enforced.",
      "severity": "medium"
    },
    {
      "id": "V-3381",
      "title": "The system is not configured to recommended LDAP client signing requirements.",
      "description": "This setting controls the signing requirements for LDAP clients.  This setting should be set to Negotiate signing or Require signing depending on the environment and type of LDAP server in use.",
      "severity": "medium"
    },
    {
      "id": "V-3382",
      "title": "The system is not configured to meet the minimum requirement for session security for NTLM SSP based Clients.",
      "description": "Microsoft has implemented a variety of security support providers for use with RPC sessions.  In a homogenous Windows environment, all of the options should be enabled and testing should be performed in a heterogeneous environment to determine the maximum-security level that provides reliable functionality.",
      "severity": "medium"
    },
    {
      "id": "V-3383",
      "title": "The system is not configured to use FIPS compliant Algorithms for Encryption, Hashing, and Signing.",
      "description": "This setting ensures that the system uses algorithms that are FIPS compliant for encryption, hashing, and signing.  FIPS compliant algorithms meet specific standards established by the U.S. Government and should be the algorithms used for all OS encryption functions.",
      "severity": "medium"
    },
    {
      "id": "V-3384",
      "title": "The system is not configured to make the object creator the owner of objects created by administrators.",
      "description": "Either the object creator or the Administrators group owns objects created by members of the Administrators group.  In order to ensure accurate auditing and proper accountability, the default owner should be the object creator.",
      "severity": "medium"
    },
    {
      "id": "V-3385",
      "title": "The system is configured to allow case insensitivity.",
      "description": "This setting controls the behavior of non-Windows subsystems when dealing with the case of arguments or commands.  Case sensitivity could lead to the access of files or commands that should be restricted.  To prevent this from happening, case insensitivity restrictions should be required.",
      "severity": "medium"
    },
    {
      "id": "V-3426",
      "title": "The system is configured to allow remote desktop sharing through NetMeeting.",
      "description": "Remote desktop sharing enables several users to interact and control one desktop.  This could allow unauthorized users to control the system.  Remote desktop sharing should be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-3449",
      "title": "Terminal Services is not configured to limit users to one remote session.",
      "description": "This setting limits users to one remote session.  It is possible, if this setting is disabled, for users to establish multiple sessions.",
      "severity": "medium"
    },
    {
      "id": "V-3450",
      "title": "Terminal Services is not configured to limit the number of connections.",
      "description": "This setting limits the number of simultaneous connections allowed to the terminal server.  By default, unlimited connections are allowed.  Allowing unlimited connections allows a potential DoS attack.  The number of incoming connections should be limited to one.",
      "severity": "medium"
    },
    {
      "id": "V-3454",
      "title": "Terminal Services is not configured with the client connection encryption set to the required level.",
      "description": "Remote connections must be encrypted to prevent interception of data or sensitive information.  Selecting “High Level” will ensure encryption of Terminal Services sessions in both directions.",
      "severity": "medium"
    },
    {
      "id": "V-3455",
      "title": "Terminal Services is configured to use a common temporary folder for all sessions.",
      "description": "This setting, which is located under the Temporary Folders section of the Terminal Services configuration option, controls the use of per session temporary folders or of a communal temporary folder.  If this setting is enabled, only one temporary folder is used for all terminal services sessions.  If a communal temporary folder is used, it might be possible for users to access other users temporary folders.",
      "severity": "medium"
    },
    {
      "id": "V-3456",
      "title": "Terminal Services is not configured to delete temporary folders.",
      "description": "This setting, which is located under the Temporary Folders section of the Terminal Services configuration option, controls the deletion of the temporary folders when the session is terminated.  Temporary folders should always be deleted after a session is over to prevent hard disk clutter and potential leakage of information.",
      "severity": "medium"
    },
    {
      "id": "V-3457",
      "title": "Terminal Services is not configured to set a time limit for disconnected sessions.",
      "description": "This setting controls how long a session will remain open if it is unexpectedly terminated.  Such sessions should be terminated as soon as possible.",
      "severity": "medium"
    },
    {
      "id": "V-3458",
      "title": "Terminal Services idle session time limit does not meet the requirement.",
      "description": "This setting controls how long a session may be idle before it is automatically disconnected from the server.  Users should disconnect if they plan on being away from their terminals for extended periods of time.  Idle sessions should be disconnected after 15 minutes.",
      "severity": "medium"
    },
    {
      "id": "V-3459",
      "title": "Terminal Services is not configured to allow only the original client to reconnect.",
      "description": "This setting, which is located under the Sessions section of the Terminal Services configuration option, controls whether a different client may be used to resume a disconnected session.  Only the original client should be able to resume a session to help prevent session hijacking.",
      "severity": "medium"
    },
    {
      "id": "V-3460",
      "title": "Terminal Services is not configured to disconnect clients when time limits are exceeded.",
      "description": "This setting, which is located under the Sessions section of the Terminal Services configuration option, controls whether or not clients are forcefully disconnected if their terminal services time limit is exceeded.  If time limits are established for users, they should be enforced.",
      "severity": "medium"
    },
    {
      "id": "V-3469",
      "title": "The system is configured to prevent background refresh of Group Policy.",
      "description": "If this setting is enabled, then Group Policy settings are not refreshed while a user is currently logged on.  This could lead to instances when a user does not have the latest changes to a policy applied and is therefore operating in an insecure context.",
      "severity": "medium"
    },
    {
      "id": "V-3470",
      "title": "The system is configured to allow unsolicited remote assistance offers.",
      "description": "This setting controls whether unsolicited offers of help to this computer are allowed.  The list of users allowed to offer remote assistance to this system is accessed by pressing the Helpers button.",
      "severity": "medium"
    },
    {
      "id": "V-3471",
      "title": "The system is configured to automatically forward error information.",
      "description": "This setting controls the reporting of errors to Microsoft and, if defined, a corporate error reporting site.  This does not interfere with the reporting of errors to the local user.  Since the contents of memory are included in this Error Report, sensitive information may be transmitted to Microsoft.  This feature should be disabled to prevent the release of such information.",
      "severity": "medium"
    },
    {
      "id": "V-3478",
      "title": "The system is configured to allow installation of printers using kernel-mode drivers.",
      "description": "Kernel-mode drivers are drivers that operate in kernel mode.  Kernel mode allows virtually unlimited access to hardware and memory.  A poorly written kernel driver may cause system instability and data corruption.  Malicious code inserted in a kernel-mode driver has almost no limit on what it may do.  Most modern printers do not require kernel-mode drivers.",
      "severity": "medium"
    },
    {
      "id": "V-3479",
      "title": "The system is not configured to use Safe DLL Search Mode.",
      "description": "The default search behavior, when an application calls a function in a Dynamic Link Library (DLL), is to search the current directory followed by the directories contained in the systems path environment variable.  An unauthorized DLL inserted into an applications working directory could allow malicious code to be run on the system.  Creating the following registry key and setting the appropriate value forces the system to search the %Systemroot% for the DLL before searching the current directory or the rest of the path.",
      "severity": "medium"
    },
    {
      "id": "V-3480",
      "title": "Media Player is configured to allow automatic checking for updates.",
      "description": "The automatic check for updates perform by the Windows Media Player must be disabled to ensure a constant platform and to prevent the introduction of unknown/untested software on the network.",
      "severity": "medium"
    },
    {
      "id": "V-3666",
      "title": "The system is not configured to meet the minimum requirement for session security for NTLM SSP based Servers.",
      "description": "Microsoft has implemented a variety of security support providers for use with RPC sessions.  In a homogenous Windows environment, all of the options should be enabled and testing should be performed in a heterogeneous environment to determine the maximum-security level that provides reliable functionality.",
      "severity": "medium"
    },
    {
      "id": "V-4108",
      "title": "The system does not generate an audit event when the audit log reaches a percent full threshold.",
      "description": "When the audit log reaches a given percent full, an audit event is written to the security log. The event ID is 523 and is recorded as a success audit under the category of System. This option may be especially useful if the audit logs are set to be cleared manually. A recommended setting would be 90 percent.",
      "severity": "low"
    },
    {
      "id": "V-4109",
      "title": "The system is configured to allow dead gateway detection.",
      "description": "Allows TCP to peform dead-gateway detection, switching to a backup gateway if a number of connections to a gateway are experiencing difficulty. If enabled, an attacker could force internal traffic to be directed to a gateway outside the network. This setting applies to all network adapters, regardless of their individual settings.",
      "severity": "low"
    },
    {
      "id": "V-4110",
      "title": "The system is configured to allow IP source routing.",
      "description": "Protects against IP source routing spoofing.",
      "severity": "low"
    },
    {
      "id": "V-4111",
      "title": "The system is configured to redirect ICMP.",
      "description": "When disabled, forces ICMP to be routed via shortest path first.",
      "severity": "low"
    },
    {
      "id": "V-4112",
      "title": "The system is configured to detect and configure default gateway addresses.",
      "description": "Enables or disables the Internet Router Discovery Protocol (IRDP) used to detect and configure Default Gateway addresses on the computer.",
      "severity": "low"
    },
    {
      "id": "V-4113",
      "title": "The system is configured for a greater keep-alive time than recommended.",
      "description": "Controls how often TCP sends a keep-alive packet in attempting to verify that an idle connection is still intact.",
      "severity": "low"
    },
    {
      "id": "V-4116",
      "title": "The system is configured to allow name-release attacks.",
      "description": "Prevents a denial-of-service (DoS) attack against a WINS server. The DoS consists of sending a NetBIOS Name Release Request to the server for each entry in the servers cache, causing a response delay in the normal operation of the servers WINS resolution capability.",
      "severity": "low"
    },
    {
      "id": "V-4117",
      "title": "The system is configured to allow SYN attacks.",
      "description": "Adjusts retransmission of TCP SYN-ACKs. When enabled, connection responses time out more quickly in the event of a SYN DoS attack.",
      "severity": "low"
    },
    {
      "id": "V-4407",
      "title": "LDAP server must sign all traffic sent to the client.",
      "description": "By default, LDAP traffic is unsigned, which makes this traffic vulnerable to man . in . the . middle attacks. In this type of attack, an intruder captures packets between the server and the client and modifies them before forwarding them to the client. In the case of an LDAP server, this means that an attacker could cause a client to make decisions based on false records from the LDAP directory. This setting requires that the domain controller signs data sent to the client, which allows the client to verify that the data was not modified in transit. This is important because the client makes security decisions based on LDAP query results. For instance, member servers rely on LDAP queries to find out group membership or to determine which group policy objects should apply. \n\nIf this policy is configured as 'none', the server will not require data signatures but will provide them if requested by the client. The 'Require signature' term means the domain contfoller will only bind with clients that negotiate LDAP data. \n",
      "severity": "medium"
    },
    {
      "id": "V-4408",
      "title": "The domain controller must be configured to allow reset of machine account passwords.",
      "description": "Enabling this setting on all domain controllers in a domain prevents domain members from changing their computer account passwords. If these passwords are weak or compromised, the inability to change them may leave these computers vulnerable.\n",
      "severity": "low"
    },
    {
      "id": "V-4437",
      "title": "TCP connection response retransmissions are not controlled.",
      "description": "In a SYN flood attack, the attacker sends a continuous stream of SYN packets to a server, and the server leaves the half-open connections open until it is overwhelmed and no longer is able to respond to legitimate requests. \n",
      "severity": "low"
    },
    {
      "id": "V-4438",
      "title": "TCP data retransmissions are not controlled.",
      "description": "In a SYN flood attack, the attacker sends a continuous stream of SYN packets to a server, and the server leaves the half-open connections open until it is overwhelmed and no longer is able to respond to legitimate requests. \n",
      "severity": "low"
    },
    {
      "id": "V-4442",
      "title": "This check verifies that Windows is configured to have password protection take effect within a limited time frame when the screen saver becomes active.",
      "description": "Allowing more than several seconds makes the computer vulnerable to a potential attack from someone walking up to the console to attempt to log onto the system before the lock takes effect.",
      "severity": "low"
    },
    {
      "id": "V-4443",
      "title": "Unauthorized registry paths and sub-paths are remotely accessible.",
      "description": "The registry is a database for computer configuration information, much of which is sensitive. An attacker could use this to facilitate unauthorized activities. To reduce the risk of this happening, it is also lowered by the fact that the default ACLs assigned throughout the registry are fairly restrictive and they help to protect it from access by unauthorized users. \n",
      "severity": "high"
    },
    {
      "id": "V-4444",
      "title": "Users are not required to enter a password to access private keys.",
      "description": "Configuring this setting so that users must provide a password (distinct from their domain password) every time they use a key makes it more difficult for an attacker to access locally stored user keys, even if the attacker takes control of the users computer and determines their logon password. \n",
      "severity": "medium"
    },
    {
      "id": "V-4445",
      "title": "Optional Subsystems are permitted to operate on the system.",
      "description": "The POSIX subsystem is an Institute of Electrical and Electronic Engineers (IEEE) standard that defines a set of operating system services. The POSIX Subsystem is required if the server supports applications that use that subsystem. \nThe subsystem introduces a security risk relating to processes that can potentially persist across logins. That is, if a user starts a process and then logs out, there is a potential that the next user who logs in to the system could access the previous users process. This is dangerous because the process started by the first user may retain that users system privileges; anything the second user does with that process will be performed with the privileges of the first user. \n",
      "severity": "low"
    },
    {
      "id": "V-4446",
      "title": "Software certificate restriction policies are not enforced.",
      "description": "Software restriction policies help to protect users and computers from executing unauthorized code such as viruses and Trojans horses. \n",
      "severity": "medium"
    },
    {
      "id": "V-4447",
      "title": "The Terminal Server does not require secure RPC communication.",
      "description": "Allowing unsecure RPC communication exposes the server to man in  the middle attacks and data disclosure attacks. A man in the middle attack occurs when an intruder captures packets between a client and server and modifies them before allowing the packets to be exchanged. Usually the attacker will modify the information in the packets in an attempt to cause either the client or server to reveal sensitive information. \n",
      "severity": "medium"
    },
    {
      "id": "V-4448",
      "title": "Group Policy objects are not reprocessed if they have not changed.",
      "description": "Enabling this setting and then selecting the \"Process even if the Group Policy objects have not changed\" option ensures that the policies will be reprocessed even if none have been changed. This way, any unauthorized changes are forced to match the domain-based group policy settings again. \n",
      "severity": "medium"
    },
    {
      "id": "V-6831",
      "title": "Outgoing secure channel traffic is not encrypted or signed.",
      "description": "Requests sent on the secure channel are authenticated, and sensitive information (such as passwords) is encrypted, but not all information is encrypted.  If this policy is enabled, outgoing secure channel traffic will be encrypted and signed.",
      "severity": "medium"
    },
    {
      "id": "V-6832",
      "title": "The Windows Server SMB client is not enabled to always perform SMB packet signing.",
      "description": "If this policy is enabled, it causes the Windows Server Message Block (SMB) client to perform SMB packet signing when communicating with an SMB server that is enabled or required to perform SMB packet signing.",
      "severity": "medium"
    },
    {
      "id": "V-6833",
      "title": "The Windows Server SMB server is not enabled to always perform SMB packet signing.",
      "description": "If this policy is enabled, it causes the Windows Server Message Block (SMB) server to always perform SMB packet signing.",
      "severity": "medium"
    },
    {
      "id": "V-6834",
      "title": "Named Pipes and Shares can be accessed anonymously.",
      "description": "This is a Category 1 finding because of the potential for gaining unauthorized system access. \n\nPipes are internal system communications processes.  They are identified internally by ID numbers that vary between systems.  To make access to these processes easier, these pipes are given names that do not vary between systems.  \n\nWhen this setting is disabled, Network shares can be accessed by any network user.  This could lead to the exposure or corruption of sensitive data.",
      "severity": "high"
    },
    {
      "id": "V-6836",
      "title": "For systems utilizing a logon ID as the individual identifier, passwords are not at a minimum of 14-characters.",
      "description": "Information systems not protected with strong password schemes including passwords of minimum length provide the opportunity for anyone to crack the password thus gaining access to the system and causing the device, information, or the local network to be compromised or a denial of service. ",
      "severity": "medium"
    },
    {
      "id": "V-6850",
      "title": "Auditing must be configured as required.",
      "description": "Maintaining an audit trail of system activity logs can help identify configuration errors, troubleshoot service disruptions, and analyze compromises that have occurred, as well as detect attacks.  Audit logs are necessary to provide a trail of evidence in case the system or network is compromised.  Collecting this data is essential for analyzing the security of information assets and detecting signs of suspicious and unexpected behavior.",
      "severity": "medium"
    }
  ]
}