{
  "name": "stig_zos_bmc_control-mracf",
  "date": "2017-09-22",
  "description": "None",
  "title": "z/OS BMC CONTROL-M for RACF STIG",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-16932",
      "title": "BMC CONTROL-M installation data sets will be properly protected.",
      "description": "BMC CONTROL-M installation data sets have the ability to use privileged functions and/or have access to sensitive data.  Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-17067",
      "title": "BMC CONTROL-M STC data sets will be properly protected.",
      "description": "BMC CONTROL-M STC data sets have the ability to use privileged functions and/or have access to sensitive data.  Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-17072",
      "title": "BMC CONTROL-M User/Application JCL data sets must be properly protected.",
      "description": "BMC CONTROL-M User/Application JCL data sets have the ability to use privileged functions and/or have access to sensitive data.  Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-17452",
      "title": "BMC CONTROL-M Started Task name is not properly identified / defined to the system ACP.",
      "description": "BMC CONTROL-M requires a started task that will be restricted to certain resources, datasets and other system functions. By defining the started task as a userid to the system ACP, It allows the ACP to control the access and authorized users that require these capabilities. Failure to properly control these capabilities, could compromise of the operating system environment, ACP, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-17454",
      "title": "BMC CONTROL-M Started task(s) must be properly defined to the STARTED resource class for RACF.",
      "description": "Access to product resources should be restricted to only those individuals responsible for the application connectivity and who have a requirement to access these resources.  Improper control of product resources could potentially compromise the operating system, ACP, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-17947",
      "title": "BMC C0NTROL-M resources must be properly defined and protected.",
      "description": "BMC CONTROL-M can run with sensitive system privileges, and potentially can circumvent system controls. Failure to properly control access to product resources could result in the compromise of the operating system environment, and compromise the confidentiality of customer data. Many utilities assign resource controls that can be granted to system programmers only in greater than read authority. Resources are also granted to certain non-systems personnel with read only authority.",
      "severity": "medium"
    },
    {
      "id": "V-17985",
      "title": "BMC CONTROL-M security exits are not installed or configured properly.",
      "description": "The BMC CONTROL-M security exits enable access authorization checking to BMC CONTROL-M commands, features, and online functionality.  If these exit(s) is (are) not in place, activities by unauthorized users may result.  BMC CONTROL-M security exit(s) interface with the ACP.  If an unauthorized exit was introduced into the operating environment, system security could be weakened or bypassed.  These exposures may result in the compromise of the operating system environment, ACP, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-18014",
      "title": "BMC CONTROL-M configuration/parameter values are not specified properly.",
      "description": "BMC CONTROL-M configuration/parameters control the security and operational characteristics of products.  If these parameter values are improperly specified, security and operational controls may be weakened.  This exposure may threaten the availability of the product applications, and compromise the confidentiality of customer data.",
      "severity": "medium"
    },
    {
      "id": "V-21592",
      "title": "BMC CONTROL-M User data sets will be properly protected.",
      "description": "BMC CONTROL-M User data sets, Repository, have the ability to use privileged functions and/or have access to sensitive data.  Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    }
  ]
}