{
  "name": "stig_adobe_acrobat_professional_dc_classic",
  "date": "2019-07-01",
  "description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.",
  "title": "Adobe Acrobat Professional DC Classic Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-80111",
      "title": "Adobe Acrobat Pro DC Classic Enhanced Security for standalone mode must be enabled.",
      "description": "Enhanced Security (ES) is a sandbox capability that restricts access to system resources. ES can be configured in two modes: Standalone mode is when Acrobat opens the desktop PDF client. ES Browser mode is when a PDF is opened via the browser plugin. When Enhanced Security is enabled and a PDF file tries to complete a restricted action from an untrusted location, a security warning must appear.Enhanced Security \"hardens\" the application against risky actions. It prevents cross domain access, prohibits script and data injection, blocks stream access to XObjects, silent printing, and execution of high privilege JavaScript.",
      "severity": "medium"
    },
    {
      "id": "V-80113",
      "title": "Adobe Acrobat Pro DC Classic Enhanced Security for browser mode must be enabled.",
      "description": "Enhanced Security (ES) is a sandbox capability that restricts access to system resources and prevents PDF cross domain access. ES can be configured in two modes: Standalone mode is when Acrobat opens the desktop PDF client. ES Browser mode is when a PDF is opened via the browser plugin. When Enhanced Security is enabled and a PDF file tries to complete a restricted action from an untrusted location, a security warning must appear.Enhanced Security \"hardens\" the application against risky actions. It prevents cross domain access, prohibits script and data injection, blocks stream access to XObjects, silent printing, and execution of high privilege JavaScript.",
      "severity": "medium"
    },
    {
      "id": "V-80115",
      "title": "Adobe Acrobat Pro DC Classic PDF file attachments must be blocked.",
      "description": "Acrobat Pro allows for files to be attached to PDF documents. Attachments represent a potential security risk because they can contain malicious content, open other dangerous files, or launch applications.This feature prevents users from opening or launching file types other than PDF or FDF and disables the menu option to re-enable.",
      "severity": "medium"
    },
    {
      "id": "V-80117",
      "title": "Adobe Acrobat Pro DC Classic access to unknown websites must be restricted.",
      "description": "Acrobat provides the ability for the user to store a list of websites with an associated behavior of allow, ask, or block. Websites that are not in this list are unknown. PDF files can contain URLs that will initiate connections to unknown websites in order to share or get information. That access must be restricted.",
      "severity": "low"
    },
    {
      "id": "V-80119",
      "title": "Adobe Acrobat Pro DC Classic access to websites must be blocked.",
      "description": "PDF files can contain URLs that initiate connections to websites in order to share or get information. Any Internet access introduces a security risk as malicious websites can transfer harmful content or silently gather data.",
      "severity": "low"
    },
    {
      "id": "V-80121",
      "title": "Adobe Acrobat Pro DC Classic must be configured to block Flash Content.",
      "description": "Flash has a long history of vulnerabilities.  Although Flash is no longer provided with Acrobat, if the system has Flash installed, a malicious PDF could execute code on the system.  Configuring Flash to run from a privileged location limits the execution capability of untrusted Flash content that may be embedded in the PDF.",
      "severity": "medium"
    },
    {
      "id": "V-80123",
      "title": "The Adobe Acrobat Pro DC Classic Send and Track plugin for Outlook must be disabled.",
      "description": "When enabled, the Adobe Send and Track button appears in Outlook. When an email is composed it enables the ability to send large files as public links through Outlook. The attached files can be uploaded to the Adobe Document Cloud and public links to the files are inserted in the email body.",
      "severity": "medium"
    },
    {
      "id": "V-80125",
      "title": "Adobe Acrobat Pro DC Classic privileged file and folder locations must be disabled.",
      "description": "Privileged Locations are the primary method Acrobat uses to allow users and admins to specify trusted content that should be exempt from security restrictions, such as when Enhanced Security is enabled.   A Privileged Location may be a file, folder, or a host.  If the user is allowed to set a Privileged Location, they could bypass security protections.",
      "severity": "medium"
    },
    {
      "id": "V-80127",
      "title": "Adobe Acrobat Pro DC Classic FIPS mode must be enabled.",
      "description": "Use of weak or untested encryption algorithms undermines the purposes of using encryption to protect data. The application must implement cryptographic modules adhering to the higher standards approved by the federal government since this provides assurance they have been tested and validated.",
      "severity": "medium"
    },
    {
      "id": "V-80129",
      "title": "Adobe Acrobat Pro DC Classic periodic downloading of Adobe European certificates must be disabled.",
      "description": "By default, the user can update Adobe European certificates from an Adobe server through the GUI.   When updating Adobe European certificates is disabled, it prevents the automatic download and installation of certificates and disables and locks the end user's ability to download those certificates.",
      "severity": "low"
    },
    {
      "id": "V-80131",
      "title": "Adobe Acrobat Pro DC Classic Protected Mode must be enabled.",
      "description": "Protected Mode is a \"sandbox\" that is essentially a read-only mode.  When enabled, Acrobat allows the execution environment of untrusted PDF's and the processes the PDF may invoke but also presumes all PDFs are potentially malicious and confines processing to a restricted sandbox.",
      "severity": "medium"
    },
    {
      "id": "V-80133",
      "title": "Adobe Acrobat Pro DC Classic Protected View must be enabled.",
      "description": "Protected View is a \"super-sandbox\" that is essentially a read-only mode. When enabled, Acrobat strictly confines the execution environment of untrusted PDF's and the processes the PDF may invoke. Acrobat also assumes all PDFs are potentially malicious and confines processing to a restricted sandbox. When the PDF is opened, the user is presented with the option to trust the document. When the user chooses to trust the document, all features are enabled, this action assigns trust to the document and adds the document to the user's list of Privileged Locations.",
      "severity": "medium"
    },
    {
      "id": "V-80135",
      "title": "The Adobe Acrobat Pro DC Classic latest security-related software updates must be installed.",
      "description": "Security flaws with software applications are discovered daily. Vendors are constantly updating and patching their products to address newly discovered security vulnerabilities. Organizations (including any contractor to the organization) are required to promptly install security-relevant software updates (e.g., patches, service packs, and hot fixes). Flaws discovered during security assessments, Classic monitoring, incident response activities, or information system error handling must also be addressed expeditiously. This requirement will apply to software patch management solutions that are used to install patches across the enclave and also to applications that are not part of that patch management solution. For example, many browsers today provide the capability to install their own patch software. Patch criticality, as well as system criticality, will vary. Therefore, the tactical situations regarding the patch management process will also vary. This means that the time period used must be a configurable parameter. Time frames for application of security-relevant software updates may be dependent upon the Information Assurance Vulnerability Management (IAVM) process. The application will be configured to check for and install security-relevant software updates within an identified time period from the availability of the update. The specific time period will be defined by an authoritative source (e.g., IAVM, CTOs, DTMs, and STIGs).",
      "severity": "high"
    },
    {
      "id": "V-80137",
      "title": "Adobe Acrobat Pro DC Classic Default Handler changes must be disabled.",
      "description": "Acrobat Pro allows users to change the version of Acrobat Pro that is used to read PDF files. This is a risk if multiple versions of Acrobat are installed on the system and the other version has dissimilar security configurations or known vulnerabilities. When the Default PDF Handler is disabled, the end users will not be able to change the default PDF viewer.",
      "severity": "low"
    },
    {
      "id": "V-80139",
      "title": "Adobe Acrobat Pro DC Classic must disable the ability to store files on Acrobat.com.",
      "description": "Adobe Acrobat Pro DC provides the ability to store PDF files on Adobe.com servers. Allowing users to store files on non-DoD systems introduces risk of data compromise.",
      "severity": "medium"
    },
    {
      "id": "V-80141",
      "title": "Adobe Acrobat Pro DC Classic Cloud Synchronization must be disabled.",
      "description": "By default, Adobe online services are tightly integrated in Adobe Acrobat. When the Adobe Cloud synchronization is disabled it prevents the synchronization of desktop preferences across devices on which the user is signed in with an Adobe ID (including phones).",
      "severity": "medium"
    },
    {
      "id": "V-80143",
      "title": "Adobe Acrobat Pro DC Classic Repair Installation must be disabled.",
      "description": "When Repair Installation is disabled the user does not have the option (Help Menu) or ability to repair an Adobe Acrobat Pro DC install. Ability to repair includes the risk that established security settings could be overwritten.",
      "severity": "low"
    },
    {
      "id": "V-80145",
      "title": "Adobe Acrobat Pro DC Classic third-party web connectors must be disabled.",
      "description": "Third-party connectors include services such as Dropbox and Google Drive. When third-party web connectors are disabled, it prevents access to third-party services for file storage. Allowing access to online storage services introduces the risk of data loss or data exfiltration.",
      "severity": "low"
    },
    {
      "id": "V-80147",
      "title": "Adobe Acrobat Pro DC Classic Webmail must be disabled.",
      "description": "Acrobat Pro DC provides a Webmail capability. This allows users to send PDFs as email attachments using any mail account that supports SMTP/IMAP protocols. In addition to existing desktop email clients, users can now configure these mail accounts by providing User Name, Password, IMAP and SMTP details. The capability allows users to utilize Gmail and Yahoo mail accounts to send PDF files directly from within the Acrobat application. This capability allows the user to by-pass existing email protections provided by DoD email services.",
      "severity": "low"
    },
    {
      "id": "V-80149",
      "title": "The Adobe Acrobat Pro DC Classic Welcome Screen must be disabled.",
      "description": "The Adobe Welcome screen can be distracting. It provides marketing material and also has online links to the Adobe quick tips website, tutorials, blogs, and community forums. When the Adobe Welcome screen is disabled, the Welcome screen will not be populated on application startup.",
      "severity": "low"
    },
    {
      "id": "V-80151",
      "title": "Adobe Acrobat Pro DC Classic SharePoint and Office365 access must be disabled.",
      "description": "Both SharePoint and Office365 configurations are shared in one setting. Disabling this setting removes the user's ability to use both SharePoint and Office365 cloud features and functions. If the user is allowed to store files on public cloud services, there is a risk of data compromise.",
      "severity": "low"
    },
    {
      "id": "V-80153",
      "title": "Adobe Acrobat Pro DC Classic Periodic downloading of Adobe certificates must be disabled.",
      "description": "By default, the user can update Adobe certificates from an Adobe server through the GUI. When updating Adobe certificates is disabled, it prevents the automatic download and installation of certificates and disables and locks the end user's ability to download those certificates.",
      "severity": "low"
    },
    {
      "id": "V-80155",
      "title": "Adobe Acrobat Pro DC Classic privileged host locations must be disabled.",
      "description": "Privileged Locations are the primary method Acrobat uses to allow users and admins to specify trusted content that should be exempt from security restrictions, such as when Enhanced Security is enabled.  A Privileged Location may be a file, folder, or a host. If the user is allowed to set a Privileged Location, they could bypass security protections.",
      "severity": "low"
    }
  ]
}