{
  "name": "stig_ibm_aix_7.x",
  "date": "2020-02-24",
  "description": "This Security Technical Implementation Guide is published as a tool to improve the security of Department of Defense (DoD) information systems. The requirements are derived from the National Institute of Standards and Technology (NIST) 800-53 and related documents. Comments or proposed revisions to this document should be sent via email to the following address: disa.stig_spt@mail.mil.",
  "title": "IBM AIX 7.x Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-100005",
      "title": "AIX must be configured so that the audit system takes appropriate action when the audit storage volume is full.",
      "description": "Taking appropriate action in case of a filled audit storage volume will minimize the possibility of losing audit records.",
      "severity": "medium"
    },
    {
      "id": "V-91211",
      "title": "The shipped /etc/security/mkuser.sys file on AIX must not be customized directly.",
      "description": "The \"/etc/security/mkuser.sys\" script customizes the new user account when a new user is created, or a user is logging into the system without a home directory. An improper \"/etc/security/mkuser.sys\" script increases the risk that non-privileged users may obtain elevated privileges.",
      "severity": "medium"
    },
    {
      "id": "V-91213",
      "title": "AIX /etc/security/mkuser.sys.custom file must not exist unless it is needed for customizing a new user account.",
      "description": "The \"/etc/security/mkuser.sys.custom\" is called by \"/etc/security/mkuser.sys\" to customize the new user account when a new user is created, or a user is logging into the system without a home directory. An improper \"/etc/security/mkuser.sys.custom\" script increases the risk that non-privileged users may obtain elevated privileges. It must not exist unless it is needed.",
      "severity": "medium"
    },
    {
      "id": "V-91215",
      "title": "The regular users default primary group must be staff (or equivalent) on AIX.",
      "description": "The /usr/lib/security/mkuser.default file contains the default primary groups for regular and admin users. Setting a system group as the regular users' primary group increases the risk that the regular users can access privileged resources.",
      "severity": "medium"
    },
    {
      "id": "V-91217",
      "title": "AIX must automatically remove or disable temporary user accounts after 72 hours or sooner.",
      "description": "If temporary user accounts remain active when no longer needed or for an excessive period, these accounts may be used to gain unauthorized access. To mitigate this risk, automated termination of all temporary accounts must be set upon account creation.\n\nTemporary accounts are established as part of normal account activation procedures when there is a need for short-term accounts without the demand for immediacy in account activation.\n\nIf temporary accounts are used, the operating system must be configured to automatically terminate these types of accounts after a DoD-defined time period of 72 hours.\n\nTo address access requirements, many operating systems may be integrated with enterprise-level authentication/access mechanisms that meet or exceed access control policy requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91219",
      "title": "AIX must enforce the limit of three consecutive invalid login attempts by a user before the user account is locked and released by an administrator.",
      "description": "By limiting the number of failed login attempts, the risk of unauthorized system access via user password guessing, otherwise known as brute-force attacks, is reduced. Limits are imposed by locking the account.\n\nSatisfies: SRG-OS-000021-GPOS-00005, SRG-OS-000329-GPOS-00128",
      "severity": "medium"
    },
    {
      "id": "V-91221",
      "title": "AIX must display the Standard Mandatory DoD Notice and Consent Banner before granting local or remote login access to the system.",
      "description": "Display of a standardized and approved use notification before granting access to the operating system ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance.\n\nSystem use notifications are required only for access via login interfaces with human users and are not required when such human interfaces do not exist.\n\nThe banner must be formatted in accordance with applicable DoD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"\n\nUse the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner:\n\n\"I've read & consent to terms in IS user agreem't.\"",
      "severity": "medium"
    },
    {
      "id": "V-91223",
      "title": "The Department of Defense (DoD) login banner must be displayed immediately prior to, or as part of, graphical desktop environment login prompts on AIX.",
      "description": "Display of a standardized and approved use notification before granting access to the operating system ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance.\n\nSystem use notifications are required only for access via login interfaces with human users and are not required when such human interfaces do not exist.\n\nThe banner must be formatted in accordance with applicable DoD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"\n\nUse the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner:\n\n\"I've read & consent to terms in IS user agreem't.\"",
      "severity": "medium"
    },
    {
      "id": "V-91225",
      "title": "The Department of Defense (DoD) login banner must be displayed during SSH, sftp, and scp login sessions on AIX.",
      "description": "Display of a standardized and approved use notification before granting access to the operating system ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance.\n\nSystem use notifications are required only for access via login interfaces with human users and are not required when such human interfaces do not exist.\n\nThe banner must be formatted in accordance with applicable DoD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"\n\nUse the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner:\n\n\"I've read & consent to terms in IS user agreem't.\"",
      "severity": "medium"
    },
    {
      "id": "V-91227",
      "title": "AIX must limit the number of concurrent sessions to 10 for all accounts and/or account types.",
      "description": "Operating system management includes the ability to control the number of users and user sessions that utilize an operating system. Limiting the number of allowed users and sessions per user is helpful in reducing the risks related to DoS attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91229",
      "title": "AIX must provide the lock command to let users retain their session lock until users are reauthenticated.",
      "description": "All systems are vulnerable if terminals are left logged in and unattended. Leaving system terminals unsecure poses a potential security hazard. \n\nTo lock the terminal, use the lock command.",
      "severity": "medium"
    },
    {
      "id": "V-91231",
      "title": "AIX must provide xlock command in the CDE environment to let users retain their sessions lock until users are reauthenticated.",
      "description": "All systems are vulnerable if terminals are left logged in and unattended. Leaving system terminals unsecure poses a potential security hazard.\n\nIf the interface is AIXwindows (CDE), use the xlock command to lock the sessions.",
      "severity": "medium"
    },
    {
      "id": "V-91233",
      "title": "AIX must automatically lock after 15 minutes of inactivity in the CDE Graphical desktop environment.",
      "description": "A session time-out lock is a temporary action taken when a user stops work and moves away from the immediate physical vicinity of the information system but does not log out because of the temporary nature of the absence. Rather than relying on the user to manually lock their operating system session prior to vacating the vicinity, operating systems need to be able to identify when a user's session has idled and take action to initiate the session lock.\n\nThe session lock is implemented at the point where session activity can be determined and/or controlled.",
      "severity": "medium"
    },
    {
      "id": "V-91235",
      "title": "AIX must be configured to allow users to directly initiate a session lock for all connection types.",
      "description": "A session lock is a temporary action taken when a user stops work and moves away from the immediate physical vicinity of the information system but does not want to log out because of the temporary nature of the absence.\n\nThe session lock is implemented at the point where session activity can be determined. Rather than be forced to wait for a period of time to expire before the user session can be locked, operating systems need to provide users with the ability to manually invoke a session lock so users may secure their session should the need arise for them to temporarily vacate the immediate physical vicinity.",
      "severity": "medium"
    },
    {
      "id": "V-91237",
      "title": "AIX CDE must conceal, via the session lock, information previously visible on the display with a publicly viewable image.",
      "description": "A session lock is a temporary action taken when a user stops work and moves away from the immediate physical vicinity of the information system but does not log out because of the temporary nature of the absence.\n\nThe session lock is implemented at the point where session activity can be determined. The operating system session lock event must include an obfuscation of the display screen so as to prevent other users from reading what was previously displayed.\n\nPublicly viewable images can include static or dynamic images, for example, patterns used with screen savers, photographic images, solid colors, a clock, a battery life indicator, or a blank screen, with the additional caveat that none of the images convey sensitive information.",
      "severity": "medium"
    },
    {
      "id": "V-91239",
      "title": "AIX must monitor and record successful remote logins.",
      "description": "Remote access services, such as those providing remote access to network devices and information systems, which lack automated monitoring capabilities, increase risk and make remote user access management difficult at best.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nAutomated monitoring of remote access sessions allows organizations to detect cyber attacks and also ensure ongoing compliance with remote access policies by auditing connection activities of remote access capabilities, such as Remote Desktop Protocol (RDP), on a variety of information system components (e.g., servers, workstations, notebook computers, smartphones, and tablets).",
      "severity": "medium"
    },
    {
      "id": "V-91241",
      "title": "AIX must monitor and record unsuccessful remote logins.",
      "description": "Remote access services, such as those providing remote access to network devices and information systems, which lack automated monitoring capabilities, increase risk and make remote user access management difficult at best.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nAutomated monitoring of remote access sessions allows organizations to detect cyberattacks and also ensure ongoing compliance with remote access policies by auditing connection activities of remote access capabilities, such as Remote Desktop Protocol (RDP), on a variety of information system components (e.g., servers, workstations, notebook computers, smartphones, and tablets).",
      "severity": "medium"
    },
    {
      "id": "V-91243",
      "title": "The AIX SSH daemon must be configured to only use FIPS 140-2 approved ciphers.",
      "description": "Without confidentiality protection mechanisms, unauthorized individuals may gain access to sensitive information via a remote access session.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nEncryption provides a means to secure the remote connection to prevent unauthorized access to the data traversing the remote access connection (e.g., RDP), thereby providing a degree of confidentiality. The encryption strength of a mechanism is selected based on the security categorization of the information.",
      "severity": "medium"
    },
    {
      "id": "V-91245",
      "title": "The AIX SSH server must use SSH Protocol 2.",
      "description": "Without confidentiality protection mechanisms, unauthorized individuals may gain access to sensitive information via a remote access session.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nEncryption provides a means to secure the remote connection to prevent unauthorized access to the data traversing the remote access connection (e.g., RDP), thereby providing a degree of confidentiality. The encryption strength of a mechanism is selected based on the security categorization of the information.",
      "severity": "medium"
    },
    {
      "id": "V-91247",
      "title": "AIX must produce audit records containing information to establish what the date, time, and type of events that occurred.",
      "description": "Without establishing what type of events occurred, it would be difficult to establish, correlate, and investigate the events leading up to an outage or attack.\n\nAudit record content that may be necessary to satisfy this requirement includes, for example, time stamps, source and destination addresses, user/process identifiers, event descriptions, success/fail indications, filenames involved, and access control or flow control rules invoked.\n\nAssociating event types with detected events in AIX audit logs provides a means of investigating an attack; recognizing resource utilization or capacity thresholds; or identifying an improperly configured operating system.\n\nSatisfies: SRG-OS-000037-GPOS-00015, SRG-OS-000038-GPOS-00016",
      "severity": "medium"
    },
    {
      "id": "V-91249",
      "title": "AIX must produce audit records containing information to establish where the events occurred.",
      "description": "Without establishing where events occurred, it is impossible to establish, correlate, and investigate the events leading up to an outage or attack.\n\nIn order to compile an accurate risk assessment and provide forensic analysis, it is essential for security personnel to know where events occurred, such as operating system components, modules, device identifiers, node names, file names, and functionality.\n\nAssociating information about where the event occurred within AIX provides a means of investigating an attack; recognizing resource utilization or capacity thresholds; or identifying an improperly configured operating system.",
      "severity": "medium"
    },
    {
      "id": "V-91251",
      "title": "AIX must produce audit records containing information to establish the source and the identity of any individual or process associated with an event.",
      "description": "Without establishing the source of the event, it is impossible to establish, correlate, and investigate the events leading up to an outage or attack.\n\nWithout information that establishes the identity of the subjects (i.e., users or processes acting on behalf of users) associated with the events, security personnel cannot determine responsibility for the potentially harmful event.\nIn addition to logging where events occur within AIX, AIX must also generate audit records that identify sources of events. Sources of operating system events include, but are not limited to, processes and services.\n\nIn order to compile an accurate risk assessment and provide forensic analysis, it is essential for security personnel to know the source of the event.\n\nSatisfies: SRG-OS-000040-GPOS-00018, SRG-OS-000255-GPOS-00096",
      "severity": "medium"
    },
    {
      "id": "V-91253",
      "title": "AIX must produce audit records containing information to establish the outcome of the events.",
      "description": "Without information about the outcome of events, security personnel cannot make an accurate assessment as to whether an attack was successful or if changes were made to the security state of the system.\n\nEvent outcomes can include indicators of event success or failure and event-specific results (e.g., the security state of the information system after the event occurred). As such, they also provide a means to measure the impact of an event and help authorized personnel to determine the appropriate response.",
      "severity": "medium"
    },
    {
      "id": "V-91255",
      "title": "AIX must produce audit records containing the full-text recording of privileged commands.",
      "description": "Reconstruction of harmful events or forensic analysis is not possible if audit records do not contain enough information.\n\nAt a minimum, the organization must audit the full-text recording of privileged commands. The organization must maintain audit trails in sufficient detail to reconstruct events to determine the cause and impact of compromise.",
      "severity": "medium"
    },
    {
      "id": "V-91257",
      "title": "AIX must be configured to generate an audit record when 75% of the audit file system is full.",
      "description": "It is critical for the appropriate personnel to be aware if a system is at risk of failing to process audit logs as required. Without this notification, the security personnel may be unaware of an impending failure of the audit capability, and system operation may be adversely affected.\n\nAudit processing failures include software/hardware errors, failures in the audit capturing mechanisms, and audit storage capacity being reached or exceeded.\n\nThis requirement applies to each audit data storage repository (i.e., distinct information system component where audit records are stored), the centralized audit storage capacity of organizations (i.e., all audit data storage repositories combined), or both.",
      "severity": "medium"
    },
    {
      "id": "V-91259",
      "title": "AIX must provide the function to filter audit records for events of interest based upon all audit fields within audit records, support on-demand reporting requirements, and an audit reduction function that supports on-demand audit review and analysis and after-the-fact investigations of security incidents.",
      "description": "The ability to specify the event criteria that are of interest provides the individuals reviewing the logs with the ability to quickly isolate and identify these events without having to review entries that are of little or no consequence to the investigation. Without this capability, forensic investigations are impeded.\n\nEvents of interest can be identified by the content of specific audit record fields, including, for example, identities of individuals, event types, event locations, event times, event dates, system resources involved, IP addresses involved, or information objects accessed. Organizations may define audit event criteria to any degree of granularity required, for example, locations selectable by general networking location (e.g., by network or subnetwork) or selectable by specific information system component.\n\nThe ability to generate on-demand reports, including after the audit data has been subjected to audit reduction, greatly facilitates the organization's ability to generate incident reports as needed to better handle larger-scale or more complex security incidents.\n\nThe ability to perform on-demand audit review and analysis, including after the audit data has been subjected to audit reduction, greatly facilitates the organization's ability to generate incident reports, as needed, to better handle larger-scale or more complex security incidents. If the audit reduction capability does not support after-the-fact investigations, it is difficult to establish, correlate, and investigate the events leading up to an outage or attack, or identify those responses for one. This capability is also required to comply with applicable Federal laws and DoD policies.\n\nAudit reduction is a process that manipulates collected audit information and organizes such information in a summary format that is more meaningful to analysts. The report generation capability provided by the application must support on-demand (i.e., customizable, ad hoc, and as-needed) reports.\n\nThis requires operating systems to provide the capability to customize audit record reports based on all available criteria.\n\nSatisfies: SRG-OS-000054-GPOS-00025, SRG-OS-000122-GPOS-00063, SRG-OS-000348-GPOS-00136, SRG-OS-000349-GPOS-00137",
      "severity": "medium"
    },
    {
      "id": "V-91263",
      "title": "Audit logs on the AIX system must be owned by root.",
      "description": "Unauthorized disclosure of audit records can reveal system and configuration data to attackers, thus compromising its confidentiality.\n\nAudit information includes all information (e.g., audit records, audit settings, audit reports) needed to successfully audit operating system activity.\n\nSatisfies: SRG-OS-000057-GPOS-00027, SRG-OS-000058-GPOS-00028, SRG-OS-000059-GPOS-00029",
      "severity": "medium"
    },
    {
      "id": "V-91265",
      "title": "Audit logs on the AIX system must be group-owned by system.",
      "description": "Unauthorized disclosure of audit records can reveal system and configuration data to attackers, thus compromising its confidentiality.\n\nAudit information includes all information (e.g., audit records, audit settings, audit reports) needed to successfully audit operating system activity.\n\nSatisfies: SRG-OS-000057-GPOS-00027, SRG-OS-000058-GPOS-00028, SRG-OS-000059-GPOS-00029",
      "severity": "medium"
    },
    {
      "id": "V-91267",
      "title": "Audit logs on the AIX system must be set to 660 or less permissive.",
      "description": "Unauthorized disclosure of audit records can reveal system and configuration data to attackers, thus compromising its confidentiality.\n\nAudit information includes all information (e.g., audit records, audit settings, audit reports) needed to successfully audit operating system activity.\n\nSatisfies: SRG-OS-000057-GPOS-00027, SRG-OS-000058-GPOS-00028, SRG-OS-000059-GPOS-00029",
      "severity": "medium"
    },
    {
      "id": "V-91271",
      "title": "The AIX audit configuration files must be owned by root.",
      "description": "Without the capability to restrict which roles and individuals can select which events are audited, unauthorized personnel may be able to prevent the auditing of critical events. Misconfigured audits may degrade the system's performance by overwhelming the audit log. Misconfigured audits may also make it more difficult to establish, correlate, and investigate the events relating to an incident or identify those responsible for one.",
      "severity": "medium"
    },
    {
      "id": "V-91273",
      "title": "The AIX audit configuration files must be group-owned by audit.",
      "description": "Without the capability to restrict which roles and individuals can select which events are audited, unauthorized personnel may be able to prevent the auditing of critical events. Misconfigured audits may degrade the system's performance by overwhelming the audit log. Misconfigured audits may also make it more difficult to establish, correlate, and investigate the events relating to an incident or identify those responsible for one.",
      "severity": "medium"
    },
    {
      "id": "V-91275",
      "title": "The AIX audit configuration files must be set to 640 or less permissive.",
      "description": "Without the capability to restrict which roles and individuals can select which events are audited, unauthorized personnel may be able to prevent the auditing of critical events. Misconfigured audits may degrade the system's performance by overwhelming the audit log. Misconfigured audits may also make it more difficult to establish, correlate, and investigate the events relating to an incident or identify those responsible for one.",
      "severity": "medium"
    },
    {
      "id": "V-91277",
      "title": "If the AIX system is using LDAP for authentication or account information, the LDAP SSL, or TLS connection must require the server provide a certificate and this certificate must have a valid path to a trusted CA.",
      "description": "Without path validation, an informed trust decision by the relying party cannot be made when presented with any certificate not already explicitly trusted.",
      "severity": "medium"
    },
    {
      "id": "V-91279",
      "title": "AIX SSH private host key files must have mode 0600 or less permissive.",
      "description": "If the private key is discovered, an attacker can use the key to authenticate as an authorized user and gain access to the network infrastructure.\n\nThe cornerstone of the PKI is the private key used to encrypt or digitally sign information.\n\nIf the private key is stolen, this will lead to the compromise of the authentication and non-repudiation gained through PKI because the attacker can use the private key to digitally sign documents and pretend to be the authorized user.\n\nBoth the holders of a digital certificate and the issuing authority must protect the computers, storage devices, or whatever they use to keep the private keys.",
      "severity": "medium"
    },
    {
      "id": "V-91281",
      "title": "AIX must enforce password complexity by requiring that at least one upper-case character be used.",
      "description": "Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks.\n\nPassword complexity is one factor of several that determines how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised.",
      "severity": "high"
    },
    {
      "id": "V-91283",
      "title": "AIX must enforce password complexity by requiring that at least one lower-case character be used.",
      "description": "Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks.\n\nPassword complexity is one factor of several that determines how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised.",
      "severity": "high"
    },
    {
      "id": "V-91285",
      "title": "AIX must enforce password complexity by requiring that at least one numeric character be used.",
      "description": "Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks.\n\nPassword complexity is one factor of several that determines how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised.",
      "severity": "high"
    },
    {
      "id": "V-91287",
      "title": "AIX must require the change of at least 50% of the total number of characters when passwords are changed.",
      "description": "If the operating system allows the user to consecutively reuse extensive portions of passwords, this increases the chances of password compromise by increasing the window of opportunity for attempts at guessing and brute-force attacks.\n\nThe number of changed characters refers to the number of changes required with respect to the total number of positions in the current password. In other words, characters may be the same within the two passwords; however, the positions of the like characters must be different.\n\nIf the password length is an odd number then number of changed characters must be rounded up.  For example, a password length of 15 characters must require the change of at least 8 characters.",
      "severity": "high"
    },
    {
      "id": "V-91289",
      "title": "The AIX system must have no .netrc files on the system.",
      "description": "Unencrypted passwords for remote FTP servers may be stored in .netrc files. Policy requires passwords be encrypted in storage and not used in access scripts.",
      "severity": "high"
    },
    {
      "id": "V-91291",
      "title": "If AIX is using LDAP for authentication or account information, the /etc/ldap.conf file (or equivalent) must not contain passwords.",
      "description": "Passwords need to be protected at all times, and encryption is the standard method for protecting passwords. If passwords are not encrypted, they can be plainly read (i.e., clear text) and easily compromised.",
      "severity": "high"
    },
    {
      "id": "V-91293",
      "title": "AIX root passwords must never be passed over a network in clear text form.",
      "description": "Passwords need to be protected at all times, and encryption is the standard method for protecting passwords. If passwords are not encrypted, they can be plainly read (i.e., clear text) and easily compromised.",
      "severity": "high"
    },
    {
      "id": "V-91295",
      "title": "AIX must disable /usr/bin/rcp,\n/usr/bin/rlogin,\n/usr/bin/rsh, /usr/bin/rexec and /usr/bin/telnet commands.",
      "description": "The listed applications permit the transmission of passwords in plain text.  Alternative applications such as SSH, which encrypt data, should be use instead.",
      "severity": "high"
    },
    {
      "id": "V-91297",
      "title": "IF LDAP is used, AIX LDAP client must use SSL to authenticate with LDAP server.",
      "description": "While LDAP client's authentication type is ldap_auth (server-side authentication), the client sends password to the server in clear text for authentication. SSL must be used in this case.",
      "severity": "high"
    },
    {
      "id": "V-91299",
      "title": "The AIX rsh daemon must be disabled.",
      "description": "The rsh daemon permits username and passwords to be passed over the network in clear text.",
      "severity": "high"
    },
    {
      "id": "V-91301",
      "title": "The AIX rlogind service must be disabled.",
      "description": "The rlogin daemon permits username and passwords to be passed over the network in clear text.",
      "severity": "high"
    },
    {
      "id": "V-91303",
      "title": "The AIX rexec daemon must not be running.",
      "description": "The exec service is used to execute a command sent from a remote server. The username and passwords are passed over the network in clear text and therefore insecurely. Unless required the rexecd daemon will be disabled. This function, if required, should be facilitated through SSH.",
      "severity": "high"
    },
    {
      "id": "V-91305",
      "title": "AIX telnet daemon must not be running.",
      "description": "This telnet service is used to service remote user connections. This is historically the most commonly used remote access method for UNIX servers. The username and passwords are passed over the network in clear text and therefore insecurely. Unless required the telnetd daemon will be disabled. This function, if required, should be facilitated through SSH.",
      "severity": "high"
    },
    {
      "id": "V-91307",
      "title": "AIX ftpd daemon must not be running.",
      "description": "The ftp service is used to transfer files from or to a remote machine. The username and passwords are passed over the network in clear text and therefore insecurely. Remote file transfer, if required, should be facilitated through SSH.",
      "severity": "high"
    },
    {
      "id": "V-91309",
      "title": "AIX Operating systems must enforce 24 hours/1 day as the minimum password lifetime.",
      "description": "Enforcing a minimum password lifetime helps to prevent repeated password changes to defeat the password reuse or history enforcement requirement. If users are allowed to immediately and continually change their password, then the password could be repeatedly changed in a short period of time to defeat the organization's policy regarding password reuse.",
      "severity": "medium"
    },
    {
      "id": "V-91311",
      "title": "AIX Operating systems must enforce a 60-day maximum password lifetime restriction.",
      "description": "Any password, no matter how complex, can eventually be cracked. Therefore, passwords need to be changed periodically. If the operating system does not limit the lifetime of passwords and force users to change their passwords, there is the risk that the operating system passwords could be compromised.",
      "severity": "medium"
    },
    {
      "id": "V-91313",
      "title": "AIX must prohibit password reuse for a minimum of five generations.",
      "description": "Password complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. If the information system or application allows the user to consecutively reuse their password when that password has exceeded its defined lifetime, the end result is a password that is not changed as per policy requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91315",
      "title": "AIX must use Loadable Password Algorithm  (LPA) password hashing algorithm.",
      "description": "The default legacy password hashing algorithm, crypt(), uses only the first 8 characters from the password string, meaning the user's password is truncated to eight characters. If the password is shorter than 8 characters, it is padded with zero bits on the right.\n\nThe crypt() is a modified DES algorithm that is vulnerable to brute force password guessing attacks and also to cracking the DES-hashing algorithm by using techniques such as pre-computation. \n\nWith the Loadable Password Algorithm (LPA) framework release, AIX implemented a set of LPAs using MD5, SHA2, and Blowfish algorithms. These IBM proprietary password algorithms support a password longer than 8 characters and Unicode characters in passwords.",
      "severity": "high"
    },
    {
      "id": "V-91317",
      "title": "AIX must enforce a minimum 15-character password length.",
      "description": "The shorter the password, the lower the number of possible combinations that need to be tested before the password is compromised.\n\nPassword complexity, or strength, is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks. Password length is one factor of several that helps to determine strength and how long it takes to crack a password. Use of more characters in a password helps to exponentially increase the time and/or resources required to compromise the password.",
      "severity": "high"
    },
    {
      "id": "V-91319",
      "title": "AIX must turn on enhanced Role-Based Access Control (RBAC) to isolate security functions from nonsecurity functions, to grant system privileges to other operating system admins, and prohibit user installation of system software without explicit privileged status.",
      "description": "To mitigate the risk of unauthorized access to sensitive information by entities that have been issued certificates by DoD-approved PKIs, all DoD systems (e.g., web servers and web portals) must be properly configured to incorporate access control methods that do not rely solely on the possession of a certificate for access. Successful authentication must not automatically give an entity access to an asset or security boundary. Authorization procedures and controls must be implemented to ensure each authenticated entity also has a validated and current authorization. Authorization is the process of determining whether an entity, once authenticated, is permitted to access a specific asset. Information systems use access control policies and enforcement mechanisms to implement this requirement.\n\nAccess control policies include: identity-based policies, role-based policies, and attribute-based policies. Access enforcement mechanisms include: access control lists, access control matrices, and cryptography. These policies and mechanisms must be employed by the application to control access between users (or processes acting on behalf of users) and objects (e.g., devices, files, records, processes, programs, and domains) in the information system.\n\nSecurity functions are the hardware, software, and/or firmware of the information system responsible for enforcing the system security policy and supporting the isolation of code and data on which the protection is based. Operating systems implement code separation (i.e., separation of security functions from nonsecurity functions) in a number of ways, including through the provision of security kernels via processor rings or processor modes. For non-kernel code, security function isolation is often achieved through file system protections that serve to protect the code on disk and address space protections that protect executing code.\n\nDiscretionary Access Control (DAC) is based on the notion that individual users are \"owners\" of objects and therefore have discretion over who should be authorized to access the object and in which mode (e.g., read or write). Ownership is usually acquired as a consequence of creating the object or via specified ownership assignment. DAC allows the owner to determine who will have access to objects they control. An example of DAC includes user-controlled file permissions.\n\nOperating system functionality will vary, and while users are not permitted to install unapproved software, there may be instances where the organization allows the user to install approved software packages, such as from an approved software repository.\n\nAIX or software configuration management utility must enforce control of software installation by users based upon what types of software installations are permitted (e.g., updates and security patches to existing software) and what types of installations are prohibited (e.g., software whose pedigree with regard to being potentially malicious is unknown or suspect) by the organization.\n\nSatisfies: SRG-OS-000080-GPOS-00048, SRG-OS-000134-GPOS-00068, SRG-OS-000312-GPOS-00123, SRG-OS-000362-GPOS-00149",
      "severity": "medium"
    },
    {
      "id": "V-91321",
      "title": "The AIX qdaemon must be disabled if local or remote printing is not required.",
      "description": "The qdaemon program is the printing scheduling daemon that manages the submission of print jobs to the piobe service.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91323",
      "title": "If AIX system does not act as a remote print server for other servers, the lpd daemon must be disabled.",
      "description": "The lpd daemon accepts remote print jobs from other systems.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91325",
      "title": "If AIX system does not support either local or remote printing, the piobe service must be disabled.",
      "description": "The piobe daemon is the I/O back end for the printing process, handling the job scheduling and spooling.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91327",
      "title": "If there are no X11 clients that require CDE on AIX, the dt service must be disabled.",
      "description": "This entry executes the CDE startup script which starts the AIX Common Desktop Environment.\n\nTo prevent attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91329",
      "title": "If NFS is not required on AIX, the NFS daemon must be disabled.",
      "description": "The rcnfs entry starts the NFS daemons during system boot.\n\nNFS is a service with numerous historical vulnerabilities and should not be enabled unless there is no alternative. If NFS serving is required, then read-only exports are recommended and no filesystem or directory should be exported with root access. Unless otherwise required the NFS daemons (rcnfs) will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-91331",
      "title": "If sendmail is not required on AIX, the sendmail service must be disabled.",
      "description": "The sendmail service has many historical vulnerabilities and, where possible, should be disabled. If the system is not required to operate as a mail server i.e. sending, receiving or processing e-mail, disable the sendmail daemon.",
      "severity": "medium"
    },
    {
      "id": "V-91333",
      "title": "If SNMP is not required on AIX, the snmpd service must be disabled.",
      "description": "The snmpd daemon is used by many 3rd party applications to monitor the health of the system. This allows remote monitoring of network and server configuration.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91335",
      "title": "The AIX DHCP client must be disabled.",
      "description": "The dhcpcd daemon receives address and configuration information from the DHCP server. DHCP relies on trusting the local network. If the local network is not trusted, then it should not be used.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.\n\nSatisfies: SRG-OS-000095-GPOS-00049, SRG-OS-000480-GPOS-00227",
      "severity": "medium"
    },
    {
      "id": "V-91337",
      "title": "If DHCP is not enabled in the network on AIX, the dhcprd daemon must be disabled.",
      "description": "The dhcprd daemon listens for broadcast packets, receives them, and forwards them to the appropriate server.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91339",
      "title": "If DHCP server is not required on AIX, the DHCP server must be disabled.",
      "description": "The dhcpsd daemon is the DHCP server that serves addresses and configuration information to DHCP clients in the network.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91341",
      "title": "If IPv6 is not utilized on AIX server, the autoconf6 daemon must be disabled.",
      "description": "\"autoconf6\" is used to automatically configure IPv6 interfaces at boot time. Running this service may allow other hosts on the same physical subnet to connect via IPv6, even when the network does not support it. Disable this unless you use IPv6 on the server.",
      "severity": "medium"
    },
    {
      "id": "V-91343",
      "title": "If AIX server is not functioning as a network router, the gated daemon must be disabled.",
      "description": "This daemon provides gateway routing functions for protocols such as RIP and SNMP.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91345",
      "title": "If AIX server is not functioning as a multicast router, the mrouted daemon must be disabled.",
      "description": "This daemon is an implementation of the multicast routing protocol.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91347",
      "title": "If AIX server is not functioning as a DNS server, the named daemon must be disabled.",
      "description": "This is the server for the DNS protocol and controls domain name resolution for its clients.\n\nTo prevent attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91349",
      "title": "If AIX server is not functioning as a network router, the routed daemon must be disabled.",
      "description": "The routed daemon manages the network routing tables in the kernel.\n\nTo prevent attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91351",
      "title": "If rwhod is not required on AIX, the rwhod daemon must be disabled.",
      "description": "This is the remote WHO service.\n\nTo prevent remote attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91353",
      "title": "The timed daemon must be disabled on AIX.",
      "description": "This is the old UNIX time service.\n\nThe timed daemon is the old UNIX time service. Disable this service and use xntp, if time synchronization is required in the environment.",
      "severity": "medium"
    },
    {
      "id": "V-91355",
      "title": "If AIX server does not host an SNMP agent, the dpid2 daemon must be disabled.",
      "description": "The dpid2 daemon acts as a protocol converter, which enables DPI (SNMP v2) sub-agents, such as hostmibd, to talk to a SNMP v1 agent that follows SNMP MUX protocol.\n\nTo prevent attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91359",
      "title": "If SNMP is not required on AIX, the snmpmibd daemon must be disabled.",
      "description": "The snmpmibd daemon is a dpi2 sub-agent which manages a number of MIB variables. If snmpd is not required, it is recommended that it is disabled.",
      "severity": "medium"
    },
    {
      "id": "V-91361",
      "title": "The aixmibd daemon must be disabled on AIX.",
      "description": "The aixmibd daemon is a dpi2 sub-agent which manages a number of MIB variables. \n\nTo prevent attacks this daemon should not be enabled unless there is no alternative.",
      "severity": "medium"
    },
    {
      "id": "V-91363",
      "title": "The ndpd-host daemon must be disabled on AIX.",
      "description": "This is the Neighbor Discovery Protocol (NDP) daemon, required in IPv6.\n\nThe ndpd-host is the NDP daemon for the server. Unless the server utilizes IPv6, this is not required and should be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91365",
      "title": "The ndpd-router must be disabled on AIX.",
      "description": "This manages the Neighbor Discovery Protocol (NDP) for non-kernel activities, required in IPv6.\n\nThe ndpd-router manages NDP for non-kernel activities. Unless the server utilizes IPv6, this is not required and should be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91367",
      "title": "The daytime daemon must be disabled on AIX.",
      "description": "The daytime service provides the current date and time to other servers on a network.\n\nThis daytime service is a defunct time service, typically used for testing purposes only. The service should be disabled as it can leave the system vulnerable to DoS ping attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91369",
      "title": "The cmsd daemon must be disabled on AIX.",
      "description": "This is a calendar and appointment service for CDE.\n\nThe cmsd service is utilized by CDE to provide calendar functionality. If CDE is not required, this service should be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91371",
      "title": "The ttdbserver daemon must be disabled on AIX.",
      "description": "The ttdbserver service is the tool-talk database service for CDE. This service runs as root and should be disabled. Unless required the ttdbserver service will be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91373",
      "title": "The uucp (UNIX to UNIX Copy Program) daemon must be disabled on AIX.",
      "description": "This service facilitates file copying between networked servers.\n\nThe uucp (UNIX to UNIX Copy Program), service allows users to copy files between networked machines. Unless an application or process requires UUCP this should be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91375",
      "title": "The time daemon must be disabled on AIX.",
      "description": "This service can be used to synchronize system clocks.\n\nThe time service is an obsolete process used to synchronize system clocks at boot time. This has been superseded by NTP, which should be used if time synchronization is necessary. Unless required the time service must be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-91377",
      "title": "The talk daemon must be disabled on AIX.",
      "description": "This talk service is used to establish an interactive two-way communication link between two UNIX users. Unless required the talk service will be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91379",
      "title": "The ntalk daemon must be disabled on AIX.",
      "description": "This service establishes a two-way communication link between two users, either locally or remotely. Unless required the ntalk service will be disabled to prevent attacks.",
      "severity": "high"
    },
    {
      "id": "V-91381",
      "title": "The chargen daemon must be disabled on AIX.",
      "description": "This service is used to test the integrity of TCP/IP packets arriving at the destination.\n\nThis chargen service is a character generator service and is used for testing the integrity of TCP/IP packets arriving at the destination. An attacker may spoof packets between machines running the chargen service and thus provide an opportunity for DoS attacks. Disable this service to prevent attacks unless testing the network.",
      "severity": "medium"
    },
    {
      "id": "V-91383",
      "title": "The discard daemon must be disabled on AIX.",
      "description": "The discard service is used as a debugging and measurement tool. It sets up a listening socket and ignores data that it receives. This is a /dev/null service and is obsolete. This can be used in DoS attacks and therefore, must be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91385",
      "title": "The dtspc daemon must be disabled on AIX.",
      "description": "The dtspc service deals with the CDE interface of the X11 daemon. It is started automatically by the inetd daemon in response to a CDE client requesting a process to be started on the daemon's host. This makes it vulnerable to buffer overflow attacks, which may allow an attacker to gain root privileges on a host. This service must be disabled unless it is absolutely required.",
      "severity": "medium"
    },
    {
      "id": "V-91387",
      "title": "The pcnfsd daemon must be disabled on AIX.",
      "description": "The pcnfsd service is an authentication and printing program, which uses NFS to provide file transfer services. This service is vulnerable and exploitable and permits the machine to be compromised both locally and remotely. If PC NFS clients are required within the environment, Samba is recommended as an alternative software solution. The pcnfsd daemon predates Microsoft's release of SMB specifications. This service should therefore be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91389",
      "title": "The rstatd daemon must be disabled on AIX.",
      "description": "The rstatd service is used to provide kernel statistics and other monitorable parameters pertinent to the system such as: CPU usage, system uptime, network usage etc. An attacker may use this information in a DoS attack. This service should be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-91391",
      "title": "The rusersd daemon must be disabled on AIX.",
      "description": "The rusersd service runs as root and provides a list of current users active on a system. An attacker may use this service to learn valid account names on the system. This is not an essential service and should be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-91393",
      "title": "The rwalld daemon must be disabled on AIX.",
      "description": "The rwalld service allows remote users to broadcast system wide messages. The service runs as root and should be disabled unless absolutely necessary to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91395",
      "title": "The sprayd daemon must be disabled on AIX.",
      "description": "The sprayd service is used as a tool to generate UDP packets for testing and diagnosing network problems. The service must be disabled if NFS is not in use, as it can be used by attackers in a Distributed Denial of Service (DDoS) attack.",
      "severity": "medium"
    },
    {
      "id": "V-91397",
      "title": "The klogin daemon must be disabled on AIX.",
      "description": "The klogin service offers a higher degree of security than traditional rlogin or telnet by eliminating most clear-text password exchanges on the network. However, it is still not as secure as SSH, which encrypts all traffic. If using klogin to log in to a system, the password is not sent in clear text; however, if using \"su\" to another user, that password exchange is open to detection from network-sniffing programs. The recommendation is to use SSH wherever possible instead of klogin.\n\nIf the klogin service is used, use the latest Kerberos version available and make sure that all the latest patches are installed.",
      "severity": "medium"
    },
    {
      "id": "V-91399",
      "title": "The kshell daemon must be disabled on AIX.",
      "description": "The kshell service offers a higher degree of security than traditional rsh services. However, it still does not use encrypted communications. The recommendation is to use SSH wherever possible instead of kshell.\n\nIf the kshell service is used, you should use the latest Kerberos version available and must make sure that all the latest patches are installed.",
      "severity": "medium"
    },
    {
      "id": "V-91401",
      "title": "The rquotad daemon must be disabled on AIX.",
      "description": "The rquotad service allows NFS clients to enforce disk quotas on file systems that are mounted on the local system. This service should be disabled if to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91403",
      "title": "The tftp daemon must be disabled on AIX.",
      "description": "The tftp service allows remote systems to download or upload files to the tftp server without any authentication. It is therefore a service that should not run, unless needed. One of the main reasons for requiring this service to be activated is if the host is a NIM master. However, the service can be enabled and then disabled once a NIM operation has completed, rather than left running permanently.",
      "severity": "medium"
    },
    {
      "id": "V-91405",
      "title": "The imap2 service must be disabled on AIX.",
      "description": "The imap2 service or Internet Message Access Protocol (IMAP) supports the IMAP4 remote mail access protocol. It works with sendmail and bellmail. This service should be disabled if it is not required to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91407",
      "title": "The pop3 daemon must be disabled on AIX.",
      "description": "The pop3 service provides a pop3 server. It supports the pop3 remote mail access protocol. It works with sendmail and bellmail. This service should be disabled if it is not required to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91409",
      "title": "The finger daemon must be disabled on AIX.",
      "description": "The fingerd daemon provides the server function for the finger command. This allows users to view real-time pertinent user login information on other remote systems. This service should be disabled as it may provide an attacker with a valid user list to target.",
      "severity": "medium"
    },
    {
      "id": "V-91411",
      "title": "The instsrv daemon must be disabled on AIX.",
      "description": "The instsrv service is part of the Network Installation Tools, used for servicing servers running AIX 3.2. This service should be disabled to prevent attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91413",
      "title": "The echo daemon must be disabled on AIX.",
      "description": "The echo service can be used in Denial of Service or SMURF attacks. It can also be used by someone else to get through a firewall or start a data storm. The echo service is unnecessary and it increases the attack vector of the system.",
      "severity": "medium"
    },
    {
      "id": "V-91415",
      "title": "The Internet Network News (INN) server must be disabled on AIX.",
      "description": "Internet Network News (INN) servers access Usenet newsfeeds and store newsgroup articles. INN servers use the Network News Transfer Protocol (NNTP) to transfer information from the Usenet to the server and from the server to authorized remote hosts. \n\nIf this function is necessary to support a valid mission requirement, its use must be authorized and approved in the system accreditation package.",
      "severity": "medium"
    },
    {
      "id": "V-91417",
      "title": "If Stream Control Transmission Protocol (SCTP) must be disabled on AIX.",
      "description": "The Stream Control Transmission Protocol (SCTP) is an IETF-standardized transport layer protocol. This protocol is not yet widely used. Binding this protocol to the network stack increases the attack surface of the host. Unprivileged local processes may be able to cause the system to dynamically load a protocol handler by opening a socket using the protocol.",
      "severity": "medium"
    },
    {
      "id": "V-91419",
      "title": "The Reliable Datagram Sockets (RDS) protocol must be disabled on AIX.",
      "description": "The Reliable Datagram Sockets (RDS) protocol is a relatively new protocol developed by Oracle for communication between the nodes of a cluster. Binding this protocol to the network stack increases the attack surface of the host. Unprivileged local processes may be able to cause the system to dynamically load a protocol handler by opening a socket using the protocol.\n\nAIX has RDS protocol installed as part of the 'bos.net.tcp.client' fileset. The RDS protocol in primarily used for communication on INFI-Band interfaces. The protocol is manually loaded with the bypassctrl command.\n\nTo prevent possible attacks this protocol must be disabled unless required.",
      "severity": "medium"
    },
    {
      "id": "V-91421",
      "title": "All accounts on AIX system must have unique account names.",
      "description": "To assure accountability and prevent unauthenticated access, organizational users must be identified and authenticated to prevent potential misuse and compromise of the system.\n\nOrganizational users include organizational employees or individuals the organization deems to have equivalent status of employees (e.g., contractors). Organizational users (and processes acting on behalf of users) must be uniquely identified and authenticated to all accesses, except for the following: \n\n1) Accesses explicitly identified and documented by the organization. Organizations document specific user actions that can be performed on the information system without identification or authentication; and\n\n2) Accesses that occur through authorized use of group authenticators without individual authentication. Organizations may require unique identification of individuals in group accounts (e.g., shared privilege accounts) or for detailed accountability of individual activity.",
      "severity": "high"
    },
    {
      "id": "V-91423",
      "title": "All accounts on AIX must be assigned unique User Identification Numbers (UIDs) and must authenticate organizational and non-organizational users (or processes acting on behalf of these users).",
      "description": "To assure accountability and prevent unauthenticated access, organizational users must be identified and authenticated to prevent potential misuse and compromise of the system.\n\nLack of authentication and identification enables non-organizational users to gain access to the application or possibly other information systems and provides an opportunity for intruders to compromise resources within the application or information system.\n\nOrganizational users include organizational employees or individuals the organization deems to have equivalent status of employees (e.g., contractors). Organizational users (and processes acting on behalf of users) must be uniquely identified and authenticated to all accesses, except for the following: \n\n1) Accesses explicitly identified and documented by the organization. Organizations document specific user actions that can be performed on the information system without identification or authentication; and\n\n2) Accesses that occur through authorized use of group authenticators without individual authentication. Organizations may require unique identification of individuals in group accounts (e.g., shared privilege accounts) or for detailed accountability of individual activity.\n\nSatisfies: SRG-OS-000104-GPOS-00051, SRG-OS-000121-GPOS-00062",
      "severity": "high"
    },
    {
      "id": "V-91425",
      "title": "The AIX SYSTEM attribute must not be set to NONE for any account.",
      "description": "To assure accountability and prevent unauthenticated access, organizational users must be identified and authenticated to prevent potential misuse and compromise of the system.\n\nOrganizational users include organizational employees or individuals the organization deems to have equivalent status of employees (e.g., contractors). Organizational users (and processes acting on behalf of users) must be uniquely identified and authenticated to all accesses, except for the following: \n\n1) Accesses explicitly identified and documented by the organization. Organizations document specific user actions that can be performed on the information system without identification or authentication; and\n\n2) Accesses that occur through authorized use of group authenticators without individual authentication. Organizations may require unique identification of individuals in group accounts (e.g., shared privilege accounts) or for detailed accountability of individual activity.",
      "severity": "high"
    },
    {
      "id": "V-91427",
      "title": "Direct logins to the AIX system must not be permitted to shared accounts, default accounts, application accounts, and utility accounts.",
      "description": "Shared accounts (accounts where two or more people log in with the same user identification) do not provide identification and authentication. There is no way to provide for non-repudiation or individual accountability.",
      "severity": "medium"
    },
    {
      "id": "V-91429",
      "title": "AIX must use the SSH server to implement replay-resistant authentication mechanisms for network access to privileged and non-privileged accounts.",
      "description": "A replay attack may enable an unauthorized user to gain access to the operating system. Authentication sessions between the authenticator and the operating system validating the user credentials must not be vulnerable to a replay attack.\n\nAn authentication process resists replay attacks if it is impractical to achieve a successful authentication by recording and replaying a previous authentication message.\n\nA privileged account is any information system account with authorizations of a privileged user.\n\nTechniques used to address this include protocols using nonces (e.g., numbers generated for a specific one-time use) or challenges (e.g., TLS, WS_Security). Additional techniques include time-synchronous or challenge-response one-time authenticators.\n\nSatisfies: SRG-OS-000112-GPOS-00057, SRG-OS-000113-GPOS-00058",
      "severity": "high"
    },
    {
      "id": "V-91437",
      "title": "The AIX system must automatically remove or disable emergency accounts after the crisis is resolved or 72 hours.",
      "description": "Emergency accounts are privileged accounts that are established in response to crisis situations where the need for rapid account activation is required. Therefore, emergency account activation may bypass normal account authorization processes. If these accounts are automatically disabled, system maintenance during emergencies may not be possible, thus adversely affecting system availability. \n\nEmergency accounts are different from infrequently used accounts (i.e., local login accounts used by the organization's system administrators when network or normal login/access is not available). Infrequently used accounts are not subject to automatic termination dates.  Emergency accounts are accounts created in response to crisis situations, usually for use by maintenance personnel. The automatic expiration or disabling time period may be extended as needed until the crisis is resolved; however, it must not be extended indefinitely. A permanent account should be established for privileged users who need long-term maintenance accounts.\n\nTo address access requirements, many operating systems can be integrated with enterprise-level authentication/access mechanisms that meet or exceed access control policy requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91439",
      "title": "AIX must employ strong authenticators in the establishment of nonlocal maintenance and diagnostic sessions.",
      "description": "If maintenance tools are used by unauthorized personnel, they may accidentally or intentionally damage or compromise the system. The act of managing systems and applications includes the ability to access sensitive application information, such as system configuration details, diagnostic information, user information, and potentially sensitive application data.\n\nSome maintenance and test tools are either standalone devices with their own operating systems or are applications bundled with an operating system.\n\nNonlocal maintenance and diagnostic activities are those activities conducted by individuals communicating through a network, either an external network (e.g., the Internet) or an internal network. Local maintenance and diagnostic activities are those activities carried out by individuals physically present at the information system or information system component and not communicating across a network connection. Typically, strong authentication requires authenticators that are resistant to replay attacks and employ multifactor authentication. Strong authenticators include, for example, PKI where certificates are stored on a token protected by a password, passphrase, or biometric.",
      "severity": "high"
    },
    {
      "id": "V-91443",
      "title": "AIX must set Stack Execution Disable (SED) system wide mode to all.",
      "description": "DoS is a condition when a resource is not available for legitimate users. When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity. \n\nManaging excess capacity ensures that sufficient capacity is available to counter flooding attacks. Employing increased capacity and service redundancy may reduce the susceptibility to some DoS attacks. Managing excess capacity may include, for example, establishing selected usage priorities, quotas, or partitioning.\n\nSatisfies: SRG-OS-000142-GPOS-00071, SRG-OS-000480-GPOS-00227, SRG-OS-000433-GPOS-00192",
      "severity": "medium"
    },
    {
      "id": "V-91447",
      "title": "AIX must terminate all SSH login sessions after 10 minutes of inactivity.",
      "description": "Terminating an idle session within a short time period reduces the window of opportunity for unauthorized personnel to take control of a management session enabled on the console or console port that has been left unattended. In addition, quickly terminating an idle session will also free up resources committed by the managed network element. \n\nTerminating network connections associated with communications sessions includes, for example, de-allocating associated TCP/IP address/port pairs at AIX level, and de-allocating networking assignments at the application level if multiple application sessions are using a single operating system-level network connection. This does not mean that AIX terminates all sessions or network access; it only ends the inactive session and releases the resources associated with that session.",
      "severity": "medium"
    },
    {
      "id": "V-91449",
      "title": "AIX must protect the confidentiality and integrity of all information at rest.",
      "description": "Information at rest refers to the state of information when it is located on a secondary storage device (e.g., disk drive and tape drive, when used for backups) within an operating system.\n\nThis requirement addresses protection of user-generated data, as well as operating system-specific configuration data. Organizations may choose to employ different mechanisms to achieve confidentiality and integrity protections, as appropriate, in accordance with the security category and/or classification of the information.",
      "severity": "medium"
    },
    {
      "id": "V-91451",
      "title": "AIX log files must have mode 0640 or less permissive.",
      "description": "Only authorized personnel should be aware of errors and the details of the errors. Error messages are an indicator of an organization's operational state or can identify AIX or platform. Additionally, Personally Identifiable Information (PII) and operational information must not be revealed through error messages to unauthorized personnel or their designated representatives.\n\nThe structure and content of error messages must be carefully considered by the organization and development team. The extent to which the information system is able to identify and handle error conditions is guided by organizational policy and operational requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91453",
      "title": "AIX log files must be owned by root.",
      "description": "Only authorized personnel should be aware of errors and the details of the errors. Error messages are an indicator of an organization's operational state or can identify AIX or platform. Additionally, Personally Identifiable Information (PII) and operational information must not be revealed through error messages to unauthorized personnel or their designated representatives.\n\nThe structure and content of error messages must be carefully considered by the organization and development team. The extent to which the information system is able to identify and handle error conditions is guided by organizational policy and operational requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91455",
      "title": "AIX log files must be owned by privileged groups.",
      "description": "Only authorized personnel should be aware of errors and the details of the errors. Error messages are an indicator of an organization's operational state or can identify AIX or platform. Additionally, Personally Identifiable Information (PII) and operational information must not be revealed through error messages to unauthorized personnel or their designated representatives.\n\nThe structure and content of error messages must be carefully considered by the organization and development team. The extent to which the information system is able to identify and handle error conditions is guided by organizational policy and operational requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91457",
      "title": "AIX log files must not have extended ACLs, except as needed to support authorized software.",
      "description": "Only authorized personnel should be aware of errors and the details of the errors. Error messages are an indicator of an organization's operational state or can identify AIX or platform. Additionally, Personally Identifiable Information (PII) and operational information must not be revealed through error messages to unauthorized personnel or their designated representatives.\n\nThe structure and content of error messages must be carefully considered by the organization and development team. The extent to which the information system is able to identify and handle error conditions is guided by organizational policy and operational requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91459",
      "title": "Any publically accessible connection to AIX operating system must display the Standard Mandatory DoD Notice and Consent Banner before granting access to the system.",
      "description": "Display of a standardized and approved use notification before granting access to the publicly accessible operating system ensures privacy and security notification verbiage used is consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance.\n\nSystem use notifications are required only for access via login interfaces with human users and are not required when such human interfaces do not exist.\n\nThe banner must be formatted in accordance with applicable DoD policy. Use the following verbiage for operating systems that can accommodate banners of 1300 characters:\n\n\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only.\n\nBy using this IS (which includes any device attached to this IS), you consent to the following conditions:\n\n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.\n\n-At any time, the USG may inspect and seize data stored on this IS.\n\n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose.\n\n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.\n\n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"\n\nUse the following verbiage for operating systems that have severe limitations on the number of characters that can be displayed in the banner:\n\n\"I've read & consent to terms in IS user agreem't.\"",
      "severity": "medium"
    },
    {
      "id": "V-91461",
      "title": "If LDAP authentication is required on AIX, SSL must be used between LDAP clients and the LDAP servers to protect the integrity of remote access sessions.",
      "description": "If LDAP authentication is used, SSL must be used between LDAP clients and the LDAP servers to protect the integrity of remote access sessions.",
      "severity": "medium"
    },
    {
      "id": "V-91463",
      "title": "AIX must start audit at boot.",
      "description": "If auditing is enabled late in the start-up process, the actions of some start-up processes may not be audited. Some audit systems also maintain state information only available if auditing is enabled before a given process is created.",
      "severity": "medium"
    },
    {
      "id": "V-91467",
      "title": "AIX audit tools must be owned by root.",
      "description": "Protecting audit information also includes identifying and protecting the tools used to view and manipulate log data. Therefore, protecting audit tools is necessary to prevent unauthorized operation on audit information.\n\nOperating systems providing tools to interface with audit information will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user enjoys in order to make access decisions regarding the access to audit tools.\n\nAudit tools include, but are not limited to, vendor-provided and open source audit tools needed to successfully view and manipulate audit information system activity and records. Audit tools include custom queries and report generators.\n\nSatisfies: SRG-OS-000256-GPOS-00097, SRG-OS-000257-GPOS-00098, SRG-OS-000258-GPOS-00099",
      "severity": "medium"
    },
    {
      "id": "V-91469",
      "title": "AIX audit tools must be group-owned by audit.",
      "description": "Protecting audit information also includes identifying and protecting the tools used to view and manipulate log data. Therefore, protecting audit tools is necessary to prevent unauthorized operation on audit information.\n\nOperating systems providing tools to interface with audit information will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user enjoys in order to make access decisions regarding the access to audit tools.\n\nAudit tools include, but are not limited to, vendor-provided and open source audit tools needed to successfully view and manipulate audit information system activity and records. Audit tools include custom queries and report generators.\n\nSatisfies: SRG-OS-000256-GPOS-00097, SRG-OS-000257-GPOS-00098, SRG-OS-000258-GPOS-00099",
      "severity": "medium"
    },
    {
      "id": "V-91471",
      "title": "AIX audit tools must be set to 4550 or less permissive.",
      "description": "Protecting audit information also includes identifying and protecting the tools used to view and manipulate log data. Therefore, protecting audit tools is necessary to prevent unauthorized operation on audit information.\n\nOperating systems providing tools to interface with audit information will leverage user permissions and roles identifying the user accessing the tools and the corresponding rights the user enjoys in order to make access decisions regarding the access to audit tools.\n\nAudit tools include, but are not limited to, vendor-provided and open source audit tools needed to successfully view and manipulate audit information system activity and records. Audit tools include custom queries and report generators.\n\nSatisfies: SRG-OS-000256-GPOS-00097, SRG-OS-000257-GPOS-00098, SRG-OS-000258-GPOS-00099",
      "severity": "medium"
    },
    {
      "id": "V-91473",
      "title": "AIX system files, programs, and directories must be group-owned by a system group.",
      "description": "Restricting permissions will protect the files from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-91475",
      "title": "All system files, programs, and directories must be owned by a system account.",
      "description": "Restricting permissions will protect the files from unauthorized modification.",
      "severity": "medium"
    },
    {
      "id": "V-91477",
      "title": "AIX library files must have mode 0755 or less permissive.",
      "description": "Unauthorized access could destroy the integrity of the library files.",
      "severity": "medium"
    },
    {
      "id": "V-91479",
      "title": "All system command files must not have extended ACLs.",
      "description": "Restricting permissions will protect system command files from unauthorized modification. System command files include files present in directories used by the operating system for storing default system executables and files present in directories included in the system's default executable search paths.",
      "severity": "medium"
    },
    {
      "id": "V-91481",
      "title": "All library files must not have extended ACLs.",
      "description": "Unauthorized access could destroy the integrity of the library files.",
      "severity": "medium"
    },
    {
      "id": "V-91483",
      "title": "AIX device files and directories must only be writable by users with a system account or as configured by the vendor.",
      "description": "System device files in writable directories could be modified, removed, or used by an unprivileged user to control system hardware.",
      "severity": "medium"
    },
    {
      "id": "V-91485",
      "title": "AIX must enforce password complexity by requiring that at least one special character be used.",
      "description": "Use of a complex password helps to increase the time and resources required to compromise the password. Password complexity or strength is a measure of the effectiveness of a password in resisting attempts at guessing and brute-force attacks.\n\nPassword complexity is one factor in determining how long it takes to crack a password. The more complex the password, the greater the number of possible combinations that need to be tested before the password is compromised.\n\nSpecial characters are those characters that are not alphanumeric. Examples include: ~ ! @ # $ % ^ *.",
      "severity": "medium"
    },
    {
      "id": "V-91487",
      "title": "In the event of a system failure, AIX must preserve any information necessary to determine cause of failure and any information necessary to return to operations with least disruption to mission processes.",
      "description": "Failure to a known state can address safety or security in accordance with the mission/business needs of the organization. Failure to a known secure state helps prevent a loss of confidentiality, integrity, or availability in the event of a failure of the information system or a component of the system. \n\nPreserving operating system state information helps to facilitate operating system restart and return to the operational mode of the organization with least disruption to mission/business processes.",
      "severity": "medium"
    },
    {
      "id": "V-91489",
      "title": "AIX must verify the hash of audit tools.",
      "description": "Protecting the integrity of the tools used for auditing purposes is a critical step toward ensuring the integrity of audit information. Audit information includes all information (e.g., audit records, audit settings, and audit reports) needed to successfully audit information system activity.\n\nAudit tools include, but are not limited to, vendor-provided and open source audit tools needed to successfully view and manipulate audit information system activity and records. Audit tools include custom queries and report generators.\n\nIt is not uncommon for attackers to replace the audit tools or inject code into the existing tools with the purpose of providing the capability to hide or erase system activity from the audit logs.\n\nTo address this risk, audit tools must be cryptographically signed in order to provide the capability to identify when the audit tools have been modified, manipulated, or replaced. An example is a checksum hash of the file or files.",
      "severity": "medium"
    },
    {
      "id": "V-91491",
      "title": "AIX must config the SSH idle timeout interval.",
      "description": "Automatic session termination addresses the termination of user-initiated logical sessions in contrast to the termination of network connections that are associated with communications sessions (i.e., network disconnect). A logical session (for local, network, and remote access) is initiated whenever a user (or process acting on behalf of a user) accesses an organizational information system. Such user sessions can be terminated (and thus terminate user access) without terminating network sessions.\n\nSession termination terminates all processes associated with a user's logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated.\n\nConditions or trigger events requiring automatic session termination can include, for example, organization-defined periods of user inactivity, targeted responses to certain types of incidents, and time-of-day restrictions on information system use.\n\nThis capability is typically reserved for specific operating system functionality where the system owner, data owner, or organization requires additional assurance.",
      "severity": "medium"
    },
    {
      "id": "V-91493",
      "title": "AIX must set inactivity time-out on login sessions and terminate all login sessions after 10 minutes of inactivity.",
      "description": "Automatic session termination addresses the termination of user-initiated logical sessions in contrast to the termination of network connections that are associated with communications sessions (i.e., network disconnect). A logical session (for local, network, and remote access) is initiated whenever a user (or process acting on behalf of a user) accesses an organizational information system. Such user sessions can be terminated (and thus terminate user access) without terminating network sessions.\n\nSession termination terminates all processes associated with a user's logical session except those processes that are specifically created by the user (i.e., session owner) to continue after the session is terminated.\n\nIf a maintenance session or connection remains open after maintenance is completed, it may be hijacked by an attacker and used to compromise or damage the system.\n\nSome maintenance and test tools are either standalone devices with their own operating systems or are applications bundled with an operating system.\n\nConditions or trigger events requiring automatic session termination can include, for example, organization-defined periods of user inactivity, targeted responses to certain types of incidents, and time-of-day restrictions on information system use.\n\nThis capability is typically reserved for specific operating system functionality where the system owner, data owner, or organization requires additional assurance.\n\nTerminating network connections associated with communications sessions includes, for example, de-allocating associated TCP/IP address/port pairs at AIX level, and de-allocating networking assignments at the application level if multiple application sessions are using a single operating system-level network connection. This does not mean that AIX terminates all sessions or network access; it only ends the inactive session and releases the resources associated with that session.\n\n\nSatisfies: SRG-OS-000279-GPOS-00109, SRG-OS-000163-GPOS-00072, SRG-OS-000126-GPOS-00066",
      "severity": "medium"
    },
    {
      "id": "V-91495",
      "title": "If bash is used, AIX must display logout messages.",
      "description": "If a user cannot explicitly end an operating system session, the session may remain open and be exploited by an attacker; this is referred to as a zombie session. Users need to be aware of whether or not the session has been terminated.\n\nInformation resources to which users gain access via authentication include, for example, local workstations and remote services. Logoff messages can be displayed after authenticated sessions have been terminated. However, for some types of interactive sessions, including, for example, remote login, information systems typically send logoff messages as final messages prior to terminating sessions.",
      "severity": "low"
    },
    {
      "id": "V-91497",
      "title": "If Bourne / ksh shell is used, AIX must display logout messages.",
      "description": "If a user cannot explicitly end an operating system session, the session may remain open and be exploited by an attacker; this is referred to as a zombie session. Users need to be aware of whether or not the session has been terminated.\n\nInformation resources to which users gain access via authentication include, for example, local workstations and remote services. Logoff messages can be displayed after authenticated sessions have been terminated. However, for some types of interactive sessions, including, for example, remote login, information systems typically send logoff messages as final messages prior to terminating sessions.",
      "severity": "low"
    },
    {
      "id": "V-91499",
      "title": "If csh/tcsh shell is used, AIX must display logout messages.",
      "description": "If a user cannot explicitly end an operating system session, the session may remain open and be exploited by an attacker; this is referred to as a zombie session. Users need to be aware of whether or not the session has been terminated.\n\nInformation resources to which users gain access via authentication include, for example, local workstations and remote services. Logoff messages can be displayed after authenticated sessions have been terminated. However, for some types of interactive sessions, including, for example, remote login, information systems typically send logoff messages as final messages prior to terminating sessions.",
      "severity": "low"
    },
    {
      "id": "V-91501",
      "title": "SSH must display the date and time of the last successful account login to AIX system upon login.",
      "description": "Remote access services, such as those providing remote access to network devices and information systems, which lack automated control capabilities, increase risk and make remote user access management difficult at best.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nOperating system functionality (e.g., RDP) must be capable of taking enforcement action if the audit reveals unauthorized activity. Automated control of remote access sessions allows organizations to ensure ongoing compliance with remote access policies by enforcing connection rules of remote access applications on a variety of information system components (e.g., servers, workstations, notebook computers, smartphones, and tablets).",
      "severity": "low"
    },
    {
      "id": "V-91503",
      "title": "AIX must be able to control the ability of remote login for users.",
      "description": "Remote access services, such as those providing remote access to network devices and information systems, which lack automated control capabilities, increase risk and make remote user access management difficult at best.\n\nRemote access is access to DoD nonpublic information systems by an authorized user (or an information system) communicating through an external, non-organization-controlled network. Remote access methods include, for example, dial-up, broadband, and wireless.\n\nOperating system functionality (e.g., RDP) must be capable of taking enforcement action if the audit reveals unauthorized activity. Automated control of remote access sessions allows organizations to ensure ongoing compliance with remote access policies by enforcing connection rules of remote access applications on a variety of information system components (e.g., servers, workstations, notebook computers, smartphones, and tablets).",
      "severity": "high"
    },
    {
      "id": "V-91505",
      "title": "AIX must allow admins to send a message to all the users who logged in currently.",
      "description": "Discretionary Access Control (DAC) is based on the notion that individual users are \"owners\" of objects and therefore have discretion over who should be authorized to access the object and in which mode (e.g., read or write). Ownership is usually acquired as a consequence of creating the object or via specified ownership assignment. DAC allows the owner to determine who will have access to objects they control. An example of DAC includes user-controlled file permissions.\n\nWhen discretionary access control policies are implemented, subjects are not constrained with regard to what actions they can take with information for which they have already been granted access. Thus, subjects that have been granted access to information are not prevented from passing (i.e., the subjects have the discretion to pass) the information to other subjects or objects. A subject that is constrained in its operation by Mandatory Access Control policies is still able to operate under the less rigorous constraints of this requirement. Thus, while Mandatory Access Control imposes constraints preventing a subject from passing information to another subject operating at a different sensitivity level, this requirement permits the subject to pass the information to any subject at the same sensitivity level. The policy is bounded by the information system boundary. Once the information is passed outside the control of the information system, additional means may be required to ensure the constraints remain in effect. While the older, more traditional definitions of discretionary access control require identity-based access control, that limitation is not required for this use of discretionary access control.",
      "severity": "medium"
    },
    {
      "id": "V-91507",
      "title": "AIX must allow admins to send a message to a user who logged in currently.",
      "description": "Discretionary Access Control (DAC) is based on the notion that individual users are \"owners\" of objects and therefore have discretion over who should be authorized to access the object and in which mode (e.g., read or write). Ownership is usually acquired as a consequence of creating the object or via specified ownership assignment. DAC allows the owner to determine who will have access to objects they control. An example of DAC includes user-controlled file permissions.\n\nWhen discretionary access control policies are implemented, subjects are not constrained with regard to what actions they can take with information for which they have already been granted access. Thus, subjects that have been granted access to information are not prevented from passing (i.e., the subjects have the discretion to pass) the information to other subjects or objects. A subject that is constrained in its operation by Mandatory Access Control policies is still able to operate under the less rigorous constraints of this requirement. Thus, while Mandatory Access Control imposes constraints preventing a subject from passing information to another subject operating at a different sensitivity level, this requirement permits the subject to pass the information to any subject at the same sensitivity level. The policy is bounded by the information system boundary. Once the information is passed outside the control of the information system, additional means may be required to ensure the constraints remain in effect. While the older, more traditional definitions of discretionary access control require identity-based access control, that limitation is not required for this use of discretionary access control.",
      "severity": "medium"
    },
    {
      "id": "V-91509",
      "title": "AIX must use Trusted Execution (TE) Check policy.",
      "description": "Discretionary Access Control (DAC) is based on the notion that individual users are \"owners\" of objects and therefore have discretion over who should be authorized to access the object and in which mode (e.g., read or write). Ownership is usually acquired as a consequence of creating the object or via specified ownership assignment. DAC allows the owner to determine who will have access to objects they control. An example of DAC includes user-controlled file permissions.\n\nWhen discretionary access control policies are implemented, subjects are not constrained with regard to what actions they can take with information for which they have already been granted access. Thus, subjects that have been granted access to information are not prevented from passing (i.e., the subjects have the discretion to pass) the information to other subjects or objects. A subject that is constrained in its operation by Mandatory Access Control policies is still able to operate under the less rigorous constraints of this requirement. Thus, while Mandatory Access Control imposes constraints preventing a subject from passing information to another subject operating at a different sensitivity level, this requirement permits the subject to pass the information to any subject at the same sensitivity level. The policy is bounded by the information system boundary. Once the information is passed outside the control of the information system, additional means may be required to ensure the constraints remain in effect. While the older, more traditional definitions of discretionary access control require identity-based access control, that limitation is not required for this use of discretionary access control.",
      "severity": "medium"
    },
    {
      "id": "V-91511",
      "title": "NFS file systems on AIX must be mounted with the nosuid option unless the NFS file systems contain approved setuid or setgid programs.",
      "description": "The nosuid mount option causes the system to not execute setuid files with owner privileges. This option must be used for mounting any file system not containing approved setuid files. Executing setuid files from untrusted file systems, or file systems not containing approved setuid files, increases the opportunity for unprivileged users to attain unauthorized administrative access.",
      "severity": "medium"
    },
    {
      "id": "V-91515",
      "title": "AIX must provide the function for assigned ISSOs or designated SAs to change the auditing to be performed on all operating system components, based on all selectable event criteria in near real time.",
      "description": "If authorized individuals do not have the ability to modify auditing parameters in response to a changing threat environment, the organization may not be able to effectively respond, and important forensic information may be lost.\n\nThis requirement enables organizations to extend or limit auditing as necessary to meet organizational requirements. Auditing that is limited to conserve information system resources may be extended to address certain threat situations. In addition, auditing may be limited to a specific set of events to facilitate audit reduction, analysis, and reporting.",
      "severity": "medium"
    },
    {
      "id": "V-91517",
      "title": "AIX must allocate audit record storage capacity to store at least one weeks worth of audit records, when audit records are not immediately sent to a central audit record storage facility.",
      "description": "In order to ensure operating systems have a sufficient storage capacity in which to write the audit logs, operating systems need to be able to allocate audit record storage capacity.\n\nThe task of allocating audit record storage capacity is usually performed during initial installation of AIX.",
      "severity": "medium"
    },
    {
      "id": "V-91521",
      "title": "AIX must provide a report generation function that supports on-demand audit review and analysis, on-demand reporting requirements, and after-the-fact investigations of security incidents.",
      "description": "The report generation capability must support on-demand review and analysis in order to facilitate the organization's ability to generate incident reports, as needed, to better handle larger-scale or more complex security incidents. If the report generation capability does not support after-the-fact investigations, it is difficult to establish, correlate, and investigate the events leading up to an outage or attack, or identify those responses for one. This capability is also required to comply with applicable Federal laws and DoD policies.\n\nReport generation must be capable of generating on-demand (i.e., customizable, ad hoc, and as-needed) reports. On-demand reporting allows personnel to report issues more rapidly to more effectively meet reporting requirements. Collecting log data and aggregating it to present the data in a single, consolidated report achieves this objective.\n\nSatisfies: SRG-OS-000350-GPOS-00138, SRG-OS-000351-GPOS-00139, SRG-OS-000352-GPOS-00140",
      "severity": "medium"
    },
    {
      "id": "V-91523",
      "title": "AIX must provide time synchronization applications that can synchronize the system clock to external time sources at least every 24 hours.",
      "description": "Inaccurate time stamps make it more difficult to correlate events and can lead to an inaccurate analysis. Determining the correct time a particular event occurred on a system is critical when conducting forensic analysis and investigating system events. Sources outside the configured acceptable allowance (drift) may be inaccurate.\n\nSynchronizing internal information system clocks provides uniformity of time stamps for information systems with multiple system clocks and systems connected over a network.\n\nOrganizations should consider endpoints that may not have regular access to the authoritative time server (e.g., mobile, teleworking, and tactical endpoints).\n\nSatisfies: SRG-OS-000355-GPOS-00143, SRG-OS-000356-GPOS-00144",
      "severity": "medium"
    },
    {
      "id": "V-91527",
      "title": "AIX must record time stamps for audit records that can be mapped to Coordinated Universal Time (UTC) or Greenwich Mean Time (GMT).",
      "description": "If time stamps are not consistently applied and there is no common time reference, it is difficult to perform forensic analysis.\n\nTime stamps generated by AIX include date and time. Time is commonly expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC.",
      "severity": "medium"
    },
    {
      "id": "V-91529",
      "title": "AIX must disable Kerberos Authentication in ssh config file to enforce access restrictions.",
      "description": "Without auditing the enforcement of access restrictions against changes to the application configuration, it will be difficult to identify attempted attacks and an audit trail will not be available for forensic investigation for after-the-fact actions.\n\nEnforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. Enforcement action methods may be as simple as denying access to a file based on the application of file permissions (access restriction). Audit items may consist of lists of actions blocked by access restrictions or changes identified after the fact.",
      "severity": "medium"
    },
    {
      "id": "V-91531",
      "title": "AIX must disable trivial file transfer protocol.",
      "description": "Without auditing the enforcement of access restrictions against changes to the application configuration, it will be difficult to identify attempted attacks and an audit trail will not be available for forensic investigation for after-the-fact actions.\n\nEnforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. Enforcement action methods may be as simple as denying access to a file based on the application of file permissions (access restriction). Audit items may consist of lists of actions blocked by access restrictions or changes identified after the fact.",
      "severity": "high"
    },
    {
      "id": "V-91533",
      "title": "AIX must be configured to use syslogd to log events by TCPD.",
      "description": "Without auditing the enforcement of access restrictions against changes to the application configuration, it will be difficult to identify attempted attacks and an audit trail will not be available for forensic investigation for after-the-fact actions.\n\nEnforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. Enforcement action methods may be as simple as denying access to a file based on the application of file permissions (access restriction). Audit items may consist of lists of actions blocked by access restrictions or changes identified after the fact.",
      "severity": "medium"
    },
    {
      "id": "V-91535",
      "title": "AIX must employ a deny-all, permit-by-exception policy to allow the execution of authorized software programs.",
      "description": "Control of program execution is a mechanism used to prevent execution of unauthorized programs. Some operating systems may provide a capability that runs counter to the mission or provides users with functionality that exceeds mission requirements. This includes functions and services installed at AIX-level.\n\nSome of the programs, installed by default, may be harmful or may not be necessary to support essential organizational operations (e.g., key missions, functions). Removal of executable programs is not always possible; therefore, establishing a method of preventing program execution is critical to maintaining a secure system baseline.\n\nMethods for complying with this requirement include restricting execution of programs in certain environments, while preventing execution in other environments; or limiting execution of certain program functionality based on organization-defined criteria (e.g., privileges, subnets, sandboxed environments, or roles).\n\nThe organization must identify authorized software programs and permit execution of authorized software. The process used to identify software programs that are authorized to execute on organizational information systems is commonly referred to as whitelisting.\n\nVerification of white-listed software occurs prior to execution or at system startup.\n\nThis requirement applies to operating system programs, functions, and services designed to manage system processes and configurations (e.g., group policies).\n\nSatisfies: SRG-OS-000368-GPOS-00154, SRG-OS-000370-GPOS-00155",
      "severity": "medium"
    },
    {
      "id": "V-91537",
      "title": "AIX must remove NOPASSWD tag from sudo config files.",
      "description": "sudo command does not require reauthentication if NOPASSWD tag is specified in /etc/sudoers config file, or sudoers files in /etc/sudoers.d/ directory. With this tag in sudoers file, users are not required to reauthenticate for privilege escalation.",
      "severity": "high"
    },
    {
      "id": "V-91539",
      "title": "AIX must remove !authenticate option from sudo config files.",
      "description": "sudo command does not require reauthentication if !authenticate option is specified in /etc/sudoers config file, or config files in /etc/sudoers.d/ directory. With this tag in sudoers, users are not required to reauthenticate for privilege escalation.",
      "severity": "medium"
    },
    {
      "id": "V-91541",
      "title": "If GSSAPI authentication is not required on AIX, the SSH daemon must disable GSSAPI authentication.",
      "description": "GSSAPI authentication is used to provide additional authentication mechanisms to applications. Allowing GSSAPI authentication through SSH exposes the system's GSSAPI to remote hosts, increasing the attack surface of the system. GSSAPI authentication must be disabled unless needed.",
      "severity": "medium"
    },
    {
      "id": "V-91543",
      "title": "If automated file system mounting tool is not required on AIX, it must be disabled.",
      "description": "Automated file system mounting tools may provide unprivileged users with the ability to access local media and network shares. If this access is not necessary for the systems operation, it must be disabled to reduce the risk of unauthorized access to these resources.",
      "severity": "medium"
    },
    {
      "id": "V-91545",
      "title": "AIX must implement a way to force an identified temporary user to renew their password at next login.",
      "description": "Without providing this capability, an account may be created without a password. Non-repudiation cannot be guaranteed once an account is created if a user is not forced to change the temporary password upon initial login.\n\nTemporary passwords are typically used to allow access when new accounts are created or passwords are changed. It is common practice for administrators to create temporary passwords for user accounts which allow the users to log on, yet force them to change the password once they have successfully authenticated.",
      "severity": "medium"
    },
    {
      "id": "V-91547",
      "title": "If LDAP authentication is required, AIX must setup LDAP client to refresh user and group caches less than a day.",
      "description": "If cached authentication information is out-of-date, the validity of the authentication information may be questionable.",
      "severity": "medium"
    },
    {
      "id": "V-91549",
      "title": "AIX must setup SSH daemon to disable revoked public keys.",
      "description": "Without configuring a local cache of revocation data, there is the potential to allow access to users who are no longer authorized (users with revoked certificates).",
      "severity": "medium"
    },
    {
      "id": "V-91555",
      "title": "AIX must request and perform data origin and integrity authentication verification on the name/address resolution responses the system receives from authoritative sources.",
      "description": "If data origin authentication and data integrity verification are not performed, the resultant response could be forged, it may have come from a poisoned cache, the packets could have been intercepted without the resolver's knowledge, or resource records could have been removed, which would result in query failure or DoS. Data origin and integrity authentication must be performed to thwart these types of attacks.\n\nEach client of name resolution services either performs this validation on its own or has authenticated channels to trusted validation providers. Information systems that provide name and address resolution services for local clients include, for example, recursive resolving or caching Domain Name System (DNS) servers. DNS client resolvers either perform validation of DNSSEC signatures, or clients use authenticated channels to recursive resolvers that perform such validations. Information systems that use technologies other than the DNS to map between host/service names and network addresses provide other means to enable clients to verify the authenticity of response data.\n\nThis is not applicable if DNSSEC is not implemented on the local network.\n\nSatisfies: SRG-OS-000399-GPOS-00178, SRG-OS-000400-GPOS-00179, SRG-OS-000401-GPOS-00180, SRG-OS-000402-GPOS-00181",
      "severity": "medium"
    },
    {
      "id": "V-91557",
      "title": "AIX must only allow the use of DoD PKI-established certificate authorities for verification of the establishment of protected sessions.",
      "description": "Untrusted Certificate Authorities (CA) can issue certificates, but they may be issued by organizations or individuals that seek to compromise DoD systems or by organizations with insufficient security controls. If the CA used for verifying the certificate is not a DoD-approved CA, trust of this CA has not been established.\n\nThe DoD will only accept PKI-certificates obtained from a DoD-approved internal or external certificate authority. Reliance on CAs for the establishment of secure sessions includes, for example, the use of SSL/TLS certificates.",
      "severity": "medium"
    },
    {
      "id": "V-91559",
      "title": "AIX must protect against or limit the effects of Denial of Service (DoS) attacks by ensuring AIX is implementing rate-limiting measures on impacted network interfaces.",
      "description": "DoS is a condition when a resource is not available for legitimate users. When this occurs, the organization either cannot accomplish its mission or must operate at degraded capacity.\n\nThis requirement addresses the configuration of AIX to mitigate the impact of DoS attacks that have occurred or are ongoing on system availability. For each system, known and potential DoS attacks must be identified and solutions for each type implemented. A variety of technologies exist to limit or, in some cases, eliminate the effects of DoS attacks (e.g., limiting processes or establishing memory partitions). Employing increased capacity and bandwidth, combined with service redundancy, may reduce the susceptibility to some DoS attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91561",
      "title": "AIX must protect the confidentiality and integrity of transmitted information during preparation for transmission and maintain the confidentiality and integrity of information during reception and disable all non-encryption network access methods.",
      "description": "Without protection of the transmitted or received information, confidentiality and integrity may be compromised because unprotected communications can be intercepted and either read or altered. \n\nUse of this requirement will be limited to situations where the data owner has a strict requirement for ensuring data integrity and confidentiality is maintained at every step of the data transfer and handling process. This requirement applies to both internal and external networks and all types of information system components from which information can be transmitted (e.g., servers, mobile devices, notebook computers, printers, copiers, scanners, and facsimile machines). Communication paths outside the physical protection of a controlled boundary are exposed to the possibility of interception and modification. \n\nProtecting the confidentiality and integrity of organizational information can be accomplished by physical means (e.g., employing physical distribution systems) or by logical means (e.g., employing cryptographic techniques). If physical means of protection are employed, then logical means (cryptography) do not have to be employed, and vice versa.\n\nSatisfies: SRG-OS-000423-GPOS-00187, SRG-OS-000424-GPOS-00188, SRG-OS-000425-GPOS-00189, SRG-OS-000426-GPOS-00190, SRG-OS-000393-GPOS-00173, SRG-OS-000394-GPOS-00174",
      "severity": "medium"
    },
    {
      "id": "V-91563",
      "title": "AIX must remove all software components after updated versions have been installed.",
      "description": "Previous versions of software components that are not removed from the information system after updates have been installed may be exploited by adversaries. Some information technology products may remove older versions of software automatically from the information system.",
      "severity": "medium"
    },
    {
      "id": "V-91565",
      "title": "AIX must implement NIST FIPS-validated cryptography for the following: to provision digital signatures, to generate cryptographic hashes, and to protect unclassified information requiring confidentiality and cryptographic protection in accordance with applicable federal laws, Executive Orders, directives, policies, regulations, and standards.",
      "description": "FIPS 140-2 is the current standard for validating that mechanisms used to access cryptographic modules utilize authentication that meets DoD requirements. This allows for Security Levels 1, 2, 3, or 4 for use on a general purpose computing system.\n\nUse of weak or untested encryption algorithms undermines the purposes of utilizing encryption to protect data. AIX must implement cryptographic modules adhering to the higher standards approved by the federal government since this provides assurance they have been tested and validated.\n\nOpenSSL FIPS object module is a cryptographic module that is designed to meet the requirements for FIPS 140-2 validation by CMVP and is compatible with OpenSSL libraries. The 2.0.13 FIPS object module version has been FIPS validated and certified by CMVP for multiple AIX versions on Power 7 and Power 8 platforms under certificate #2398.\n\nIBM has released a FIPS capable OpenSSL (Fileset VRMF: 20.13.102.1000), which is OpenSSL 1.0.2j version with 2.0.13 object module. The fileset is available in Web Download Pack.\n\n\nSatisfies: SRG-OS-000120-GPOS-00061, SRG-OS-000478-GPOS-00223, SRG-OS-000396-GPOS-00176",
      "severity": "medium"
    },
    {
      "id": "V-91567",
      "title": "AIX must prevent the use of dictionary words for passwords.",
      "description": "If the operating system allows the user to select passwords based on dictionary words, then this increases the chances of password compromise by increasing the opportunity for successful guesses and brute-force attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91569",
      "title": "AIX must enforce a delay of at least 4 seconds between login prompts following a failed login attempt.",
      "description": "Limiting the number of login attempts over a certain time interval reduces the chances that an unauthorized user may gain access to an account.",
      "severity": "medium"
    },
    {
      "id": "V-91571",
      "title": "Samba packages must be removed from AIX.",
      "description": "If the smbpasswd file has a mode more permissive than 0600, the smbpasswd file may be maliciously accessed or modified, potentially resulting in the compromise of Samba accounts.",
      "severity": "medium"
    },
    {
      "id": "V-91573",
      "title": "The password hashes stored on AIX system must have been generated using a FIPS 140-2 approved cryptographic hashing algorithm.",
      "description": "Systems must employ cryptographic hashes for passwords using the SHA-2 family of algorithms or FIPS 140-2 approved successors. The use of unapproved algorithms may result in weak password hashes that are more vulnerable to compromise.",
      "severity": "medium"
    },
    {
      "id": "V-91575",
      "title": "AIX system must require authentication upon booting into single-user and maintenance modes.",
      "description": "This prevents attackers with physical access from trivially bypassing security on the machine and gaining root access. Such accesses are further prevented by configuring the bootloader password.",
      "severity": "medium"
    },
    {
      "id": "V-91577",
      "title": "On AIX, the SSH server must not permit root logins using remote access programs.",
      "description": "Permitting direct root login reduces auditable information about who ran privileged commands on the system and also allows direct attack attempts on root's password.",
      "severity": "medium"
    },
    {
      "id": "V-91579",
      "title": "AIX system must prevent the root account from directly logging in except from the system console.",
      "description": "Limiting the root account direct logins to only system consoles protects the root account from direct unauthorized access from a non-console device.\n\nA common attack method of potential hackers is to obtain the root password.\n\nTo avoid this type of attack, disable direct access to the root ID and then require system administrators to obtain root privileges by using the su - command. In addition to permitting removal of the root user as a point of attack, restricting direct root access permits monitoring which users gained root access, as well as the time of their action. Do this by viewing the /var/adm/sulog file. Another alternative is to enable system auditing, which will report this type of activity.\n\nTo disable remote login access for the root user, edit the /etc/security/user file. Specify False as the rlogin value on the entry for root.",
      "severity": "medium"
    },
    {
      "id": "V-91581",
      "title": "AIX system must restrict the ability to switch to the root user to members of a defined group.",
      "description": "Configuring a supplemental group for users permitted to switch to the root user prevents unauthorized users from accessing the root account, even with knowledge of the root credentials.",
      "severity": "medium"
    },
    {
      "id": "V-91583",
      "title": "If SNMP service is enabled on AIX, the default SNMP password must not be used in the /etc/snmpd.conf config file.",
      "description": "Use default SNMP password increases the chance of security vulnerability on SNMP service.",
      "severity": "medium"
    },
    {
      "id": "V-91585",
      "title": "AIX SSH daemon must be configured to only use Message Authentication Codes (MACs) employing FIPS 140-2 approved cryptographic hash algorithms.",
      "description": "DoD information systems are required to use FIPS 140-2 approved cryptographic hash functions.",
      "severity": "medium"
    },
    {
      "id": "V-91587",
      "title": "The inetd.conf file on AIX must be owned by root and system group.",
      "description": "Failure to give ownership of sensitive files or utilities to system groups may provide unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-91589",
      "title": "All AIX public directories must be owned by root or an application account.",
      "description": "If a public directory has the sticky bit set and is not owned by a privileged UID, unauthorized users may be able to modify files created by others. The only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage, (e.g., /tmp), and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-91591",
      "title": "All AIX NFS anonymous UIDs and GIDs must be configured to values without permissions.",
      "description": "When an NFS server is configured to deny remote root access, a selected UID and GID are used to handle requests from the remote root user. The UID and GID should be chosen from the system to provide the appropriate level of non-privileged access.",
      "severity": "medium"
    },
    {
      "id": "V-91593",
      "title": "AIX nosuid option must be enabled on all NFS client mounts.",
      "description": "Enabling the nosuid mount option prevents the system from granting owner or group-owner privileges to programs with the suid or sgid bit set. If the system does not restrict this access, users with unprivileged access to the local system may be able to acquire privileged access by executing suid or sgid files located on the mounted NFS file system.",
      "severity": "medium"
    },
    {
      "id": "V-91595",
      "title": "AIX cron and crontab directories must be owned by root or bin.",
      "description": "Incorrect ownership of the cron or crontab directories could permit unauthorized users the ability to alter cron jobs and run automated jobs as privileged users. Failure to give ownership of cron or crontab directories to root or to bin provides the designated owner and unauthorized users with the potential to access sensitive information or change the system configuration which could weaken the system's security posture.",
      "severity": "medium"
    },
    {
      "id": "V-91597",
      "title": "AIX audio devices must be group-owned by root, sys, bin, or system.",
      "description": "Without privileged group owners, audio devices will be vulnerable to being used as eaves-dropping devices by malicious users or intruders to possibly listen to conversations containing sensitive information.",
      "severity": "medium"
    },
    {
      "id": "V-91599",
      "title": "AIX passwd.nntp file must have mode 0600 or less permissive.",
      "description": "File permissions more permissive than 0600 for /etc/news/passwd.nntp may allow access to privileged information by system intruders or malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-91601",
      "title": "AIX time synchronization configuration file must be owned by root.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems. If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised. If the configuration files controlling time synchronization are not owned by a system account, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-91603",
      "title": "AIX time synchronization configuration file must be group-owned by bin, or system.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems. If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised. If the configuration files controlling time synchronization are not owned by a system group, unauthorized modifications could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-91605",
      "title": "AIX time synchronization configuration file must have mode 0640 or less permissive.",
      "description": "A synchronized system clock is critical for the enforcement of time-based policies and the correlation of logs and audit records with other systems. If an illicit time source is used for synchronization, the integrity of system logs and the security of the system could be compromised. File permissions more permissive than 0640 for time synchronization configuration file may allow     access and change the config file by system intruders or malicious users, could result in the failure of time synchronization.",
      "severity": "medium"
    },
    {
      "id": "V-91607",
      "title": "AIX administrative accounts must not run a web browser, except as needed for local service administration.",
      "description": "If a web browser flaw is exploited while running as a privileged user, the entire system could be compromised. \n\nSpecific exceptions for local service administration should be documented in site-defined policy. These exceptions may include HTTP(S)-based tools used for the administration of the local system, services, or attached devices. Examples of possible exceptions are HPs System Management Homepage (SMH), the CUPS administrative interface, and Sun's StorageTek Common Array Manager (CAM) when these services are running on the local system.",
      "severity": "medium"
    },
    {
      "id": "V-91609",
      "title": "AIX default system accounts (with the exception of root) must not be listed in the cron.allow file or must be included in the cron.deny file, if cron.allow does not exist.",
      "description": "To centralize the management of privileged account crontabs, of the default system accounts, only root may have a crontab.",
      "severity": "medium"
    },
    {
      "id": "V-91611",
      "title": "The AIX /etc/group file must be owned by root.",
      "description": "The \"/etc/group\" file contains information regarding groups that are configured on the system. Protection of this file is important for system security.",
      "severity": "medium"
    },
    {
      "id": "V-91613",
      "title": "The AIX /etc/group file must be group-owned by security.",
      "description": "The \"/etc/group\" file contains information regarding groups that are configured on the system. Protection of this file is important for system security.",
      "severity": "medium"
    },
    {
      "id": "V-91615",
      "title": "The AIX /etc/group file must have mode 0644 or less permissive.",
      "description": "The \"/etc/group\" file contains information regarding groups that are configured on the system. Protection of this file is important for system security.",
      "severity": "medium"
    },
    {
      "id": "V-91617",
      "title": "The AIX /etc/group file must not have an extended ACL.",
      "description": "The \"/etc/group\" file contains information regarding groups that are configured on the system. Protection of this file is important for system security.",
      "severity": "medium"
    },
    {
      "id": "V-91619",
      "title": "The AIX ldd command must be disabled.",
      "description": "The ldd command provides a list of dependent libraries needed by a given binary, which is useful for troubleshooting software. Instead of parsing the binary file, some ldd implementations invoke the program with a special environment variable set, which causes the system dynamic linker to display the list of libraries. Specially crafted binaries can specify an alternate dynamic linker which may cause a program to be executed instead of examined. If the program is from an untrusted source, such as in a user home directory, or a file suspected of involvement in a system compromise, unauthorized software may be executed with the rights of the user running ldd.",
      "severity": "medium"
    },
    {
      "id": "V-91621",
      "title": "The AIX root account must not have world-writable directories in its executable search path.",
      "description": "If the root search path contains a world-writable directory, malicious software could be placed in the path by intruders and/or malicious users and inadvertently run by root with all of root's privileges.",
      "severity": "medium"
    },
    {
      "id": "V-91623",
      "title": "The Group Identifiers (GIDs) reserved for AIX system accounts must not be assigned to non-system accounts as their primary group GID.",
      "description": "Reserved GIDs are typically used by system software packages. If non-system groups have GIDs in this range, they may conflict with system software, possibly leading to the group having permissions to modify system files.",
      "severity": "medium"
    },
    {
      "id": "V-91625",
      "title": "All AIX Group Identifiers (GIDs) referenced in the /etc/passwd file must be defined in the /etc/group file.",
      "description": "If a user is assigned the GID of a group not existing on the system, and a group with that GID is subsequently created, the user may have unintended rights to the group.",
      "severity": "medium"
    },
    {
      "id": "V-91627",
      "title": "All AIX files and directories must have a valid owner.",
      "description": "Unowned files do not directly imply a security problem, but they are generally a sign that something is amiss. They may be caused by an intruder, by incorrect software installation or draft software removal, or by failure to remove all files belonging to a deleted account. The files should be repaired so they will not cause problems when accounts are created in the future, and the cause should be discovered and addressed.",
      "severity": "medium"
    },
    {
      "id": "V-91629",
      "title": "The sticky bit must be set on all public directories on AIX systems.",
      "description": "Failing to set the sticky bit on public directories allows unauthorized users to delete files in the directory structure. The only authorized public directories are those temporary directories supplied with the system, or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system, and by users for temporary file storage - such as /tmp - and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-91631",
      "title": "The AIX global initialization files must contain the mesg -n or mesg n commands.",
      "description": "Command \"mesg -n\" allows only the root user the permission to send messages to your workstation to avoid having others clutter your display with incoming messages.",
      "severity": "medium"
    },
    {
      "id": "V-91633",
      "title": "The AIX hosts.lpd file must not contain a + character.",
      "description": "Having the '+' character in the hosts.lpd (or equivalent) file allows all hosts to use local system print resources.",
      "severity": "medium"
    },
    {
      "id": "V-91635",
      "title": "AIX sendmail logging must not be set to less than nine in the sendmail.cf file.",
      "description": "If Sendmail is not configured to log at level 9, system logs may not contain the information necessary for tracking unauthorized use of the sendmail service.",
      "severity": "medium"
    },
    {
      "id": "V-91637",
      "title": "AIX run control scripts executable search paths must contain only absolute paths.",
      "description": "The executable search path (typically the PATH environment variable) contains a list of directories for the shell to search to find executables. If this path includes the current working directory or other relative paths, executables in these directories may be executed instead of system commands.",
      "severity": "medium"
    },
    {
      "id": "V-91639",
      "title": "The /etc/shells file must exist on AIX systems.",
      "description": "The shells file (or equivalent) lists approved default shells. It helps provide layered defense to the security approach by ensuring users cannot change their default shell to an unauthorized unsecure shell.",
      "severity": "medium"
    },
    {
      "id": "V-91641",
      "title": "All AIX shells referenced in passwd file must be listed in /etc/shells file, except any shells specified for the purpose of preventing logins.",
      "description": "The /etc/shells file lists approved default shells. It helps provide layered defense to the security approach by ensuring users cannot change their default shell to an unauthorized unsecure shell.",
      "severity": "medium"
    },
    {
      "id": "V-91643",
      "title": "AIX NFS server must be configured to restrict file system access to local hosts.",
      "description": "The NFS access option limits user access to the specified level. This assists in protecting exported file systems. If access is not restricted, unauthorized hosts may be able to access the system's NFS exports.",
      "severity": "medium"
    },
    {
      "id": "V-91645",
      "title": "AIX public directories must be the only world-writable directories and world-writable files must be located only in public directories.",
      "description": "World-writable files and directories make it easy for a malicious user to place potentially compromising files on the system. The only authorized public directories are those temporary directories supplied with the system or those designed to be temporary file repositories. The setting is normally reserved for directories used by the system and by users for temporary file storage (e.g., /tmp) and for directories requiring global read/write access.",
      "severity": "medium"
    },
    {
      "id": "V-91647",
      "title": "AIX must be configured to only boot from the system boot device.",
      "description": "The ability to boot from removable media is the same as being able to boot into single user or maintenance mode without a password. This ability could allow a malicious user to boot the system and perform changes possibly compromising or damaging the system. It could also allow the system to be used for malicious purposes by a malicious anonymous user.",
      "severity": "medium"
    },
    {
      "id": "V-91649",
      "title": "AIX must not use removable media as the boot loader.",
      "description": "Malicious users with removable boot media can gain access to a system configured to use removable media as the boot loader.",
      "severity": "medium"
    },
    {
      "id": "V-91651",
      "title": "AIX audit logs must be rotated daily.",
      "description": "Rotate audit logs daily to preserve audit file system space and to conform to the DoD/DISA requirement. If it is not rotated daily and moved to another location, then there is more of a chance for the compromise of audit data by malicious users.",
      "severity": "medium"
    },
    {
      "id": "V-91653",
      "title": "If the AIX host is running an SMTP service, the SMTP greeting must not provide version information.",
      "description": "The version of the SMTP service can be used by attackers to plan an attack based on vulnerabilities present in the specific version.",
      "severity": "low"
    },
    {
      "id": "V-91655",
      "title": "AIX must contain no .forward files.",
      "description": "The .forward file allows users to automatically forward mail to another system. Use of .forward files could allow the unauthorized forwarding of mail and could potentially create mail loops which could degrade system performance.",
      "severity": "low"
    },
    {
      "id": "V-91657",
      "title": "AIX must implement a remote syslog server that is documented using site-defined procedures.",
      "description": "If a remote log host is in use and it has not been justified and documented, sensitive information could be obtained by unauthorized users without the administrators knowledge.\n\nSatisfies: SRG-OS-000480-GPOS-00227, SRG-OS-000342-GPOS-00133, SRG-OS-000479-GPOS-00224",
      "severity": "medium"
    },
    {
      "id": "V-91659",
      "title": "AIX must be configured with a default gateway for IPv4 if the system uses IPv4, unless the system is a router.",
      "description": "If a system has no default gateway defined, the system is at increased risk of man-in-the-middle, monitoring, and Denial of Service attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91661",
      "title": "The sendmail server must have the debug feature disabled on AIX systems.",
      "description": "Debug mode is a feature present in older versions of Sendmail which, if not disabled, may allow an attacker to gain access to a system through the Sendmail service.",
      "severity": "medium"
    },
    {
      "id": "V-91663",
      "title": "SMTP service must not have the EXPN or VRFY features active on AIX systems.",
      "description": "The SMTP EXPN function allows an attacker to determine if an account exists on a system, providing significant assistance to a brute force attack on user accounts. EXPN may also provide additional information concerning users on the system, such as the full names of account owners. The VRFY (Verify) command allows an attacker to determine if an account exists on a system, providing significant assistance to a brute force attack on user accounts. VRFY may provide additional information about users on the system, such as the full names of account owners.",
      "severity": "medium"
    },
    {
      "id": "V-91665",
      "title": "UIDs reserved for system accounts must not be assigned to non-system accounts on AIX systems.",
      "description": "Reserved UIDs are typically used by system software packages. If non-system accounts have UIDs in this range, they may conflict with system software, possibly leading to the user having permissions to modify system files.",
      "severity": "medium"
    },
    {
      "id": "V-91667",
      "title": "AIX must require passwords to contain no more than three consecutive repeating characters.",
      "description": "Passwords with excessive repeating characters may be more vulnerable to password-guessing attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91669",
      "title": "All global initialization file executable search paths must contain only absolute paths.",
      "description": "Failure to restrict system access to authenticated users negatively impacts operating system security.",
      "severity": "medium"
    },
    {
      "id": "V-91671",
      "title": "The AIX /etc/passwd, /etc/security/passwd, and/or /etc/group files must not contain a plus (+) without defining entries for NIS+ netgroups or LDAP netgroups.",
      "description": "A plus (+) in system accounts files causes the system to lookup the specified entry using NIS. If the system is not using NIS, no such entries should exist.",
      "severity": "medium"
    },
    {
      "id": "V-91673",
      "title": "AIX process core dumps must be disabled.",
      "description": "A core dump includes a memory image taken at the time the operating system terminates an application. The memory image could contain sensitive data and is generally useful only for developers trying to debug problems.",
      "severity": "medium"
    },
    {
      "id": "V-91675",
      "title": "The SMTP service HELP command must not be enabled on AIX.",
      "description": "The HELP command should be disabled to mask version information. The version of the SMTP service software could be used by attackers to target vulnerabilities present in specific software versions.",
      "severity": "medium"
    },
    {
      "id": "V-91677",
      "title": "The AIX syslog daemon must not accept remote messages unless it is a syslog server documented using site-defined procedures.",
      "description": "Unintentionally running a syslog server accepting remote messages puts the system at increased risk. Malicious syslog messages sent to the server could exploit vulnerabilities in the server software itself, could introduce misleading information in to the system's logs, or could fill the system's storage leading to a Denial of Service.",
      "severity": "medium"
    },
    {
      "id": "V-91679",
      "title": "The AIX SSH daemon must be configured for IP filtering.",
      "description": "The SSH daemon must be configured for IP filtering to provide a layered defense against connection attempts from unauthorized addresses.",
      "severity": "medium"
    },
    {
      "id": "V-91681",
      "title": "IP forwarding for IPv4 must not be enabled on AIX unless the system is a router.",
      "description": "IP forwarding permits the kernel to forward packets from one network interface to another. The ability to forward packets between two networks is only appropriate for systems acting as routers.",
      "severity": "medium"
    },
    {
      "id": "V-91683",
      "title": "NIS maps must be protected through hard-to-guess domain names on AIX.",
      "description": "The use of hard-to-guess NIS domain names provides additional protection from unauthorized access to the NIS directory information.",
      "severity": "medium"
    },
    {
      "id": "V-91685",
      "title": "The AIX systems access control program must be configured to grant or deny system access to specific hosts.",
      "description": "If the system's access control program is not configured with appropriate rules for allowing and denying access to system network resources, services may be accessible to unauthorized hosts.",
      "severity": "medium"
    },
    {
      "id": "V-91687",
      "title": "The AIX root accounts list of preloaded libraries must be empty.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries relative to the current working directory, unintended libraries may be preloaded.",
      "severity": "medium"
    },
    {
      "id": "V-91689",
      "title": "All AIX files and directories must have a valid group owner.",
      "description": "Failure to restrict system access to authenticated users negatively impacts operating system security.",
      "severity": "medium"
    },
    {
      "id": "V-91691",
      "title": "AIX control scripts library search paths must contain only absolute paths.",
      "description": "The library search path environment variable(s) contain a list of directories for the dynamic linker to search to find libraries. If this path includes the current working directory or other relative paths, libraries in these directories may be loaded instead of system libraries. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, or two consecutive colons, this is interpreted as the current working directory. Paths starting with a slash (/) are absolute paths.",
      "severity": "medium"
    },
    {
      "id": "V-91693",
      "title": "The control script lists of preloaded libraries must contain only absolute paths on AIX systems.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries relative to the current working directory, unintended libraries may be preloaded.",
      "severity": "medium"
    },
    {
      "id": "V-91695",
      "title": "The global initialization file lists of preloaded libraries must contain only absolute paths on AIX.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries relative to the current working directory, unintended libraries may be preloaded.",
      "severity": "medium"
    },
    {
      "id": "V-91697",
      "title": "The local initialization file library search paths must contain only absolute paths on AIX.",
      "description": "The library search path environment variable(s) contain a list of directories for the dynamic linker to search to find libraries. If this path includes the current working directory or other relative paths, libraries in these directories may be loaded instead of system libraries. This variable is formatted as a colon-separated list of directories. If there is an empty entry, such as a leading or trailing colon, or two consecutive colons, this is interpreted as the current working directory.",
      "severity": "medium"
    },
    {
      "id": "V-91699",
      "title": "The local initialization file lists of preloaded libraries must contain only absolute paths on AIX.",
      "description": "The library preload list environment variable contains a list of libraries for the dynamic linker to load before loading the libraries required by the binary. If this list contains paths to libraries relative to the current working directory, unintended libraries may be preloaded. This variable is formatted as a space-separated list of libraries.",
      "severity": "medium"
    },
    {
      "id": "V-91701",
      "title": "AIX removable media, remote file systems, and any file system not containing approved device files must be mounted with the nodev option.",
      "description": "The nodev (or equivalent) mount option causes the system to not handle device files as system devices. This option must be used for mounting any file system not containing approved device files. Device files can provide direct access to system hardware and can compromise security if not protected.",
      "severity": "medium"
    },
    {
      "id": "V-91703",
      "title": "AIX kernel core dumps must be disabled unless needed.",
      "description": "Kernel core dumps may contain the full contents of system memory at the time of the crash. Kernel core dumps may consume a considerable amount of disk space and may result in Denial of Service by exhausting the available space on the target file system. The kernel core dump process may increase the amount of time a system is unavailable due to a crash. Kernel core dumps can be useful for kernel debugging.",
      "severity": "medium"
    },
    {
      "id": "V-91705",
      "title": "The AIX SSH daemon must not allow compression.",
      "description": "If compression is allowed in an SSH connection prior to authentication, vulnerabilities in the compression software could result in compromise of the system from an unauthenticated connection, potentially with root privileges.",
      "severity": "medium"
    },
    {
      "id": "V-91707",
      "title": "AIX must be configured with a default gateway for IPv6 if the system uses IPv6 unless the system is a router.",
      "description": "If a system has no default gateway defined, the system is at increased risk of man-in-the-middle, monitoring, and Denial of Service attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91709",
      "title": "AIX must not have IP forwarding for IPv6 enabled unless the system is an IPv6 router.",
      "description": "If the system is configured for IP forwarding and is not a designated router, it could be used to bypass network security by providing a path for communication not filtered by network devices.",
      "severity": "medium"
    },
    {
      "id": "V-91711",
      "title": "AIX package management tool must be used daily to verify system software.",
      "description": "Verification using the system package management tool can be used to determine that system software has not been tampered with. This requirement is not applicable to systems not using package management tools.",
      "severity": "medium"
    },
    {
      "id": "V-91715",
      "title": "The AIX DHCP client must not send dynamic DNS updates.",
      "description": "Dynamic DNS updates transmit unencrypted information about a system including its name and address and should not be used unless needed.",
      "severity": "medium"
    },
    {
      "id": "V-91717",
      "title": "AIX must not run any routing protocol daemons unless the system is a router.",
      "description": "Routing protocol daemons are typically used on routers to exchange network topology information with other routers. If this software is used when not required, system network information may be unnecessarily transmitted across the network.",
      "severity": "medium"
    },
    {
      "id": "V-91719",
      "title": "AIX must not process ICMP timestamp requests.",
      "description": "The processing of Internet Control Message Protocol (ICMP) timestamp requests increases the attack surface of the system.",
      "severity": "medium"
    },
    {
      "id": "V-91721",
      "title": "AIX must not respond to ICMPv6 echo requests sent to a broadcast address.",
      "description": "Responding to broadcast ICMP echo requests facilitates network mapping and provides a vector for amplification attacks.",
      "severity": "medium"
    },
    {
      "id": "V-91723",
      "title": "AIX must encrypt user data at rest using AIX Encrypted File System (EFS) if it is required.",
      "description": "The AIX Encrypted File System (EFS) is a J2 filesystem-level encryption through individual key stores. This allows for file encryption in order to protect confidential data from attackers with physical access to the computer. User authentication and access control lists can protect files from unauthorized access (even from root user) while the operating system is running. \n\nOperating systems handling data requiring \"data at rest\" protections must employ cryptographic mechanisms to prevent unauthorized disclosure and modification of the information at rest.\n\nSelection of a cryptographic mechanism is based on the need to protect the integrity of organizational information. The strength of the mechanism is commensurate with the security category and/or classification of the information. Organizations have the flexibility to either encrypt all information on storage devices (i.e., full disk encryption) or encrypt specific data structures (e.g., files, records, or fields).\n\nSatisfies: SRG-OS-000480-GPOS-00227, SRG-OS-000405-GPOS-00184, SRG-OS-000404-GPOS-00183",
      "severity": "medium"
    },
    {
      "id": "V-91725",
      "title": "AIX must turn on SSH daemon privilege separation.",
      "description": "SSH daemon privilege separation causes the SSH process to drop root privileges when not needed, which would decrease the impact of software vulnerabilities in the unprivileged section.",
      "severity": "medium"
    },
    {
      "id": "V-91727",
      "title": "AIX must turn on SSH daemon reverse name checking.",
      "description": "If reverse name checking is off, SSH may allow a remote attacker to circumvent security policies and attempt to or actually login from IP addresses that are not permitted to access resources.",
      "severity": "medium"
    },
    {
      "id": "V-91729",
      "title": "AIX SSH daemon must perform strict mode checking of home directory configuration files.",
      "description": "If other users have access to modify user-specific SSH configuration files, they may be able to log into the system as another user.",
      "severity": "medium"
    },
    {
      "id": "V-91731",
      "title": "AIX must turn off X11 forwarding for the SSH daemon.",
      "description": "X11 forwarding over SSH allows for the secure remote execution of X11-based applications. This feature can increase the attack surface of an SSH connection and should not be enabled unless needed.",
      "severity": "medium"
    },
    {
      "id": "V-91733",
      "title": "AIX must turn off TCP forwarding for the SSH daemon.",
      "description": "SSH TCP connection forwarding provides a mechanism to establish TCP connections proxied by the SSH server. This function can provide similar convenience to a Virtual Private Network (VPN) with the similar risk of providing a path to circumvent firewalls and network ACLs.",
      "severity": "medium"
    },
    {
      "id": "V-91735",
      "title": "AIX must define default permissions for all authenticated users in such a way that the user can only read and modify their own files.",
      "description": "Setting the most restrictive default permissions ensures that when new accounts are created they do not have unnecessary access.",
      "severity": "medium"
    },
    {
      "id": "V-91737",
      "title": "AIX must not have accounts configured with blank or null passwords.",
      "description": "If an account is configured for password authentication but does not have an assigned password, it may be possible to log into the account without authentication. If the root user is configured without a password, the entire system may be compromised. For user accounts not using password authentication, the account must be configured with a password lock value instead of a blank or null value.",
      "severity": "high"
    },
    {
      "id": "V-91739",
      "title": "There must be no .rhosts, .shosts, hosts.equiv, or shosts.equiv files on the AIX system.",
      "description": "Trust files are convenient, but when used in conjunction with the remote login services, they can allow unauthenticated access to a system.",
      "severity": "medium"
    },
    {
      "id": "V-91741",
      "title": "The .rhosts file must not be supported in AIX PAM.",
      "description": ".rhosts files are used to specify a list of hosts permitted remote access to a particular account without authenticating. The use of such a mechanism defeats strong identification and authentication requirements.",
      "severity": "medium"
    },
    {
      "id": "V-91743",
      "title": "The AIX SSH daemon must be configured to disable empty passwords.",
      "description": "When password authentication is allowed, PermitEmptyPasswords specifies whether the server allows login to accounts with empty password strings. If an account has an empty password, anyone could log in and run commands with the privileges of that account. Accounts with empty passwords should never be used in operational environments.",
      "severity": "medium"
    },
    {
      "id": "V-91745",
      "title": "The AIX SSH daemon must be configured to disable user .rhosts files.",
      "description": "Trust .rhost file means a compromise on one host can allow an attacker to move trivially to other hosts.",
      "severity": "medium"
    },
    {
      "id": "V-91747",
      "title": "The AIX SSH daemon must be configured to not use host-based authentication.",
      "description": "SSH trust relationships mean a compromise on one host can allow an attacker to move trivially to other hosts.",
      "severity": "medium"
    },
    {
      "id": "V-91749",
      "title": "The AIX SSH daemon must not allow RhostsRSAAuthentication.",
      "description": "If SSH permits rhosts RSA authentication, a user may be able to log in based on the keys of the host originating the request and not any user-specific authentication.",
      "severity": "medium"
    },
    {
      "id": "V-91751",
      "title": "The AIX root user home directory must not be the root directory (/).",
      "description": "Changing the root home directory to something other than / and assigning it a 0700 protection makes it more difficult for intruders to manipulate the system by reading the files that root places in its default directory. It also gives root the same discretionary access control for root's home directory as for the other plain user home directories.",
      "severity": "medium"
    },
    {
      "id": "V-91753",
      "title": "The AIX root accounts home directory (other than /) must have mode 0700.",
      "description": "Users' home directories/folders may contain information of a sensitive nature. Non-privileged users should coordinate any sharing of information with an SA through shared resources.",
      "severity": "medium"
    },
    {
      "id": "V-91755",
      "title": "All AIX interactive users must be assigned a home directory in the passwd file and the directory must exist.",
      "description": "All users must be assigned a home directory in the passwd file. Failure to have a home directory may result in the user being put in the root directory. This could create a Denial of Service because the user would not be able to perform useful tasks in this location.",
      "severity": "medium"
    },
    {
      "id": "V-91759",
      "title": "All AIX users home directories must have mode 0750 or less permissive.",
      "description": "Excessive permissions on home directories allow unauthorized access to user files.",
      "severity": "medium"
    },
    {
      "id": "V-91761",
      "title": "All AIX interactive users home directories must be owned by their respective users.",
      "description": "System binaries are executed by privileged users as well as system services, and restrictive permissions are necessary to ensure that their execution of these programs cannot be co-opted.",
      "severity": "medium"
    },
    {
      "id": "V-91763",
      "title": "All AIX interactive users home directories must be group-owned by the home directory owner primary group.",
      "description": "If the Group Identifier (GID) of the home directory is not the same as the GID of the user, this would allow unauthorized access to files.",
      "severity": "medium"
    },
    {
      "id": "V-91765",
      "title": "The AIX root accounts home directory must not have an extended ACL.",
      "description": "Excessive permissions on root home directories allow unauthorized access to root user files.",
      "severity": "medium"
    },
    {
      "id": "V-91767",
      "title": "The AIX user home directories must not have extended ACLs.",
      "description": "Excessive permissions on home directories allow unauthorized access to user files.",
      "severity": "medium"
    },
    {
      "id": "V-91769",
      "title": "All files and directories contained in users home directories on AIX must be group-owned by a group in which the home directory owner is a member.",
      "description": "If the Group Identifier (GID) of the home directory is not the same as the GID of the user, this would allow unauthorized access to files.",
      "severity": "medium"
    },
    {
      "id": "V-91771",
      "title": "AIX must employ a deny-all, allow-by-exception firewall policy for allowing connections to other systems.",
      "description": "Failure to restrict network connectivity only to authorized systems permits inbound connections from malicious systems. It also permits outbound connections that may facilitate exfiltration of DoD data.",
      "severity": "medium"
    },
    {
      "id": "V-91773",
      "title": "If AIX SSH daemon is required, the SSH daemon must only listen on the approved listening IP addresses.",
      "description": "The SSH daemon should only listen on the approved listening IP addresses. Otherwise the SSH service could be subject to unauthorized access.",
      "severity": "medium"
    },
    {
      "id": "V-91775",
      "title": "AIX must provide audit record generation functionality for DoD-defined auditable events.",
      "description": "Without the capability to generate audit records, it would be difficult to establish, correlate, and investigate the events relating to an incident or identify those responsible for one.\n\nAudit records can be generated from various components within the information system (e.g., module or policy filter).\n\nThe list of audited events is the set of events for which audits are to be generated. This set of events is typically a subset of the list of all events for which the system is capable of generating audit records.\n\nDoD has defined the list of events for which AIX will provide an audit record generation capability as the following: \n\n1) Successful and unsuccessful attempts to access, modify, or delete privileges, security objects, security levels, or categories of information (e.g., classification levels);\n\n2) Access actions, such as successful and unsuccessful login attempts, privileged activities or other system-level access, starting and ending time for user access to the system, concurrent logins from different workstations, successful and unsuccessful accesses to objects, all program initiations, and all direct access to the information system;\n\n3) All account creations, modifications, disabling, and terminations; and \n\n4) All kernel module load, unload, and restart actions.\n\nSatisfies: SRG-OS-000062-GPOS-00031, SRG-OS-000004-GPOS-00004, SRG-OS-000051-GPOS-00024, SRG-OS-000064-GPOS-00033, SRG-OS-000239-GPOS-00089, SRG-OS-000240-GPOS-00090, SRG-OS-000241-GPOS-00091, SRG-OS-000277-GPOS-00107, SRG-OS-000303-GPOS-00120, SRG-OS-000304-GPOS-00121, SRG-OS-000327-GPOS-00127, SRG-OS-000327-GPOS-00127, SRG-OS-000364-GPOS-00151, SRG-OS-000392-GPOS-00172, SRG-OS-000458-GPOS-00203, SRG-OS-000461-GPOS-00205, SRG-OS-000462-GPOS-00206, SRG-OS-000463-GPOS-00207, SRG-OS-000465-GPOS-00209, SRG-OS-000466-GPOS-00210, SRG-OS-000467-GPOS-00211, SRG-OS-000468-GPOS-00212, SRG-OS-000470-GPOS-00214, SRG-OS-000471-GPOS-00215, SRG-OS-000471-GPOS-00216, SRG-OS-000472-GPOS-00217, SRG-OS-000473-GPOS-00218, SRG-OS-000474-GPOS-00219, SRG-OS-000475-GPOS-00220, SRG-OS-000476-GPOS-00221, SRG-OS-000477-GPOS-00222",
      "severity": "medium"
    },
    {
      "id": "V-92245",
      "title": "AIX must configure the ttys value for all interactive users.",
      "description": "A user's \"ttys\" attribute controls from which device(s) the user can authenticate and log in. If the \"ttys\" attribute is not specified, all terminals can access the user account.",
      "severity": "medium"
    },
    {
      "id": "V-92941",
      "title": "The AIX operating system must use Multi Factor Authentication.",
      "description": "To assure accountability and prevent unauthenticated access, privileged and non-privileged users must utilize multifactor authentication to prevent potential misuse and compromise of the system. \nMultifactor authentication uses two or more factors to achieve authentication.\n\nFactors include: \n1. Something you know (e.g., password/PIN);\n2. Something you have (e.g., cryptographic identification device, token); and\n3. Something you are (e.g., biometric).\n\nThe DoD CAC with DoD-approved PKI is an example of multifactor authentication.\n\n\nSatisfies: SRG-OS-000105-GPOS-00052, SRG-OS-000106-GPOS-00053, SRG-OS-000107-GPOS-00054, SRG-OS-000108-GPOS-00055, SRG-OS-000375-GPOS-00160",
      "severity": "medium"
    },
    {
      "id": "V-92943",
      "title": "The AIX operating system must be configured to authenticate using Multi Factor Authentication.",
      "description": "To assure accountability and prevent unauthenticated access, privileged and non-privileged users must utilize multifactor authentication to prevent potential misuse and compromise of the system. \nMultifactor authentication uses two or more factors to achieve authentication.\n\nFactors include: \n1. Something you know (e.g., password/PIN);\n2. Something you have (e.g., cryptographic identification device, token); and\n3. Something you are (e.g., biometric).\n\nThe DoD CAC with DoD-approved PKI is an example of multifactor authentication.",
      "severity": "medium"
    },
    {
      "id": "V-92945",
      "title": "The AIX operating system must be configured to use Multi Factor Authentication for remote connections.",
      "description": "To assure accountability and prevent unauthenticated access, privileged and non-privileged users must utilize multifactor authentication to prevent potential misuse and compromise of the system. \nMultifactor authentication uses two or more factors to achieve authentication.\n\nFactors include: \n1. Something you know (e.g., password/PIN);\n2. Something you have (e.g., cryptographic identification device, token); and\n3. Something you are (e.g., biometric).\n\nThe DoD CAC with DoD-approved PKI is an example of multifactor authentication.",
      "severity": "medium"
    },
    {
      "id": "V-92947",
      "title": "AIX must have the have the PowerSC Multi Factor Authentication Product configured.",
      "description": "To assure accountability and prevent unauthenticated access, privileged and non-privileged users must utilize multifactor authentication to prevent potential misuse and compromise of the system. \nMultifactor authentication uses two or more factors to achieve authentication.\n\nFactors include: \n1. Something you know (e.g., password/PIN);\n2. Something you have (e.g., cryptographic identification device, token); and\n3. Something you are (e.g., biometric).\n\nThe DoD CAC with DoD-approved PKI is an example of multifactor authentication.",
      "severity": "medium"
    },
    {
      "id": "V-92949",
      "title": "The AIX operating system must be configured to use a valid server_ca.pem file.",
      "description": "To assure accountability and prevent unauthenticated access, privileged and non-privileged users must utilize multifactor authentication to prevent potential misuse and compromise of the system. \nMultifactor authentication uses two or more factors to achieve authentication.\n\nFactors include: \n1. Something you know (e.g., password/PIN);\n2. Something you have (e.g., cryptographic identification device, token); and\n3. Something you are (e.g., biometric).\n\nThe DoD CAC with DoD-approved PKI is an example of multifactor authentication.",
      "severity": "medium"
    },
    {
      "id": "V-92951",
      "title": "The AIX operating system must accept and verify Personal Identity Verification (PIV) credentials.",
      "description": "The use of PIV credentials facilitates standardization and reduces the risk of unauthorized access.\n\nDoD has mandated the use of the CAC to support identity management and personal authentication for systems covered under Homeland Security Presidential Directive (HSPD) 12, as well as making the CAC a primary component of layered protection for national security systems.\n\nSatisfies: SRG-OS-000376-GPOS-00161, SRG-OS-000377-GPOS-00162",
      "severity": "medium"
    }
  ]
}