{
  "name": "stig_samsung_android_with_knox_2.x",
  "date": "2016-02-25",
  "description": "Developed by Samsung Electronics Co., Ltd. in coordination with DISA for the DoD.",
  "title": "Samsung Android (with Knox 2.x) STIG",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-56037",
      "title": "The Samsung Knox for Android platform must be configured to enable data-at-rest protection for built-in storage media.",
      "description": "The operating system must ensure the data being written to the mobile device's built-in storage media is protected from unauthorized access. If data at rest is unencrypted, it is vulnerable to disclosure. Even if the operating system enforces permissions on data access, an adversary can read storage media directly, thereby circumventing operating system controls. Encrypting the data ensures confidentiality is protected even when the operating system is not running.\n\nSFR ID: FMT_SMF.1.1 #22",
      "severity": "high"
    },
    {
      "id": "V-56039",
      "title": "The Samsung Knox for Android platform must be configured to enable data-at-rest protection for removable storage media.",
      "description": "The operating system must ensure the data being written to the mobile device's removable media is protected from unauthorized access. If data at rest is unencrypted, it is vulnerable to disclosure. Even if the operating system enforces permissions on data access, an adversary can read removable media directly, thereby circumventing operating system controls. Encrypting the data ensures confidentiality is protected even when the operating system is not running.\n\nSFR ID: FMT_SMF.1.1 #23",
      "severity": "high"
    },
    {
      "id": "V-56041",
      "title": "The Samsung Knox for Android platform must be configured to enforce a minimum password length of 6 characters.",
      "description": "Password strength is a measure of the effectiveness of a password in resisting guessing and brute force attacks. The ability to crack a password is a function of how many attempts an adversary is permitted, how quickly an adversary can do each attempt, and the size of the password space. The longer the minimum length of the password is, the larger the password space. Having a too-short minimum password length significantly reduces password strength, increasing the chance of password compromise and resulting device and data compromise.\n\nSFR ID: FMT_SMF.1.1 #01",
      "severity": "low"
    },
    {
      "id": "V-56043",
      "title": "The Samsung Knox for Android platform must be configured to prohibit more than 10 consecutive failed authentication attempts.",
      "description": "Users must not be able to override the system policy on the maximum number of consecutive failed authentication attempts because this could allow them to raise the maximum, thus giving adversaries more chances to guess/brute force passwords, which increases the risk of the mobile device being compromised. Therefore, only administrators should have the authority to set consecutive failed authentication attempt policies.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "low"
    },
    {
      "id": "V-56045",
      "title": "The Samsung Knox for Android platform must be configured to lock the display after 15 minutes (or less) of inactivity.",
      "description": "The screen lock timeout must be set to a value that helps protect the device from unauthorized access. Having a too-long timeout would increase the window of opportunity for adversaries who gain physical access to the mobile device through loss, theft, etc. Such devices are much more likely to be in an unlocked state when acquired by an adversary, thus granting immediate access to the data on the mobile device. The maximum timeout period of 15 minutes has been selected to balance functionality and security; shorter timeout periods may be appropriate, depending on the risks posed to the mobile device.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "medium"
    },
    {
      "id": "V-56047",
      "title": "The Samsung Knox for Android container must be configured to lock the display after 15 minutes (or less) of inactivity.",
      "description": "The screen lock timeout must be set to a value that helps protect the device from unauthorized access. Having a too-long timeout would increase the window of opportunity for adversaries who gain physical access to the mobile device through loss, theft, etc. Such devices are much more likely to be in an unlocked state when acquired by an adversary, thus granting immediate access to the data on the mobile device. The maximum timeout period of 15 minutes has been selected to balance functionality and security; shorter timeout periods may be appropriate, depending on the risks posed to the mobile device.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "medium"
    },
    {
      "id": "V-56049",
      "title": "The Samsung Knox for Android platform must be configured to enforce an application installation policy by specifying one or more authorized application repositories: disable Google Play.",
      "description": "Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DoD data accessible by these unauthorized/malicious applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-56051",
      "title": "The Samsung Knox for Android platform must be configured to enforce an application installation policy by specifying one or more authorized application repositories: disable unknown sources.",
      "description": "Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DoD data accessible by these unauthorized/malicious applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-56053",
      "title": "The Samsung Knox for Android platform must be configured to enforce an application installation policy by specifying one or more authorized application repositories: enroll in MDM.",
      "description": "Forcing all applications to be installed from authorized application repositories can prevent unauthorized and malicious applications from being installed and executed on mobile devices. Allowing such installations and executions could cause a compromise of DoD data accessible by these unauthorized/malicious applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-56055",
      "title": "The Samsung Knox for Android platform must be configured to enforce an application installation policy through application whitelist specifying a set of allowed applications and versions.",
      "description": "Requiring all authorized applications to be in an application whitelist prevents the execution of any applications (e.g., unauthorized, malicious) that are not part of the whitelist. Failure to configure an application whitelist properly could allow unauthorized and malicious applications to be downloaded, installed, and executed on the mobile device, causing a compromise of DoD data accessible by these applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-56057",
      "title": "The Samsung Knox for Android platform must be configured to disable USB mass storage mode.",
      "description": "This data transfer capability could allow users to transfer sensitive DoD data onto unauthorized USB storage devices, thus leading to the compromise of this DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56059",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable USB debugging.",
      "description": "USB debugging mode provides access to developer mode features. Developer modes circumvent certain security measures, so their use for standard operation is not recommended. Developer modes may increase the likelihood of compromise of confidentiality, integrity, and availability. Because of the security risks of developer modes, users must not be able to enable them.\n\nSFR ID: FMT_SMF.1.1 #21",
      "severity": "medium"
    },
    {
      "id": "V-56061",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable mock locations.",
      "description": "Developers often use mock locations in the development of apps that leverage location-based services. Developer modes circumvent certain security measures, so their use for standard operation is not recommended. Developer modes may increase the likelihood of compromise of confidentiality, integrity, and availability.\n\nIn particular, malicious applications can use the mock locations feature in the Android OS to override the device GPS location and provide a fake location to the user or network provider.\n\nSFR ID: FMT_SMF.1.1 #21",
      "severity": "medium"
    },
    {
      "id": "V-56063",
      "title": "The Samsung Knox for Android platform must be configured to disable developer modes.",
      "description": "Developer modes circumvent certain security measures, so their use for standard operation is not recommended. Developer modes may increase the likelihood of compromise of confidentiality, integrity, and availability.\n\nSFR ID: FMT_SMF.1.1 #21",
      "severity": "medium"
    },
    {
      "id": "V-56065",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Insecure VPN Connections.",
      "description": "Without strong mutual authentication, a mobile device may connect to an unauthorized network. In many cases, the user may falsely believe that the device is connected to an authorized network and then provide authentication credentials and other sensitive information. A strong bidirectional, cryptographically based authentication method mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56067",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: install DoD root and intermediate PKI certificates on the device.",
      "description": "DoD root and intermediate PKI certificates are used to verify the authenticity of PKI certificates of users and web services. If the root and intermediate certificates are not available, an adversary could falsely sign a certificate in such a way that it could not be detected. Providing access to the DoD root and intermediate PKI certificates greatly diminishes the risk of this attack.\n\nSFR ID: FMT_SMF.1.1 #13",
      "severity": "medium"
    },
    {
      "id": "V-56069",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: whitelist DoD root and intermediate PKI certificates.",
      "description": "If unauthorized device authentication certificates are installed on the device, there is the potential that the device may connect to a rogue device or network. Rogue devices can mimic the behavior of authorized equipment to trick the user into providing authentication credentials, which could then in turn be used to compromise DoD information and networks. Restricting device authentication certificates to an authorized list mitigates the risk of attaching to rogue devices and networks.\n\nSFR ID: FMT_SMF.1.1 #14",
      "severity": "medium"
    },
    {
      "id": "V-56071",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting. Employ mobile device management services to centrally manage security relevant configuration and policy settings.",
      "description": "Security-related parameters are those parameters impacting the security state of the system and include parameters related to the implementation of other IA controls. If these controls are not implemented, the system may be vulnerable to a variety of attacks. The use of an MDM allows an organization to assign values to security-related parameters across all the devices it manages. This provides assurance that the required mobile OS security controls are being enforced and that the device user or an adversary has not modified or disabled the controls. It also greatly increases efficiency and manageability of devices in a large-scale environment relative to an environment in which each device must be configured separately.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56073",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Allow New Admin Install.",
      "description": "An application with administrator permissions (e.g., MDM agent) is allowed to configure policies on the device. If a user is allowed to install another MDM agent on the device, then this will allow another MDM administrator (assuming it has the proper Knox licenses) the ability to configure potentially conflicting policies on the device that may not meet DoD security requirements. Although an MDM cannot disable another MDM's policies or remove another MDM from the device, there is the potential of creating policies that could conflict with enterprise policies. Therefore, other applications requesting administrator permissions should be blocked from installation.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56075",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: configure application install blacklist.",
      "description": "Blacklisting all applications is required so that only white-listed applications can be installed on the device. Requiring all authorized applications to be in an application whitelist prevents the execution of any applications (e.g., unauthorized, malicious) that are not part of the whitelist. Failure to configure an application whitelist and blacklist properly could allow unauthorized and malicious applications to be downloaded, installed, and executed on the mobile device, causing a compromise of DoD data accessible by these applications.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56077",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: configure application disable list.",
      "description": "Applications from various sources (including the vendor, the carrier, and Google) are pre-installed on the device at the time of manufacture. Some of the applications can compromise DoD data or upload user's information to non-DoD approved servers. A user must be blocked from using such applications that exhibit behavior that can result in compromise of DoD data or DoD user information. The site administrator must analyze all pre-installed applications on the device and block all applications not approved for DoD use by configuring the application disable list.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56079",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Google auto sync.",
      "description": "When a user configures their personal Google account on the device, the Google auto sync feature is automatically enabled. This results in the automatic upload and sync of data on the device (including contacts, files, calendar events, user information) to Google cloud servers. With this feature enabled, sensitive information will be backed up to Google's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of automatically enabling a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States. (Note: Disabling this feature does not disable manual syncing by the user from each application that makes use of the Google account.)\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56081",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Google crash report.",
      "description": "Applications that can be downloaded from Google Play (including pre-installed applications) will prompt the user to send a crash report to Google servers when the application crashes. The crash report will include application logs and stack traces, as well as device information that could potentially include user information. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56083",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Wi-Fi Direct.",
      "description": "Wi-Fi Direct allows the device to connect directly to another device via Wi-Fi without accessing a Wi-Fi access point and using DoD-required security mechanisms since Wi-Fi Direct can be used by applications to exchange files between devices. Disabling this feature mitigates the risk of compromising sensitive DoD data. \n\nNote: Disabling Wi-Fi Direct also disables S Beam.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56085",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable USB host storage.",
      "description": "The USB host storage feature allows the device to connect to select USB devices (e.g., USB flash drives, USB mouse, USB keyboard) using a micro USB to USB adapter cable. A user can copy sensitive DoD information to external USB storage unencrypted, resulting in compromise of DoD data. Disabling this feature mitigates the risk of compromising sensitive DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56087",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting.\n\nNot allow the device unlock password to contain more than two sequential or repeating characters (e.g., 456, aaa).",
      "description": "Password complexity or strength refers to how difficult it is to determine a password using a dictionary or brute-force attack. Passwords with sequential or repeating numbers or alphabetic characters (e.g., 456, 987, 222, abc, ddd) are considered easier to crack than random patterns. Therefore, disallowing sequential or repeating numbers or alphabetic characters makes it more difficult for an adversary to discover the password.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56089",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Google backup.",
      "description": "A cloud backup feature may gather a user's information, such as PII, or sensitive documents. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56091",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: configure Knox License.",
      "description": "A cloud backup feature may gather a user's information, such as PII, or sensitive documents. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nNote: Reporting information is required to periodically validate the Knox license on the device, and proper configuration of the Knox license ensures reporting information is sent to the correct enterprise servers.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56093",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting.\n\nDisable multi-user mode.",
      "description": "By default the enterprise administrator will install and enroll MDM on the device's owner user space. Since some policies configured by the MDM will only apply to the owner space, the user can bypass some of these policies by creating and switching to a guest user space. This can potentially result in compromise of the device and DoD data via installation of malicious applications. Disabling this feature will mitigate this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56095",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable public cloud backup apps.",
      "description": "A cloud backup feature may gather a user's information, such as PII, or sensitive documents. With this feature enabled, sensitive information will be backed up to the manufacturer's servers and database. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56097",
      "title": "The Samsung Knox for Android platform must be configured to implement the user-based enforcement setting: disable messaging preview notifications in lock screen.",
      "description": "Text messages can potentially include sensitive information. When this feature is enabled, both text message data and the sender's name or number will be displayed on the lock screen. This may result in an adversary obtaining potentially sensitive data even when the device is in a locked state. Disabling this feature will mitigate this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56099",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable S Voice.",
      "description": "On MOS devices, users (may be able to) access the device's contact database or calendar to obtain phone numbers and other information using a human voice even when the mobile device is locked. Often this information is personally identifiable information (PII), which is considered sensitive. It could also be used by an adversary to profile the user or engage in social engineering to obtain further information from other unsuspecting users. Disabling access to the contact database and calendar in these situations mitigates the risk of this attack. The AO may waive this requirement with written notice if the operational environment requires this capability.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56101",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting.\n\nDisable mobile payment.",
      "description": "Mobile payment makes use of NFC to transmit personal account information from the device to the NFC reader. Compromise of this data can result in financial loss to both the individual and DoD. Disabling this feature mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56103",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable mobile printing.",
      "description": "Mobile printing allows the device to connect to a printer over a Wi-Fi connection. Data is sent unencrypted over the Wi-Fi connection, potentially resulting in the compromise of sensitive DoD data. Disabling this feature mitigates the risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56105",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable NFC.",
      "description": "NFC is a wireless technology that transmits small amounts of information from the device to the NFC reader. Any data transmitted can be potentially compromised. Disabling this feature mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56107",
      "title": "The Samsung Knox for Android platform must be configured to implement the user-based enforcement setting: disable screen mirroring.",
      "description": "Screen mirroring allows the user to display device content to a compatible device (e.g., TV) over a Wi-Fi connection. Although this feature uses HDCP 2.x protocol and encryption of visual data to transmit data, vulnerabilities in the 2.0 and 2.1 protocol implementation can result in compromise of sensitive DoD data. Disabling this feature will mitigate this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56109",
      "title": "The Samsung Knox for Android platform must be configured to implement the user-based enforcement setting: disable Samsung Account.",
      "description": "Configuring a Samsung Account on the device allows the user to backup files (including S Health data) to Samsung servers, as well as download applications from Samsung Apps (Galaxy Apps) store. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56111",
      "title": "The Samsung Knox for Android platform must be configured to implement the user-based enforcement setting: disable Nearby devices.",
      "description": "The Nearby devices feature allows the user to share files with other devices that are connected on the same Wi-Fi access point using the DLNA technology. Even though the user must allow requests from other devices, this feature can potentially result in unauthorized access to and compromise of sensitive DoD files. Disabling this feature will mitigate this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56113",
      "title": "The Samsung Knox for Android platform must be configured to disable USB media player.",
      "description": "This data transfer capability could allow users to transfer sensitive DoD data onto unauthorized USB storage devices, thus leading to the compromise of this DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56115",
      "title": "The Samsung Knox for Android platform must be configured to require the user to manifest consent to the terms of the DoD-specified warning banner each time the user unlocks the device.",
      "description": "The mobile operating system is required to display the DoD-approved system use notification message or banner before granting access to the system that provides privacy and security notices consistent with applicable federal laws, Executive Orders, directives, policies, regulations, standards, and guidance. Required banners help ensure that DoD can audit and monitor the activities of mobile device users without legal restriction. \n\nSystem use notification messages can be displayed when individuals first access or unlock the mobile device. The banner shall be implemented as a \"click-through\" banner at device unlock (to the extent permitted by the operating system). A \"click-through\" banner prevents further activity on the information system unless and until the user executes a positive action to manifest agreement by clicking on a box indicating “OK.”\n\nThe approved DoD text must be used exactly as specified in the DoDI 8500.01. For devices accommodating banners of 1300 characters, the banner text is: \n\nYou are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. \nBy using this IS (which includes any device attached to this IS), you consent to the following conditions: \n-The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations. \n-At any time, the USG may inspect and seize data stored on this IS. \n-Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG-authorized purpose. \n-This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy. \n-Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\n\nFor Blackberries and other PDAs/PEDs with severe character limitations, the banner text is: \n\nI've read & consent to terms in IS user agreem't.\n\nThe administrator must configure the banner text exactly as written without any changes.\n\nSFR ID: FMT_SMF.1.1 #41",
      "severity": "low"
    },
    {
      "id": "V-56117",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable Manual Date Time Changes.",
      "description": "Determining the correct time a particular application event occurred on a system is critical when conducting forensic analysis and investigating system events. \n\nPeriodically synchronizing internal clocks with an authoritative time source is needed in order to correctly correlate the timing of events that occur across the enterprise. The three authoritative time sources for mobile operating systems are an authoritative time server that is synchronized with redundant United States Naval Observatory (USNO) time servers as designated for the appropriate DoD network (NIPRNet or SIPRNet), or the Global Positioning System (GPS), or the wireless carrier.\n\nTime stamps generated by the audit system in mobile operating systems shall include both date and time. The time may be expressed in Coordinated Universal Time (UTC), a modern continuation of Greenwich Mean Time (GMT), or local time with an offset from UTC.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56119",
      "title": "The Samsung Knox for Android container must be configured to enforce a minimum password length of 4 characters.",
      "description": "Password strength is a measure of the effectiveness of a password in resisting guessing and brute-force attacks. The ability to crack a password is a function of how many attempts an adversary is permitted, how quickly an adversary can do each attempt, and the size of the password space. The longer the minimum length of the password is, the larger the password space. Having a too-short minimum password length significantly reduces password strength, increasing the chance of password compromise and resulting device and data compromise.\n\nSFR ID: FMT_SMF.1.1 #01",
      "severity": "low"
    },
    {
      "id": "V-56121",
      "title": "The Samsung Knox for Android container must be configured to prohibit more than 10 consecutive failed authentication attempts.",
      "description": "Users must not be able to override the system policy on the maximum number of consecutive failed authentication attempts because this could allow them to raise the maximum, thus giving adversaries more chances to guess/brute force passwords, which increases the risk of the mobile device being compromised. Therefore, only administrators should have the authority to set consecutive failed authentication attempt policies.\n\nSFR ID: FMT_SMF.1.1 #02",
      "severity": "low"
    },
    {
      "id": "V-56123",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: enable container.",
      "description": "The container must be enabled by the administrator/MDM or the container's protections will not apply to the mobile device. This will cause the mobile device's apps and data to be at significantly higher risk of compromise because they are not protected by encryption, isolation, etc.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56127",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: enable CC mode.",
      "description": "CC mode implements several security controls required by the Mobile Device Functional Protection Profile (MDFPP). If CC mode is not implemented, DoD data is more at risk of being compromised, and the MD is more at risk of being compromised if lost or stolen.\n\nCC mode implements the following controls:\n- enables the OpenSSL FIPS crypto library\n- sets the password failure settings to wipe the device to 5 (5 failed consecutive attempts will wipe the device)\n- disables ODIN mode (download mode)\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56129",
      "title": "The Samsung Knox for Android platform must be configured to implement the management setting: disable all Bluetooth profiles except for HSP (Headset Profile), HFP (Hands-Free Profile), and SPP (Serial Port Profile).",
      "description": "Unsecure Bluetooth profiles may allow either unauthenticated connections to mobile devices or transfer of sensitive DoD data without required DoD information assurance (IA) controls. Only the HSP, HFP, and SPP profiles are required to meet current DoD Bluetooth needs and DoD data and voice IA controls.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56133",
      "title": "The Samsung Knox for Android container must be configured to enforce an application installation policy through application whitelist specifying a set of allowed applications and versions.",
      "description": "Requiring all authorized applications to be in an application whitelist prevents the execution of any applications (e.g., unauthorized, malicious) that are not part of the whitelist. Failure to configure an application whitelist properly could allow unauthorized and malicious applications to be downloaded, installed, and executed on the mobile device, causing a compromise of DoD data accessible by these applications.\n\nSFR ID: FMT_SMF.1.1 #10",
      "severity": "medium"
    },
    {
      "id": "V-56135",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: configure application install blacklist.",
      "description": "Blacklisting all applications is required so that only white-listed applications can be installed on the device. Requiring all authorized applications to be in an application whitelist prevents the execution of any applications (e.g., unauthorized, malicious) that are not part of the whitelist. Failure to configure an application whitelist and blacklist properly could allow unauthorized and malicious applications to be downloaded, installed, and executed on the mobile device, causing a compromise of DoD data accessible by these applications.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56137",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: disable Move Applications to Container.",
      "description": "Applications determined to be acceptable for personal use outside the container might not be acceptable for use within the container. The Move Applications to Container feature allows users to install personal side applications into the container, resulting in potential compromise of DoD data. Disabling this feature mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56139",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: disable Move Files from Container to Personal.",
      "description": "Allowing movement of files between the container and personal side will result in both personal data and sensitive DoD data being placed in the same space. This can potentially result in DoD data being transmitted to non-authorized recipients via personal email accounts or social applications, or transmission of malicious files to DoD accounts. Disabling this feature mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56141",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: disable Move Files from Personal to Container.",
      "description": "Allowing movement of files between the container and personal side will result in both personal data and sensitive DoD data being placed in the same space. This can potentially result in DoD data being transmitted to non-authorized recipients via personal email accounts or social applications, or transmission of malicious files to DoD accounts. Disabling this feature mitigates this risk.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56143",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: configure application disable list.",
      "description": "Applications from various sources (including the vendor, the carrier, and Google) are installed on the device at the time of manufacture. Core apps are apps preinstalled by Google.  Third-party preinstalled apps included apps from the vendor and carrier. Some of the applications can compromise DoD data or upload user's information to non-DoD approved servers. A user must be blocked from using such applications that exhibit behavior that can result in compromise of DoD data or DoD user information. The site administrator must analyze all pre-installed applications on the device and block all applications not approved for DoD use by configuring the application disable list.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56157",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: Account whitelist.",
      "description": "Whitelisting of authorized email accounts (POP3, IMAP, EAS) prevents a user from configuring a personal email account that could be used to forward sensitive DoD data to unauthorized recipients.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56159",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting: Account blacklist.",
      "description": "Blacklisting all email accounts is required so that only white-listed accounts can be configured.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-56161",
      "title": "The Samsung Knox for Android container must be configured to implement the user-based enforcement setting: disable Samsung Account.",
      "description": "Configuring a Samsung Account on the device allows the user to backup files (including S Health data) to Samsung servers, as well as download applications from Samsung Apps (Galaxy Apps) store. This data is stored at a location that has unauthorized employees accessing this data. This data is stored on a server that has a location unknown to the DoD. Disabling this feature mitigates the risk of a backup feature that stores sensitive data on a server that has the potential to be located in a country other than the United States.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-57447",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting.\n\nDisable sharing of calendar information outside the container.",
      "description": "Calendar events can include potentially DoD-sensitive data such as names, contacts, dates and times, and locations. If made available outside the container this information will be accessible to personal applications, resulting in potential compromise of DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-57449",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting.\n\nDisable sharing of contact information outside the container.",
      "description": "Contacts can include DoD-sensitive data and PII of DoD employees including names, numbers, addresses, and email addresses. If made available outside the container this information will be accessible to personal applications, resulting in potential compromise of DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-57451",
      "title": "The Samsung Knox for Android container must be configured to implement the management setting.\n\nDisable sharing of notification details outside the container.",
      "description": "Application notifications can include DoD-sensitive data. If made available outside the container this information will be accessible to personal applications, resulting in potential compromise of DoD data.\n\nSFR ID: FMT_SMF.1.1 #42",
      "severity": "medium"
    },
    {
      "id": "V-57949",
      "title": "The Samsung Knox for Android platform must be configured to disable firmware updates over-the-air (FOTA).",
      "description": "FOTA allows the user to download and install firmware updates over-the-air. These updates can include OS upgrades, security patches, bug fixes, new features and applications. Since the updates are controlled by the carriers, DoD will not have an opportunity to review and update policies prior to update availability to end users. Disabling FOTA will mitigate the risk of allowing users access to applications that could compromise DoD sensitive data. After reviewing the update and adjusting any necessary policies (i.e. disabling applications determined to pose risk), the administrator can re-enable FOTA.",
      "severity": "medium"
    },
    {
      "id": "V-66505",
      "title": "Samsung Android operating systems that are no longer supported by the vendor for security updates must not be installed on a system.",
      "description": "Android operating systems that are no longer supported by Samsung for security updates are not evaluated or updated for vulnerabilities, leaving them open to potential attack.  Organizations must transition to a supported operating system to ensure continued support.",
      "severity": "high"
    }
  ]
}