{
  "name": "vmware_esx_3_policy",
  "date": "2016-05-03",
  "description": "The VMware ESX 3 Policy Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems. Comments or proposed revisions to this document should be sent via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "VMware ESX 3 Policy",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-15825",
      "title": "A third party firewall is configured on ESX Server.",
      "description": "Third party software and services should not be installed in the service console. The service console is not intended to support the operation of additional software or services beyond what is included in the default ESX installation. VMware does not support the addition of third party applications that have not been explicitly approved.  ",
      "severity": "medium"
    },
    {
      "id": "V-15833",
      "title": "Hash signatures for the /etc files are not reviewed monthly.",
      "description": "Several files within ESX Server should be checked for file system integrity periodically. These files have been deemed critical by VMware in maintaining file system integrity. System administrators must ensure these files have the correct permissions and have not been modified. To ensure integrity, system administrators will use a FIPS 140-2 hash algorithm to create signatures of these files and store them offline. Comparing these hash values periodically will verify the integrity of the files.",
      "severity": "medium"
    },
    {
      "id": "V-15841",
      "title": "ESX Server log files are not reviewed daily. ",
      "description": "Logs form a recorded history or audit trail of the ESX Server system events, making it easier for system administrators to track down intermittent problems, review past events, and piece together information if an investigation is required.  Without this recorded history, potential attacks and suspicious activity will go unnoticed.  \n\nESX Server log files that are critical to record include VMkernel, VMkernel warnings, VMkernel summary, ESX Server host agent, virtual machines,  VI Client agent,Web Access, service console, and authentication. The VMkernel logs record activities related to the virtual machines and the ESX Server. The VMkernel warning log file records activities with the virtual machines. The VMkernel summary is used to determine uptime and availability statistics for the ESX Server. The ESX Server host agent log contains information on the agent that manages and configures the ESX Server host. This log may assist in diagnosing connection problems.  The virtual machine log files contain information when a virtual machine crashes or shutdowns abnormally. The VI Client agent is installed on each managed ESX Server and this log records all the activities of the agent. Web Access records information on web-based access to the ESX Server.  This is important to view since web-based access to the ESX Server should be disabled. The service console messages contain all general log messages used to troubleshoot virtual machines or the ESX Server. The authentication log contains records of connections that require authentication.\n",
      "severity": "medium"
    },
    {
      "id": "V-15845",
      "title": "The IAO/SA does not subscribe to vendor security patches and update notifications.",
      "description": "Organizations need to stay current with all applicable ESX Server software updates that are released from VMware. In order to be aware of updates as they are released, virtualization server administrators will subscribe to ESX Server vendor security notices, updates, and patches to ensure that all new vulnerabilities are known. New ESX Server patches and updates should be reviewed in a test environment for the ESX Server before moving them into a production environment.",
      "severity": "low"
    },
    {
      "id": "V-15851",
      "title": "There are no procedures for the backup and recovery of the ESX Server, management servers, and virtual machines.",
      "description": "Backup and recovery procedures are critical to the availability and protection of the virtual infrastructure. Availability of the system will be hindered if the system is compromised, shutdown, or not available. Backup and recovery of the virtual environment includes the ESX Servers, management servers, and virtual machines. The ESX Server has three major components required for backup and recovery. These components are virtual disks, virtual machine configuration files, and the configuration of the ESX Server itself. Due to the array of products and options available to backup the virtualization infrastructure, procedures will need to be developed to provide guidance to system administrators.  ",
      "severity": "low"
    },
    {
      "id": "V-15853",
      "title": "Disaster recovery plan does not include ESX Servers, VirtualCenter servers, virtual machines, and necessary peripherals associated with the system.",
      "description": "Disaster and recovery plans should be drafted and exercised in accordance with the MAC level of the system/Enclave as defined by the DoDI 85002. Disaster plans provide for the resumption of mission or business essential functions. A disaster plan must exist that provides for the resumption of mission or business essential functions within the specified period of time depending on MAC level. (Disaster recovery procedures include business recovery plans, system contingency plans, facility disaster recovery plans, and plan acceptance).",
      "severity": "medium"
    },
    {
      "id": "V-15875",
      "title": "Users assigned to VirtualCenter groups are not documented.",
      "description": "Ensuring privileged group membership is controlled requires updates to group documentation, and periodic reviews to determine that unauthorized users are not members.  If an unauthorized user is able to gain membership to the Database Administrator group, Virtual Machine Administrator group, or the Resource Administrator group, etc., that user would be able to display, add, or change permissions to objects that could impact the confidentiality, integrity, or availability of an entire virtualization structure.",
      "severity": "low"
    },
    {
      "id": "V-15876",
      "title": "Users in the VirtualCenter Server Windows Administrators group are not documented.",
      "description": "Users who are members of the Windows administrators group on the VirtualCenter server are granted the same access rights as any user assigned to the VirtualCenter administrator role. These users need to be documented to ensure only authorized users are members of this group.",
      "severity": "low"
    },
    {
      "id": "V-15877",
      "title": "VirtualCenter Server groups are not reviewed monthly",
      "description": "Reviewing the VirtualCenter groups will ensure that no unauthorized users have been granted access to objects. ",
      "severity": "medium"
    },
    {
      "id": "V-15878",
      "title": "No documented configuration management process exists for VirtualCenter changes.",
      "description": "VirtualCenter objects might have multiple permissions for users and or groups. Permissions are applied hierarchically downward on these objects. For each permission the administrator must decide if the permission applies only to that immediate object, or downward to all sub objects.  Permissions may be overridden by setting different permissions on a lower object.  These situations can create confusion and permissions that were thought to be limited might actually be elevated.  Furthermore, all changes take affect immediately not requiring users to log off and log back in. Configuration management is critical for all modifications since the new change may override previously configured permissions.",
      "severity": "medium"
    },
    {
      "id": "V-15879",
      "title": "There is no VirtualCenter baseline configuration document for users, groups, permissions, and roles.",
      "description": "When pairing users or groups with permissions to an object, a role is defined for users and groups. There are two default roles defined in VirtualCenter called System roles and Sample roles. System roles are permanent and the permissions associated with these roles cannot be changed.  Sample roles are provided for convenience as guidelines and suggestions.  These roles may be modified or removed.  VirtualCenter situations may arise where a user is a member of multiple groups with different permissions or user permissions are explicitly defined when the user is a member of different groups. \n\nThese situations can create confusion and permissions that were thought to be limited might actually be elevated.  Furthermore, all changes take affect immediately not requiring users to log off and log back in. Therefore, all users, groups, permissions, and roles will be documented and approved to ensure proper permissions are granted only to authorized users.\n",
      "severity": "medium"
    },
    {
      "id": "V-15881",
      "title": "VirtualCenter logs are reviewed daily.",
      "description": "It is necessary to review VirtualCenter logs for suspicious activity, problems, attacks, or system warnings will go undetected.  These logs provide visibility into the activities and events of the VirtualCenter.  These logs enable system administrators and auditors the ability to recreate past events, monitor the system, and ensure security policies are being enforced.",
      "severity": "medium"
    },
    {
      "id": "V-15882",
      "title": "There is no up-to-date documentation of the virtualization infrastructure.",
      "description": "With the creation of virtual machines, the actual virtual network topology becomes increasingly complex.  The topology changes when a virtual machine is created, added to a virtual switch or port group, moved to another virtualization server, etc.  With the dynamic nature of the virtualization environment, administrators of the virtualization environment will maintain up to date documentation for all virtual machines, virtual switches, IP addresses, MAC addresses, etc.",
      "severity": "medium"
    },
    {
      "id": "V-15889",
      "title": "The VMware-converter utility is not used for VMDK imports or exports.",
      "description": "There will be situations that require the import or export of VMDK files on the VMFS partition.  Importing and exporting disk files can also be done through the Virtual Infrastructure Client or service console by copying the files from VMFS mount and pasting them to a partition running ext3 file system. Utilizing the VMware-converter utility is required since the VMFS file system utilizes such large files. There are third-party converters available that may work with VMware virtual machines, however, none have been thoroughly tested or approved by VMware. ",
      "severity": "low"
    },
    {
      "id": "V-15891",
      "title": "No policy exists to assign virtual machines to personnel.",
      "description": "In traditional computing environments, servers were usually assigned to various personnel for administration. For instance, the data server is administered by the database administrator; the domain controller is maintained by the network administrator, etc. Other methods include assigning the MAC address to specific personnel or identifying machines by Ethernet location or port number. All these approaches are impractical in the virtual machine environment.\n\nIn the virtual environment, virtual machines may be moved or have MAC addresses that may change. These scenarios make it difficult to establish who owns the virtual machine running on a particular host. Therefore, a policy will need to be implemented to identify and assign virtual machines to the appropriate personnel.\n",
      "severity": "low"
    },
    {
      "id": "V-15892",
      "title": "VI Console is used to administer virtual machines.",
      "description": "The VI Console allows a user to connect to the console of a virtual machine, similar to seeing what a physical server monitor would show. However, the VI Console also provides power management and removable device connectivity controls, which could potentially allow a malicious user to bring down a virtual machine. In addition, it also has a performance impact on the service console, especially if many VI Console sessions are open simultaneously. To prevent performance issues and potential unauthorized users from accessing the VI Console, users should use remote management services, such as terminal services and ssh, to interact with virtual machines.",
      "severity": "low"
    },
    {
      "id": "V-15898",
      "title": "The IAO/SA does not document and approve virtual machine renames.",
      "description": "It may become necessary to rename a virtual machine at some point during the course of testing to production. To rename a virtual machine, the virtual machine must be powered down before proceeding with the renaming feature. It is also good practice to backup virtual machines before renaming any virtual machine. The configuration files for VMware are typically located on the service console in /root/VMware/ directory, and the virtual disks will be in the /vmfs/ directory.  Renaming virtual machines may cause communication issues on the network with other servers, users, etc.  To prevent communication disruptions to the network or virtual machine, all virtual machine renames will be documented and approved by the change control board.",
      "severity": "low"
    },
    {
      "id": "V-15900",
      "title": "No policy exists to restrict copying and sharing virtual machines over networks and removable media.",
      "description": "As virtual machines replace real hardware they can undermine the security architecture of many organizations which often assume predictable and controlled change number of hosts, host configurations, host locations etc.  Some useful mechanisms that virtual machines provide are copying or sharing virtual machine hard disks. Copying or sharing virtual machine hard disks can be done over networks and removable media. Typically, test and development virtual machines will be moved and updated more frequently than production virtual machines. There will be a policy in place to restrict the copying and sharing of production virtual machines over networks and removable media to ensure that administrators do not give unauthorized users access to the virtual machine files.\n\n",
      "severity": "low"
    },
    {
      "id": "V-15902",
      "title": "Virtual machine moved to removable media are not documented.",
      "description": "From a theft perspective, virtual machines are easy to copy and move to a person’s USB drive, portable hard drive, etc. An insider could potentially move the organization’s entire data center on any type of removable media that had sufficient space. ",
      "severity": "medium"
    },
    {
      "id": "V-15903",
      "title": "Virtual machines are removed from the site without approval documentation.",
      "description": "From a theft perspective, virtual machines are easy to copy and move to a person’s USB drive, portable hard drive, etc. An insider could potentially move the organization’s entire data center on any type of removable media that had sufficient space. ",
      "severity": "medium"
    },
    {
      "id": "V-15905",
      "title": "Virtual machine rollbacks are performed when virtual machine is connected to the network.",
      "description": "Virtual machines may be rolled back to a previous state. Rolling back a virtual machine can re-expose patched vulnerabilities, re-enable previously disabled accounts or passwords, remove log files of a machine, use previously retired encryption keys, and change firewalls to expose vulnerabilities. Rolling back virtual machines can also reintroduce malicious code, and protocols reusing TCP sequence numbers that had been previously removed, which could allow TCP hijacking attacks.  ",
      "severity": "low"
    },
    {
      "id": "V-15919",
      "title": "Virtual machine requirements are not documented before creating a virtual machine.",
      "description": "Guest operating systems may require different resources depending on the server function. A database or email server will require more resources than a basic Windows Domain Controller.  Therefore, proper planning is required to determine what servers will be built within the virtualization server environment.  \n\nTo properly create virtual machines within the virtualization server environment, a minimal list of requirements will be determined.  These requirements are the amount of memory, amount of required disk space, the networking card assignment, required media, and proper disk mode to be used.  \n",
      "severity": "low"
    },
    {
      "id": "V-16851",
      "title": "ESX administrators have not received proper training to administer the ESX Server.",
      "description": "Different roles require different types of training. A skilled staff is one of the critical components to the security of an organization.  The ESX Server is complex and has many components that need to be monitored and configured.  If staff is not properly trained in administering the ESX Server, vulnerabilities will likely be open.",
      "severity": "low"
    },
    {
      "id": "V-68721",
      "title": "VMware ESX operating systems, virtual machines, and associated management software that are no longer supported by the vendor for security updates must not be installed on a system.",
      "description": "VMware ESX operating systems, virtual machines, and associated management software that are no longer supported by VMware for security updates are not evaluated or updated for vulnerabilities leaving them open to potential attack.  Organizations must transition to a supported ESXi operating system, virtual machines, and associated management software to ensure continued support.",
      "severity": "high"
    }
  ]
}