{
  "name": "web_server",
  "date": "2010-10-07",
  "description": "None",
  "title": "Web Server STIG",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-13591",
      "title": "Classified web servers will be afforded physical security commensurate with the classification of its content.",
      "description": "When data of a classified nature is migrated to a web server, fundamental principles applicable to the safeguarding of classified material must be followed. A classified web server needs to be afforded physical security commensurate with the classification of its content to ensure the protection of the data it houses.",
      "severity": "high"
    },
    {
      "id": "V-13613",
      "title": "The site software used with the web server does not have all applicable security patches applied and documented.",
      "description": "The IAVM process does not address all patches that have been identified for the host operating system or, in this case, the web server software environment. Many vendors have subscription services available to notify users of known security threats. The site needs to be aware of these fixes and make determinations based on local policy and what software features are installed, if these patches need to be applied. \n\nIn some cases, patches also apply to middleware and database systems. Maintaining the security of web servers requires frequent reviews of security notices. Many security notices mandate the installation of a software patch to overcome security vulnerabilities. \n\nSAs and IAOs should regularly check the vendor support web site for patches and information related to the web server software. All applicable security patches will be applied to the operating system and to the web server software. Security patches are deemed applicable if the product is installed, even if it is not used or is disabled. \n",
      "severity": "medium"
    },
    {
      "id": "V-13619",
      "title": "The web server, although started by superuser or privileged account, will run using a non-privileged account.",
      "description": "Running the web server with excessive privileges presents an increased risk to the web server. In the event the web server’s services are compromised, the context by which the web server is running will determine the amount of damage that may be caused by the attacker. If the web server is run as an administrator or as an equivalent account, the attacker will gain administrative access through the web server. If, on the other hand, the web server is running with least privilege required to function, the capabilities of the attacker will be greatly decreased.",
      "severity": "medium"
    },
    {
      "id": "V-13620",
      "title": "A private web server’s list of CAs in a trust hierarchy will lead to the DoD PKI Root CA, to a DoD-approved external certificate authority (ECA), or to a DoD-approved external partner.",
      "description": "A PKI certificate is a digital identifier that establishes the identity of an individual or a platform. A server that has a certificate provides users with third-party confirmation of authenticity. Most web browsers perform server authentication automatically and the user is notified only if the authentication fails. The authentication process between the server and the client is performed using the SSL/TLS protocol. Digital certificates are authenticated, issued, and managed by a trusted Certificate Authority (CA).\n\nThe use of a trusted certificate validation hierarchy is crucial to the ability to control access to a site’s server and to prevent unauthorized access. Only DoD-approved PKIs will be utilized.\n",
      "severity": "medium"
    },
    {
      "id": "V-13621",
      "title": "All web server documentation, sample code, example applications, and tutorials will be removed from a production web server.",
      "description": "Web server documentation, sample code, example applications, and tutorials may be an exploitable threat to a web server. A production web server may only contain components that are operationally necessary (e.g., compiled code, scripts, web-content, etc.). Delete all directories that contain samples and any scripts used to execute the samples. If there is a requirement to maintain these directories at the site on non-production servers for training purposes, have NTFS permissions set to only allow access to authorized users (i.e., web admins and administrators). Sample applications or scripts have not been evaluated and approved for use and may introduce vulnerabilities to the system.",
      "severity": "high"
    },
    {
      "id": "V-13672",
      "title": "The private web server will use an approved DoD certificate validation process.",
      "description": "Without the use of a certificate validation process, the site is vulnerable to accepting certificates that have expired or have been revoked.  This would allow unauthorized individuals access to the web server.  This also defeats the purpose of the multi-factor authentication provided by the PKI process.\n",
      "severity": "medium"
    },
    {
      "id": "V-13686",
      "title": "Remote authors or content providers will only use secure encrypted logons and connections to upload files to the Document Root directory.",
      "description": "Logging in to a web server via a telnet session or using HTTP or FTP in order to upload documents to the web site is a risk if proper encryption is not utilized to protect the data being transmitted. A secure shell service or HTTPS needs to be installed and in use for these purposes.",
      "severity": "high"
    },
    {
      "id": "V-13687",
      "title": "Remote authors or content providers will have all files scanned for viruses and malicious code before uploading files to the Document Root directory.",
      "description": "Remote web authors should not be able to upload files to the Document Root directory structure without virus checking and checking for malicious or mobile code. A remote web user, whose agency has a Memorandum of Agreement (MOA) with the hosting agency and has submitted a DoD form 2875 (System Authorization Access Request (SAAR)) or an equivalent document, will be allowed to post files to a temporary location on the server. All posted files to this temporary location will be scanned for viruses and content checked for malicious or mobile code. Only files free of viruses and malicious or mobile code will be posted to the appropriate DocumentRoot directory.",
      "severity": "medium"
    },
    {
      "id": "V-13688",
      "title": "Log file data must contain required data elements.",
      "description": "The use of log files is a critical component of the operation of the Information Systems (IS) used within the DoD, and they can provide invaluable assistance with regard to damage assessment, causation, and the recovery of both affected components and data. They may be used to monitor accidental or intentional misuse of the (IS) and may be used by law enforcement for criminal prosecutions. The use of log files is a requirement within the DoD.",
      "severity": "medium"
    },
    {
      "id": "V-13689",
      "title": "Access to the web server log files will be restricted to administrators, web administrators, and auditors.",
      "description": "A major tool in exploring the web site use, attempted use, unusual conditions, and problems are the access and error logs. In the event of a security incident, these logs can provide the SA and the web administrator with valuable information. Because of the information that is captured in the logs, it is critical that only authorized individuals have access to the logs.",
      "severity": "medium"
    },
    {
      "id": "V-13694",
      "title": "Public web servers will use TLS if authentication is required.",
      "description": "TLS encryption is optional for a public web server. However, if authentication and encryption are used, then the use of TLS is required. Transactions encrypted with DoD PKI certificates are necessary when information being transferred is not intended to be accessed by all parties on the network. To the extent that this standard applies, this check is valid for the SIPRNet also.\n\nFIPS 140-2 compliance includes:\nTLS V1.0 or greater\nTLS must be enabled; the use of SSL disabled\nConfiguration of required cryptographic modules as specified by NIST CVMP\n",
      "severity": "medium"
    },
    {
      "id": "V-15334",
      "title": "Web sites will utilize ports, protocols, and services according to PPSM guidelines.",
      "description": "Failure to comply with DoD ports, protocols, and services (PPS) requirements can result\nin compromise of enclave boundary protections and/or functionality of the AIS.\n\nThe IAM will ensure web servers are configured to use only authorized PPS in accordance with the Network Infrastructure STIG, DoD Instruction 8551.1, Ports, Protocols, and Services Management (PPSM), and the associated Ports, Protocols, and Services (PPS) Assurance Category Assignments List.\n",
      "severity": "low"
    },
    {
      "id": "V-2225",
      "title": "MIME types for csh or sh shell programs will be disabled.",
      "description": "Users should not be allowed to access the shell programs. Shell programs might execute shell escapes and could then perform unauthorized activities that could damage the security posture of the web server. A shell is a program that serves as the basic interface between the user and the operating system. In this regard, there are shells that are security risks in the context of a web server and shells that are unauthorized in the context of the Security Features User's Guide.",
      "severity": "medium"
    },
    {
      "id": "V-2227",
      "title": "Symbolic links will not be used in the web content directory tree.",
      "description": "A symbolic link allows a file or a directory to be referenced using a symbolic name raising a potential hazard if symbolic linkage is made to a sensitive area.\n\nWhen web scripts are executed and symbolic links are allowed, the web user could be allowed to access locations on the web server that are outside the scope of the web document root or home directory.",
      "severity": "high"
    },
    {
      "id": "V-2228",
      "title": "All interactive programs will be placed in a designated directory with appropriate permissions.",
      "description": "CGI scripts represent one of the most common and exploitable means of compromising a web server. By definition, CGI scripts are executable programs used by the operating system of the host server.\n\nAll CGI program files need to be segregated into their own directory to simplify the protection of these files. ASP scripts should be placed into a unique directory that only contains other ASP scripts. JAVA and other technology-specific scripts should also be placed into their own unique directories.\n\nThe placement of CGI or equivalent scripts to special directories gives the Web Manager or the SA control over what goes into those directories and to facilitate access control at the directory level. Allowing users to execute CGI scripts in any directory should only be considered if the users can be trusted not to write scripts that will deliberately or accidentally expose the server to an attack. These files, if left in directories from which the anonymous web user could read the source code, would make it easier for someone to understand and attack the web server.\n\nClarification:\nThis vulnerability, which is related to VMS vulnerability V-2229, requires that CGI scripts are placed in a unique directory that is not located under the root directory and that appropriate access permissions are applied at the directory level. If it is feasible to segregate CGI scripts that require read/execute permissions from those scripts that only require execute permission, then the web master is encouraged to segregate these scripts into separate directories. Powerful CGI scripts that may be used by authenticated and privileged administrative personnel should always be segregated and placed into separate directories.\n",
      "severity": "medium"
    },
    {
      "id": "V-2229",
      "title": "Interactive scripts used on a web server will have proper access controls.",
      "description": "CGI is a ‘programming standard’ for interfacing external applications with information servers, such as HTTP or web servers. CGI, represented by all upper case letters, should not be confused with the .cgi file extension. The .cgi file extension does represent a CGI script, but CGI scripts may be written in a number of programming languages (e.g., PERL, C, PHP, and Javascript), each having their own unique file extension.\n\nThe use of CGI scripts represent one of the most common and exploitable means of compromising a web server. By definition, CGI scripts are executable by the operating system of the host server. While access control is provided via the web service, the execution of CGI programs is not limited unless the SA or the Web Manager takes specific measures. CGI programs can access and alter data files, launch other programs, and use the network.\n\nClarification:\nThis vulnerability, which is related to VMS vulnerability V-2228, requires that appropriate access permissions are applied to CGI files.\n",
      "severity": "medium"
    },
    {
      "id": "V-2230",
      "title": "Backup interactive scripts on the production web server are prohibited.",
      "description": "Copies of backup files will not execute on the server, but they can be read by the anonymous user if special precautions are not taken. Such backup copies contain the same sensitive information as the actual script being executed and, as such, are useful to malicious users. Techniques and systems exist today that search web servers for such files and are able to exploit the information contained in them. \n\nBackup copies of files are automatically created by some text editors such as emacs and edit plus. The emacs editor will write a backup file with an extension ~ added to the name of the original file. The edit plus editor will create a .bak file. Of course, this would imply the presence and use of development tools on the web server, which is a finding under WG130. Having backup scripts on the web server provides one more opportunity for malicious persons to view these scripts and use the information found in them.\n",
      "severity": "low"
    },
    {
      "id": "V-2234",
      "title": "A public web server’s resources (e.g., drives, folders, printers, etc.) will not be shared with private assets.",
      "description": "It is important to segregate public web server resources from private resources located behind the DoD DMZ in order to protect private assets. When folders, drives or other resources are directly shared between the public web server and private servers the intent of data and resource segregation can be compromised. \n\nIn addition to the requirements of the DoD Internet-NIPRNet DMZ STIG that isolates inbound traffic from the external network to the internal network, resources such as printers, files, and folders/directories will not be shared between public web servers and assets located within the internal network. \n\n",
      "severity": "medium"
    },
    {
      "id": "V-2235",
      "title": "The service account ID used to run the web site will have its password changed at least annually.\n\n",
      "description": "Normally, a service account is established for the web service to run under rather than permitting it to run as system or root. The passwords on such accounts must be changed at least annually. It is a fundamental tenet of security that passwords are not to be null and must not to be set to never expire.",
      "severity": "medium"
    },
    {
      "id": "V-2236",
      "title": "Installation of compilers on production web server is prohibited.",
      "description": "The presence of a compiler on a production server facilitates the malicious user’s task of creating custom versions of programs and installing Trojan Horses or viruses. For example, the attacker’s code can be uploaded and compiled on the server under attack. Of particular concern is C compilers.",
      "severity": "medium"
    },
    {
      "id": "V-2240",
      "title": "The number of allowed simultaneous requests will be limited for web sites.",
      "description": "Resource exhaustion can occur when an unlimited number of concurrent requests are allowed on a web site, facilitating a denial of service attack. Mitigating this kind of attack will include limiting the number of concurrent HTTP/HTTPS requests per IP address and may include, where feasible, limiting parameter values associated with keepalive, (i.e., a parameter used to limit the amount of time a connection may be inactive).\n\n",
      "severity": "medium"
    },
    {
      "id": "V-2242",
      "title": "A public web server will be physically and logically isolated in accordance with the DoD Internet-NIPRNet DMZ STIG and the DoD Enclave STIG.",
      "description": "To minimize exposure of private assets to unnecessary risk by attackers, public web servers must be isolated from internal systems. Public web servers also refer to web servers that may be located on non-public networks and contain information that is approved for release to the entire community. Public web servers must not have trusted connections with assets outside the confines of the demilitarized zone (DMZ) or in an isolated separate public enclave (subnet). This trusted connection is not to be confused with a Microsoft Domain trust. A trusted connection can be an attachment to Microsoft shares, in UNIX as Network File System (NFS) mounts, as well as connections to interior enclave printers. This relationship can also be found with connections from public web servers to interior enclave databases.",
      "severity": "medium"
    },
    {
      "id": "V-2243",
      "title": "A private web server will be located on a separate controlled access subnet.",
      "description": "Private web servers, which host sites that serve controlled access data, must be protected from outside threats in addition to insider threats. Insider threat may be accidental or intentional but, in either case, can cause a disruption in service of the web server. To protect the private web server from these threats, it must be located on a separate controlled access subnet and must not be a part of the public DMZ that houses the public web servers. It also cannot be located inside the enclave as part of the local general population LAN.",
      "severity": "medium"
    },
    {
      "id": "V-2245",
      "title": "Each readable web document directory will contain either default, home, index, or equivalent file.",
      "description": "The goal is to completely control the web users experience in navigating any portion of the web document root directories. Ensuring all web content directories have at least the equivalent of an index.html file is a significant factor to accomplish this end. Also, enumeration techniques, such as URL parameter manipulation, rely upon being able to obtain information about the web server’s directory structure by locating directories with default pages. This practice helps ensure that the anonymous web user will not obtain directory browsing information or an error message that reveals the server type and version.",
      "severity": "low"
    },
    {
      "id": "V-2246",
      "title": "Web server software will always be vendor-supported versions.",
      "description": "Many vulnerabilities are associated with older versions of web server software. As hot fixes and patches are issued, these solutions are included in the next version of the server software. Maintaining the web server at a current version makes the efforts of a malicious user to exploit the web service more difficult.",
      "severity": "high"
    },
    {
      "id": "V-2247",
      "title": "Only administrators are allowed access to the directory tree, the shell, or other operating system functions and utilities.",
      "description": "As a rule, accounts on a web server are to be kept to a minimum. Only administrators, web managers, developers, auditors, and web authors require accounts on the machine hosting the web server. This is in addition to the anonymous web user account. The resources to which these accounts have access must also be closely monitored and controlled. Only the SA needs access to all the system’s capabilities, while the web administrator and associated staff require access and control of the web content and web server configuration files. The anonymous web user account must not have access to system resources as that account could then control the server.",
      "severity": "high"
    },
    {
      "id": "V-2248",
      "title": "Access to web administration tools is restricted to the web manager and the web manager’s designees.",
      "description": "The key web service administrative and configuration tools must only be accessible by the web server staff. As these services control the functioning of the web server, access to these tools is crucial. This would include access to the Web Admin Server in Netscape, the IIS Management Console, the Apache httpd.conf file, or sysadmin.cfg in Oracle.",
      "severity": "medium"
    },
    {
      "id": "V-2249",
      "title": "Web server administration will be performed over a secure path or at the console.",
      "description": "Logging in to a web server via a telnet session or using HTTP or FTP to perform updates and maintenance is a major risk. In all such cases, userids and passwords are passed in the plain text. A secure shell service or HTTPS need to be installed and in use for these purposes. Another alternative is to administer the web server from the console, which implies physical access to the server.",
      "severity": "high"
    },
    {
      "id": "V-2250",
      "title": "Logs of web server access and errors will be established and maintained",
      "description": "A major tool in exploring the web site use, attempted use, unusual conditions, and problems are reported in the access and error logs. In the event of a security incident, these logs can provide the SA and the web manager with valuable information. Without these log files, SAs and web managers are seriously hindered in their efforts to respond appropriately to suspicious or criminal actions targeted at the web site.",
      "severity": "medium"
    },
    {
      "id": "V-2251",
      "title": "All utility programs, not necessary for operations, will be removed or disabled. ",
      "description": "Just as running unneeded services and protocols is a danger to the web server at the lower levels of the OSI model, running unneeded utilities and programs is also a danger at the application layer of the OSI model. Office suites, development tools, and graphical editors are examples of such programs that are troublesome. Individual productivity tools have no legitimate place or use on an enterprise, production web server and they are also prone to their own security risks. \n",
      "severity": "low"
    },
    {
      "id": "V-2252",
      "title": "Only auditors, SAs or web administrators may access web server log files.",
      "description": "A major tool in exploring the web site use, attempted use, unusual conditions, and problems are the access and error logs. In the event of a security incident, these logs can provide the SA and the web manager with valuable information. To ensure the integrity of the log files and protect the SA and the web manager from a conflict of interest related to the maintenance of these files, only the members of the Auditors group will be granted permissions to move, copy, and delete these files in the course of their duties related to the archiving of these files.",
      "severity": "medium"
    },
    {
      "id": "V-2254",
      "title": "Only web sites that have been fully reviewed and tested will exist on a production web server.",
      "description": "In the case of a production web server, areas for content development and testing will not exist, as this type of content is only permissible on a development web site. The process of developing on a functional production web site entails a degree of trial and error and repeated testing. This process is often accomplished in an environment where debugging, sequencing, and formatting of content are the main goals. The opportunity for a malicious user to obtain files that reveal business logic and login schemes is high in this situation. The existence of such immature content on a web server represents a significant security risk that is totally avoidable.",
      "severity": "medium"
    },
    {
      "id": "V-2256",
      "title": "The access control files are owned by a privileged web server account.",
      "description": "This check verifies that the key web server system configuration files are owned by the SA or by the web administrator controlled account. These same files which control the configuration of the web server and, thus, its behavior must also be accessible by the account that runs the web service. If these files are altered by a malicious user, the web server would no longer be under the control of its managers and owners; properties in the web server configuration could be altered to compromise the entire server platform.",
      "severity": "medium"
    },
    {
      "id": "V-2257",
      "title": "Administrative users and groups that have access rights to the web server are documented.",
      "description": "There are typically several individuals and groups that are involved in running a production web site. In most cases, we can identify several types of users on a web server. These are the System Administrators (SAs), Web Managers, Auditors, Authors, Developers, and the Clients. Nonetheless, only necessary user and administrative accounts will be allowed on the web server. Accounts will be restricted to those who are necessary to maintain web services, review the server’s operation and the operating system. Owing to the sensitivity of web servers, a detailed record of these accounts must be maintained.",
      "severity": "low"
    },
    {
      "id": "V-2258",
      "title": "The web client account access to the content and scripts directories will be limited to read and execute.",
      "description": "Excessive permissions for the anonymous web user account are one of the most common faults contributing to the compromise of a web server.  If this user is able to upload and execute files on the web server, the organization or owner of the server will no longer have control of the asset.",
      "severity": "high"
    },
    {
      "id": "V-2259",
      "title": "Web server system files will conform to minimum file permission requirements.",
      "description": "This check verifies that the key web server system configuration files are owned by the SA or the web administrator controlled account. These same files that control the configuration of the web server, and thus its behavior, must also be accessible by the account that runs the web service. If these files are altered by a malicious user, the web server would no longer be under the control of its managers and owners; properties in the web server configuration could be altered to compromise the entire server platform.",
      "severity": "medium"
    },
    {
      "id": "V-2260",
      "title": "A private web server will not respond to requests from public search engines.",
      "description": "Search engines are constantly at work on the Internet. Search engines are augmented by agents, often referred to as spiders or bots, which endeavor to capture and catalog web site content. In turn, these search engines make the content they obtain and catalog available to any public web user. Such information in the public domain defeats the purpose of a Limited or Certificate-based web server, provides information to those not authorized access to the web site, and could provide clues of the site’s architecture to malicious parties.",
      "severity": "low"
    },
    {
      "id": "V-2261",
      "title": "A public web server will limit e-mail to outbound only.",
      "description": "Incoming e-mails have been known to provide hackers with access to servers. Disabling the incoming mail service prevents this type of attacks. Additionally, e-mail is a specialized application that requires the dedication of server resources. A production web server should only provide hosting services for web sites. Supporting mail services on a web server opens the server to the risk of abuse as an e-mail relay. \n",
      "severity": "medium"
    },
    {
      "id": "V-2262",
      "title": "A private web server will utilize TLS v 1.0 or greater.",
      "description": "Transport Layer Security (TLS) encryption is a required security setting for a private\nweb server. This check precludes the possibility that a valid certificate has been obtained, but TLS has not been activated or is not being used. Transactions encrypted with trusted certificates are necessary when the information being transferred is not intended to be accessed by all parties on the network. To the extent that this standard applies, this check is valid for the SIPRNet also.\n\nFIPS 140-2 compliance includes:\nTLS V1.0 or greater\nTLS must be enabled, the use of SSL disabled\nConfiguration of required cryptographic modules as specified by NIST\n",
      "severity": "medium"
    },
    {
      "id": "V-2263",
      "title": "A private web server will have a valid DoD server certificate.",
      "description": "This check verifies that DoD is a hosted web site's CA. The certificate is actually a DoD-issued server certificate used by the organization being reviewed. This is used to verify the authenticity of the web site to the user. If the certificate is not for the server (Certificate belongs to), if the certificate is not issued by DoD (Certificate was issued by), or if the current date is not included in the valid date (Certificate is valid from), then there is no assurance that the use of the certificate is valid. The entire purpose of using a certificate is, therefore, compromised.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-2264",
      "title": "Wscript.exe and Cscript.exe are accessible by users other than the SA and the web administrator.",
      "description": "Windows Scripting Host (WSH) is installed under either a Typical or Custom installation option of a Microsoft Network Server. This technology permits the execution of powerful script files from the Windows NT command line. This technology is also classified as a Category I Mobile Code. If the access to these files is not tightly controlled, a malicious user could readily compromise the server by using a form to send input to these scripting engines. This is a web-related vulnerability that could exist on any NT / Win 2000 system regardless of the web server software being used on the platform.",
      "severity": "medium"
    },
    {
      "id": "V-2265",
      "title": "Java software installed on the production web server will be limited to class files and the JAVA virtual machine.",
      "description": "From the source code in a .java or a .jpp file, the Java compiler produces a binary file with an extension of .class. The .java or .jpp file would, therefore, reveal sensitive information regarding an application’s logic and permissions to resources on the server. By contrast, the .class file, because it is intended to be machine independent, is referred to as bytecode. Bytecodes are run by the Java Virtual Machine (JVM), or the Java Runtime Environment (JRE), via a browser configured to permit Java code.",
      "severity": "low"
    },
    {
      "id": "V-2270",
      "title": "Anonymous FTP user access to interactive scripts is prohibited.",
      "description": "The directories containing the CGI scripts, such as PERL, must not be accessible to anonymous users via FTP. This applies to all directories that contain scripts that can dynamically produce web pages in an interactive manner (i.e., scripts based upon user-provided input). Such scripts contain information that could be used to compromise a web service, access system resources, or deface a web site.",
      "severity": "medium"
    },
    {
      "id": "V-2271",
      "title": "Monitoring software will include CGI or equivalent programs in the set of files which it checks.",
      "description": "By their very nature, CGI type files permit the anonymous web user to interact with data and perhaps store data on the web server. In many cases, CGI scripts exercise system-level control over the server’s resources. These files make appealing targets for the malicious user. If these files can be modified or exploited, the web server can be compromised. These files must be monitored by a security tool that reports unauthorized changes to these files.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-2272",
      "title": "PERL scripts will use the TAINT option.",
      "description": "PERL (Practical Extraction and Report Language) is an interpreted language optimized for scanning arbitrary text files, extracting information from those text files, and printing reports based on that information. The language is often used in shell scripting and is intended to be practical, easy to use, and efficient means of generating interactive web pages for the user. Unfortunately, many widely available freeware PERL programs (scripts) are extremely insecure. This is most readily accomplished by a malicious user substituting input to a PERL script during a POST or a GET operation.\n\nConsequently, the founders of PERL have developed a mechanism named TAINT that protects the system from malicious input sent from outside the program. When the data is tainted, it cannot be used in programs or functions such as eval(), system(), exec(), pipes, or popen(). The script will exit with a warning message. It is vital that if PERL is being used, the following line appear in the first line of PERL scripts:\n\n#!/usr/local/bin/perl –T\n",
      "severity": "medium"
    },
    {
      "id": "V-3333",
      "title": "The web document (home) directory will be in a separate partition from the web server’s system files.",
      "description": "Web content is accessible to the anonymous web user. For such an account to have access to system files of any type is a major security risk that is entirely avoidable. To obtain such access is the goal of directory traversal and URL manipulation vulnerabilities.  To facilitate such access by mis-configuring the web document (home) directory is a serious error.  In addition, having the path on the same drive as the system folder compounds potential attacks such as drive space exhaustion.\n\n",
      "severity": "medium"
    },
    {
      "id": "V-6373",
      "title": "The required DoD banner page will be displayed to authenticated users accessing a DoD private web site.",
      "description": "A consent banner will be in place to make prospective entrants aware that the web site they are about to enter is a DoD web site and their activity is subject to monitoring. ",
      "severity": "low"
    },
    {
      "id": "V-6531",
      "title": "A web server that utilizes PKI as an authentication mechanism must utilize subscriber certificates issued from a DoD-authorized Certificate Authority.",
      "description": "A DoD private web server, existing within and available across the NIPRNet, must utilize PKI as an authentication mechanism for web users. Information systems residing behind web servers requiring authorization based on individual identity shall use the identity provided by certificate-based authentication to support access control decisions.",
      "severity": "medium"
    },
    {
      "id": "V-6537",
      "title": "Anonymous access accounts are restricted.",
      "description": "Many of the security problems that occur are not the result of a user gaining access to files or data for which the user does not have permissions, but rather users are assigned incorrect permissions to unauthorized data. The files, directories, and data that are stored on the web server need to be evaluated and a determination made concerning authorized access to information and programs on the server. In most cases, we can identify several types of users on a web server. These are system SAs, web administrators, auditors, authors, developers, and clients (web users, either anonymous or authenticated). Only authorized users and administrative accounts will be allowed on the host server to maintain the web server and applications, and to review the server operations. ",
      "severity": "high"
    },
    {
      "id": "V-6577",
      "title": "A web server will be segregated from other services.",
      "description": "To ensure a secure and functional web server, a detailed installation and configuration plan should be developed and followed. This will eliminate mistakes that arise as a result of ad hoc decisions made during the default installation of a server. Planners should not attempt to support multiple services such as Domain Name Service (DNS), e-mail, databases, search engines, and indexing or streaming media on the same server that is providing the web publishing service.\n\nIn the case of File Transfer Protocol (FTP), Simple Mail Transfer Protocol (SMTP), and Network News Transport Protocol (NNTP), a well-defined need for these services should be documented by the IAO prior to their installation on the same platform as a web server. Primary and secondary Domain Controllers, in the Windows environment, will not share a common platform with a web server World Wide Web (WWW) service.\n\nDisallowed or restricted services in the context of this vulnerability applies to services that are not directly associated with the delivery of web content. An operating system that supports a web server will not provide other services (e.g., domain controller, email server, database server, etc.). Only those services necessary to support the web server and its hosted sites are specifically allowed and may include, but are not limited to, operating system, logging, anti-virus, host intrusion detection, administrative maintenance, or network requirements. Any services or protocols that are not necessary should be removed. \n\nA web server may incorporate any number of allowed web services that may be necessary to successfully deliver its mission objectives and as long as those web services are properly configured, secured, and they are not specifically prohibited, then their usage is not prohibited but will be governed by the Enclave, the Application Security and Development, or the Web Services STIG (when developed). These services should be delivered from the application server.\n\nA separate platform in the context of this vulnerability refers to physical, logical, or virtual separation of web server and operating system services; however, the separation associated with application, database, or other servers is governed by the DoD Internet-NIPRNet DMZ STIG.\n",
      "severity": "medium"
    },
    {
      "id": "V-6724",
      "title": "Web server and/or operating system information will be protected.\n\n",
      "description": "The web server response header of an HTTP response can contain several fields of information including the requested HTML page. The information included in this response can be web server type and version, operating system and version, and ports associated with the web server. This provides the malicious user valuable information without the use of extensive tools.",
      "severity": "low"
    }
  ]
}