{
  "name": "windows_defender_antivirus",
  "date": "2017-12-27",
  "description": "The Windows Defender Antivirus Security Technical Implementation Guide (STIG) is published as a tool to improve the security of Department of Defense (DoD) information systems.  Comments or proposed revisions to this document should be send via e-mail to the following address: disa.stig_spt@mail.mil.",
  "title": "Windows Defender Antivirus Security Technical Implementation Guide",
  "version": "1",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-75147",
      "title": "Windows Defender AV must be configured to enable the Potentially Unwanted Application (PUA) feature.",
      "description": "After enabling this feature, Potentially Unwanted Application (PUA) protection blocking takes effect on endpoint clients after the next signature update or computer restart. Signature updates take place daily under typical circumstances. PUA will be blocked and automatically quarantined.",
      "severity": "high"
    },
    {
      "id": "V-75151",
      "title": "Windows Defender AV must be configured to automatically take action on all detected tasks.",
      "description": "This policy setting allows you to configure whether Windows Defender automatically takes action on all detected threats. The action to be taken on a particular threat is determined by the combination of the policy-defined action user-defined action and the signature-defined action. If you enable this policy setting Windows Defender does not automatically take action on the detected threats but prompts users to choose from the actions available for each threat. If you disable or do not configure this policy setting Windows Defender automatically takes action on all detected threats after a nonconfigurable delay of approximately five seconds.",
      "severity": "medium"
    },
    {
      "id": "V-75153",
      "title": "Windows Defender AV must be configured to run and scan for malware and other potentially unwanted software.",
      "description": "This policy setting turns off Windows Defender. If you enable this policy setting Windows Defender does not run and computers are not scanned for malware or other potentially unwanted software. If you disable or do not configure this policy setting by default Windows Defender runs and computers are scanned for malware and other potentially unwanted software.",
      "severity": "high"
    },
    {
      "id": "V-75155",
      "title": "Windows Defender AV must be configured to not exclude files for scanning.",
      "description": "This policy setting allows you to disable scheduled and real-time scanning for files under the paths specified or for the fully qualified resources specified. Paths should be added under the Options for this setting. Each entry must be listed as a name value pair where the name should be a string representation of a path or a fully qualified resource name. As an example a path might be defined as: \"c:\\Windows\" to exclude all files in this directory. A fully qualified resource name might be defined as: \"C:\\Windows\\App.exe\". The value is not used and it is recommended that this be set to 0.",
      "severity": "medium"
    },
    {
      "id": "V-75157",
      "title": "Windows Defender AV must be configured to not exclude files opened by specified processes.",
      "description": "This policy setting allows you to disable scheduled and real-time scanning for any file opened by any of the specified processes. The process itself will not be excluded. To exclude the process use the Path exclusion. Processes should be added under the Options for this setting. Each entry must be listed as a name value pair where the name should be a string representation of the path to the process image. Note that only executables can be excluded. For example a process might be defined as: \"c:\\windows\\app.exe\". The value is not used and it is recommended that this be set to 0.",
      "severity": "medium"
    },
    {
      "id": "V-75159",
      "title": "Windows Defender AV must be configured to enable the Automatic Exclusions feature.",
      "description": "Allows an administrator to specify if Automatic Exclusions feature for Server SKUs should be turned off.",
      "severity": "medium"
    },
    {
      "id": "V-75161",
      "title": "Windows Defender AV must be configured to disable local setting override for reporting to Microsoft MAPS.",
      "description": "This policy setting configures a local override for the configuration to join Microsoft MAPS. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75163",
      "title": "Windows Defender AV must be configured to check in real time with MAPS before content is run or accessed.",
      "description": "This feature ensures the device checks in real time with the Microsoft Active Protection Service (MAPS) before allowing certain content to be run or accessed. If this feature is disabled the check will not occur which will lower the protection state of the device. Enabled - The Block at First Sight setting is turned on. Disabled - The Block at First Sight setting is turned off. This feature requires these Group Policy settings to be set as follows: MAPS -> The \"Join Microsoft MAPS\" must be enabled or the \"Block at First Sight\" feature will not function. MAPS -> The \"Send file samples when further analysis is required\" should be set to 1 (Send safe samples) or 3 (Send all samples). Setting to 0 (Always Prompt) will lower the protection state of the device.  Setting to 2 (Never send) means the \"Block at First Sight\" feature will not function. Real-time Protection -> The \"Scan all downloaded files and attachments\" policy must be enabled or the \"Block at First Sight\" feature will not function. Real-time Protection -> Do not enable the \"Turn off real-time protection\" policy or the \"Block at First Sight\" feature will not function.",
      "severity": "medium"
    },
    {
      "id": "V-75167",
      "title": "Windows Defender AV must be configured to join Microsoft MAPS.",
      "description": "This policy setting allows you to join Microsoft MAPS. Microsoft MAPS is the online community that helps you choose how to respond to potential threats. The community also helps stop the spread of new malicious software infections. You can choose to send basic or additional information about detected software. Additional information helps Microsoft create new definitions and help it to protect your computer. This information can include things like location of detected items on your computer if harmful software was removed. The information will be automatically collected and sent. In some instances personal information might unintentionally be sent to Microsoft. However Microsoft will not use this information to identify you or contact you. Possible options are: (0x0) Disabled (default)  (0x1) Basic membership (0x2) Advanced membership    Basic membership will send basic information to Microsoft about software that has been detected including where the software came from the actions that you apply or that are applied automatically and whether the actions were successful. Advanced membership in addition to basic information will send more information to Microsoft about malicious software spyware and potentially unwanted software including the location of the software file names how the software operates and how it has impacted your computer. If you enable this setting you will join Microsoft MAPS with the membership specified. If you disable or do not configure this setting you will not join Microsoft MAPS. In Windows 10 Basic membership is no longer available so setting the value to 1 or 2 enrolls the device into Advanced membership.",
      "severity": "medium"
    },
    {
      "id": "V-75207",
      "title": "Windows Defender AV must be configured to only send safe samples for MAPS telemetry.",
      "description": "This policy setting configures behavior of samples submission when opt-in for MAPS telemetry is set. Possible options are: (0x0) Always prompt  (0x1) Send safe samples automatically  (0x2) Never send  (0x3) Send all samples automatically.",
      "severity": "medium"
    },
    {
      "id": "V-75209",
      "title": "Windows Defender AV must be configured for protocol recognition for network protection.",
      "description": "This policy setting allows you to configure protocol recognition for network protection against exploits of known vulnerabilities. If you enable or do not configure this setting protocol recognition will be enabled. If you disable this setting protocol recognition will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-75211",
      "title": "Windows Defender AV must be configured to not allow local override of monitoring for file and program activity.",
      "description": "This policy setting configures a local override for the configuration of monitoring for file and program activity on your computer. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75213",
      "title": "Windows Defender AV must be configured to not allow override of monitoring for incoming and outgoing file activity.",
      "description": "This policy setting configures a local override for the configuration of monitoring for incoming and outgoing file activity. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75215",
      "title": "Windows Defender AV must be configured to not allow override of scanning for downloaded files and attachments.",
      "description": "This policy setting configures a local override for the configuration of scanning for all downloaded files and attachments. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75217",
      "title": "Windows Defender AV must be configured to not allow override of behavior monitoring.",
      "description": "This policy setting configures a local override for the configuration of behavior monitoring. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75219",
      "title": "Windows Defender AV Group Policy settings must take priority over the local preference settings.",
      "description": "This policy setting configures a local override for the configuration to turn on real-time protection. This setting can only be set by Group Policy. If you enable this setting the local preference setting will take priority over Group Policy. If you disable or do not configure this setting Group Policy will take priority over the local preference setting.",
      "severity": "medium"
    },
    {
      "id": "V-75221",
      "title": "Windows Defender AV must monitor for incoming and outgoing files.",
      "description": "This policy setting allows you to configure monitoring for incoming and outgoing files without having to turn off monitoring entirely. It is recommended for use on servers where there is a lot of incoming and outgoing file activity but for performance reasons need to have scanning disabled for a particular scan direction. The appropriate configuration should be evaluated based on the server role. Note that this configuration is only honored for NTFS volumes. For any other file system type full monitoring of file and program activity will be present on those volumes. The options for this setting are mutually exclusive: 0 = Scan incoming and outgoing files (default) 1 = Scan incoming files only 2 = Scan outgoing files only  Any other value or if the value does not exist resolves to the default (0). If you enable this setting the specified type of monitoring will be enabled. If you disable or do not configure this setting monitoring for incoming and outgoing files will be enabled.",
      "severity": "medium"
    },
    {
      "id": "V-75223",
      "title": "Windows Defender AV must be configured to monitor for file and program activity.",
      "description": "This policy setting allows you to configure monitoring for file and program activity. If you enable or do not configure this setting monitoring for file and program activity will be enabled. If you disable this setting monitoring for file and program activity will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-75225",
      "title": "Windows Defender AV must be configured to scan all downloaded files and attachments.",
      "description": "This policy setting allows you to configure scanning for all downloaded files and attachments. If you enable or do not configure this setting scanning for all downloaded files and attachments will be enabled. If you disable this setting scanning for all downloaded files and attachments will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-75227",
      "title": "Windows Defender AV must be configured to always enable real-time protection.",
      "description": "This policy setting turns off real-time protection prompts for known malware detection. Windows Defender Antivirus alerts you when malware or potentially unwanted software attempts to install itself or to run on your computer. If you enable this policy setting Windows Defender Antivirus will not prompt users to take actions on malware detections. If you disable or do not configure this policy setting Windows Defender Antivirus will prompt users to take actions on malware detections.",
      "severity": "medium"
    },
    {
      "id": "V-75229",
      "title": "Windows Defender AV must be configured to enable behavior monitoring.",
      "description": "This policy setting allows you to configure behavior monitoring. If you enable or do not configure this setting behavior monitoring will be enabled. If you disable this setting behavior monitoring will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-75231",
      "title": "Windows Defender AV must be configured to process scanning when real-time protection is enabled.",
      "description": "This policy setting allows you to configure process scanning when real-time protection is turned on. This helps to catch malware which could start when real-time protection is turned off. If you enable or do not configure this setting  a process scan will be initiated when real-time protection is turned on. If you disable this setting a process scan will not be initiated when real-time protection is turned on.",
      "severity": "medium"
    },
    {
      "id": "V-75233",
      "title": "Windows Defender AV must be configured to scan archive files.",
      "description": "This policy setting allows you to configure scans for malicious software and unwanted software in archive files such as .ZIP or .CAB files. If you enable or do not configure this setting archive files will be scanned. If you disable this setting archive files will not be scanned.",
      "severity": "medium"
    },
    {
      "id": "V-75235",
      "title": "Windows Defender AV must be configured to scan removable drives.",
      "description": "This policy setting allows you to manage whether or not to scan for malicious software and unwanted software in the contents of removable drives such as USB flash drives when running a full scan. If you enable this setting removable drives will be scanned during any type of scan. If you disable or do not configure this setting removable drives will not be scanned during a full scan. Removable drives may still be scanned during quick scan and custom scan.",
      "severity": "medium"
    },
    {
      "id": "V-75237",
      "title": "Windows Defender AV must be configured to perform a weekly scheduled scan.",
      "description": "This policy setting allows you to specify the day of the week on which to perform a scheduled scan. The scan can also be configured to run every day or to never run at all. This setting can be configured with the following ordinal number values: (0x0) Every Day  (0x1) Sunday  (0x2) Monday  (0x3) Tuesday  (0x4) Wednesday  (0x5) Thursday  (0x6) Friday  (0x7) Saturday  (0x8) Never (default)  If you enable this setting a scheduled scan will run at the frequency specified. If you disable or do not configure this setting a scheduled scan will run at a default frequency.",
      "severity": "medium"
    },
    {
      "id": "V-75239",
      "title": "Windows Defender AV must be configured to turn on e-mail scanning.",
      "description": "This policy setting allows you to configure e-mail scanning. When e-mail scanning is enabled the engine will parse the mailbox and mail files according to their specific format in order to analyze the mail bodies and attachments. Several e-mail formats are currently supported for example: pst (Outlook) dbx mbx mime (Outlook Express) binhex (Mac). If you enable this setting e-mail scanning will be enabled. If you disable or do not configure this setting e-mail scanning will be disabled.",
      "severity": "medium"
    },
    {
      "id": "V-75241",
      "title": "Windows Defender AV spyware definition age must not exceed 7 days.",
      "description": "This policy setting allows you to define the number of days that must pass before spyware definitions are considered out of date. If definitions are determined to be out of date this state may trigger several additional actions including falling back to an alternative update source or displaying a warning icon in the user interface. By default this value is set to 14 days. If you enable this setting spyware definitions will be considered out of date after the number of days specified have passed without an update. If you disable or do not configure this setting spyware definitions will be considered out of date after the default number of days have passed without an update.",
      "severity": "high"
    },
    {
      "id": "V-75243",
      "title": "Windows Defender AV virus definition age must not exceed 7 days.",
      "description": "This policy setting allows you to define the number of days that must pass before virus definitions are considered out of date. If definitions are determined to be out of date this state may trigger several additional actions including falling back to an alternative update source or displaying a warning icon in the user interface. By default this value is set to 14 days. If you enable this setting virus definitions will be considered out of date after the number of days specified have passed without an update. If you disable or do not configure this setting virus definitions will be considered out of date after the default number of days have passed without an update.",
      "severity": "high"
    },
    {
      "id": "V-75245",
      "title": "Windows Defender AV must be configured to check for definition updates daily.",
      "description": "This policy setting allows you to specify the day of the week on which to check for definition updates. The check can also be configured to run every day or to never run at all. This setting can be configured with the following ordinal number values: (0x0) Every Day (default)  (0x1) Sunday   (0x2) Monday  (0x3) Tuesday  (0x4) Wednesday  (0x5) Thursday  (0x6) Friday  (0x7) Saturday  (0x8) Never  If you enable this setting the check for definition updates will occur at the frequency specified. If you disable or do not configure this setting the check for definition updates will occur at a default frequency.",
      "severity": "medium"
    },
    {
      "id": "V-75247",
      "title": "Windows Defender AV must be configured for automatic remediation action to be taken for each threat alert level.",
      "description": "This policy setting allows you to customize which automatic remediation action will be taken for each threat alert level. Threat alert levels should be added under the Options for this setting. Each entry must be listed as a name value pair. The name defines a threat alert level. The value contains the action ID for the remediation action that should be taken. Valid threat alert levels are:  1 = Low  2 =  Medium  4 = High  5 = Severe  Valid remediation action values are: 2 = Quarantine  3 = Remove  6 = Ignore",
      "severity": "medium"
    },
    {
      "id": "V-77965",
      "title": "Windows Defender AV must be configured to block executable content from email client and webmail.",
      "description": "This rule blocks the following file types from being run or launched from an email seen in either Microsoft Outlook or webmail (such as Gmail.com or Outlook.com):\nExecutable files (such as .exe, .dll, or .scr)\nScript files (such as a PowerShell .ps, VisualBasic .vbs, or JavaScript .js file)\nScript archive files",
      "severity": "medium"
    },
    {
      "id": "V-77967",
      "title": "Windows Defender AV must be configured block Office applications from creating child processes.",
      "description": "Office apps, such as Word or Excel, will not be allowed to create child processes.\nThis is a typical malware behavior, especially for macro-based attacks that attempt to use Office apps to launch or download malicious executables.\n",
      "severity": "medium"
    },
    {
      "id": "V-77969",
      "title": "Windows Defender AV must be configured block Office applications from creating executable content.",
      "description": "This rule targets typical behaviors used by suspicious and malicious add-ons and scripts (extensions) that create or launch executable files. This is a typical malware technique.\nExtensions will be blocked from being used by Office apps. Typically these extensions use the Windows Scripting Host (.wsh files) to run scripts that automate certain tasks or provide user-created add-on features.",
      "severity": "medium"
    },
    {
      "id": "V-77971",
      "title": "Windows Defender AV must be configured to block Office applications from injecting into other processes.",
      "description": "Office apps, such as Word, Excel, or PowerPoint, will not be able to inject code into other processes.  This is typically used by malware to run malicious code in an attempt to hide the activity from antivirus scanning engines.",
      "severity": "medium"
    },
    {
      "id": "V-77973",
      "title": "Windows Defender AV must be configured to impede JavaScript and VBScript to launch executables.",
      "description": "JavaScript and VBScript scripts can be used by malware to launch other malicious apps.\nThis rule prevents these scripts from being allowed to launch apps, thus preventing malicious use of the scripts to spread malware and infect machines.",
      "severity": "medium"
    },
    {
      "id": "V-77975",
      "title": "Windows Defender AV must be configured to block execution of potentially obfuscated scripts.",
      "description": "Malware and other threats can attempt to obfuscate or hide their malicious code in some script files.  This rule prevents scripts that appear to be obfuscated from running.\nIt uses the AntiMalwareScanInterface (AMSI) to determine if a script is potentially obfuscated, and then blocks such a script, or blocks scripts when an attempt is made to access them.\n",
      "severity": "medium"
    },
    {
      "id": "V-77977",
      "title": "Windows Defender AV must be configured to block Win32 imports from macro code in Office.",
      "description": "This rule blocks potentially malicious behavior by not allowing macro code to execute routines in the Win 32 dynamic link library (DLL).  ",
      "severity": "medium"
    },
    {
      "id": "V-77979",
      "title": "Windows Defender AV must be configured to prevent user and apps from accessing dangerous websites.",
      "description": "Enable Windows Defender Exploit Guard network protection to prevent employees from using any application to access dangerous domains that may host phishing scams exploit-hosting sites and other malicious content on the Internet.",
      "severity": "medium"
    }
  ]
}