{
  "name": "zos_quest_nc-passtss",
  "date": "2015-01-15",
  "description": "None",
  "title": "z/OS Quest NC-Pass for TSS STIG",
  "version": "None",
  "item_syntax": "^\\w-\\d+$",
  "section_separator": null,
  "items": [
    {
      "id": "V-16932",
      "title": "Quest NC-Pass installation data sets will be properly protected.",
      "description": "Quest NC-Pass installation data sets have the ability to use privileged functions and/or have access to sensitive data. Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-17067",
      "title": "Quest NC-Pass STC data sets will be properly protected.",
      "description": "Quest NC-Pass STC data sets have the ability to use privileged functions and/or have access to sensitive data.  Failure to properly restrict access to these data sets could result in violating the integrity of the base product which could result in compromising the operating system or sensitive data.",
      "severity": "medium"
    },
    {
      "id": "V-17452",
      "title": "Quest NC-Pass Started Task name will be properly identified and/or defined to the system ACP.",
      "description": "Quest NC-Pass requires a started task that will be restricted to certain resources, datasets and other system functions. By defining the started task as a userid to the system ACP, It allows the ACP to control the access and authorized users that require these capabilities. Failure to properly control these capabilities, could compromise of the operating system environment, ACP, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-17454",
      "title": "Quest NC-Pass Started task will be properly defined to the Started Task Table ACID for Top Secret.",
      "description": "Access to product resources should be restricted to only those individuals responsible for the application connectivity and who have a requirement to access these resources.  Improper control of product resources could potentially compromise the operating system, ACP, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-17469",
      "title": "Quest NC-Pass will be properly defined to the Facility Matrix Table. ",
      "description": "Improperly defined security controls for Quest NC-Pass could result in the compromise of the network, operating system, and customer data.",
      "severity": "medium"
    },
    {
      "id": "V-17947",
      "title": "Quest NC-Pass will be used by Highly-Sensitive users.",
      "description": "DISA has directed that Quest NC-Pass extended authentication be implemented on all domains. All users with update and alter access to sensitive system-level data sets and resources, or who possess special security privileges, are required to use NC-Pass for extended authentication.  Typical personnel required to use NC-Pass include, but are not limited to, systems programming, security, operations, network/communications, storage management, and production control.\n\nImproper enforcement of extended authentication through NC-Pass could potentially compromise the operating system, ACP, and customer data.",
      "severity": "medium"
    }
  ]
}